[
  {
    "title": "Senior Analyst",
    "company": "Oyster",
    "location": "London Area, United Kingdom",
    "posted_time": "3 hours ago",
    "posted_datetime": "2025-04-29",
    "logo_url": "https://media.licdn.com/dms/image/v2/C560BAQF3f0neUs_8Vg/company-logo_100_100/company-logo_100_100/0/1662366011747/oyster_partnership_logo?e=2147483647&v=beta&t=27rzwc-6G8uFDE-KOyxneNdgLniICDY6863ycgvkpXw",
    "job_url": "https://uk.linkedin.com/jobs/view/senior-analyst-at-oyster-4198237522?position=3&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=AkGW3EM7RlCW9rElA2txFw%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Senior Analyst – Build-to-Rent Investor&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Opportunity:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;I am pleased to be partnering with a well-capitalised Investor that is actively deploying capital in the Build-to-Rent (BTR) sector. With significant funds available and a strong appetite for transactions, they are looking to expand their portfolio through strategic acquisitions and development opportunities.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This firm is focused on securing high-quality residential assets, leveraging its financial strength to capitalise on the increasing demand for rental housing. With a clear mandate to scale, they are in an exciting phase of growth and seeking a Senior Analyst to support their investment team in executing deals and managing assets effectively.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The successful candidate will take on a pivotal role within the investment team, contributing to high-impact transactions and portfolio growth within a dynamic and entrepreneurial environment.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Lead underwriting and financial evaluation of residential investment opportunities within the BTR sector.&lt;/li&gt;&lt;li&gt;Conduct detailed financial modelling, market analysis, and due diligence to support acquisition and asset management strategies.&lt;/li&gt;&lt;li&gt;Drive transaction execution, liaising with internal and external partners to ensure seamless deal progression.&lt;/li&gt;&lt;li&gt;Monitor portfolio performance and identify value-enhancing initiatives.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;3-4 years of experience in real estate investment, private equity, or real estate finance.&lt;/li&gt;&lt;li&gt;Advanced financial modelling and analytical skills, with strong proficiency in Excel.&lt;/li&gt;&lt;li&gt;A commercial mindset with the ability to assess investment opportunities critically.&lt;/li&gt;&lt;li&gt;Highly motivated, detail-oriented, and capable of thriving in a fast-paced, high-growth environment.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is a unique opportunity to join a progressive and well-funded investment firm at a crucial stage of its growth. If you’re ready to take the next step in your career, apply below or connect with me on LinkedIn (Alexi Lykiardopoulos) to discuss further. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We understand your CV might not be fully up to date—just send over what you have.&lt;/p&gt;"
  },
  {
    "title": "BI Developer – SQL, PowerBI",
    "company": "Stott and May",
    "location": "London Area, United Kingdom",
    "posted_time": "6 hours ago",
    "posted_datetime": "2025-04-29",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQEkWXS_H91Q-A/company-logo_100_100/company-logo_100_100/0/1719826350940/stott_and_may_logo?e=2147483647&v=beta&t=Z-2NAvqpjpx61zaIq6xGf2Q31KKBrubu7E65oUm503s",
    "job_url": "https://uk.linkedin.com/jobs/view/bi-developer-%E2%80%93-sql-powerbi-at-stott-and-may-4195453447?position=5&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=hrYUCGgtQScY4rn3xzUkLQ%3D%3D",
    "description": "&lt;p&gt;BI Developer – SQL, PowerBI &lt;/p&gt;&lt;p&gt;📍 Location: London (Hybrid) &lt;/p&gt;&lt;p&gt;💰 Salary: £60,000 + up to 15% bonus + 10% pension + benefits &lt;/p&gt;&lt;p&gt;MUST HAVE Insurance or Financial experience &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are seeking an ambitious and detail-oriented BI Developer to support the BI function of a fast-paced and innovative Lloyd’s syndicate. You'll play a key role in maintaining and developing Power BI reporting solutions and data warehouse systems for internal and financial reporting.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you have a strong SQL background, experience in Power BI, and a basic understanding of the insurance market, we’d love to hear from you!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;What You’ll Be Doing&lt;/p&gt;&lt;p&gt;✅ Designing and developing BI solutions in cloud and on-premise environments&lt;/p&gt;&lt;p&gt;✅ Creating and maintaining Power BI reports and models&lt;/p&gt;&lt;p&gt;✅ Troubleshooting and triaging BI-related issues (Jira)&lt;/p&gt;&lt;p&gt;✅ Supporting ETL development and DevOps pipelines&lt;/p&gt;&lt;p&gt;✅ Monitoring and resolving daily job failures within agreed timeframes&lt;/p&gt;&lt;p&gt;✅ Collaborating with stakeholders to ensure data solutions meet business needs&lt;/p&gt;&lt;p&gt;✅ Maintaining data architecture, warehouses, and databases&lt;/p&gt;&lt;p&gt;✅ Ensuring full unit testing and change control before deployment&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;What We’re Looking For&lt;/p&gt;&lt;p&gt;✔ Strong SQL coding skills&lt;/p&gt;&lt;p&gt;✔ Experience in Power BI and Microsoft Office suite&lt;/p&gt;&lt;p&gt;✔ A basic understanding of the Insurance market&lt;/p&gt;&lt;p&gt;✔ Excellent problem-solving skills and attention to detail&lt;/p&gt;&lt;p&gt;✔ Ability to manage multiple projects in a fast-paced environment&lt;/p&gt;&lt;p&gt;✔ A proactive team player with strong communication skills&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;📌 Eligibility to work in the UK is required.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;📩 Ready to take the next step? Apply today!&lt;/p&gt;"
  },
  {
    "title": "Product Manager",
    "company": "Socium - Teams Done Differently",
    "location": "London Area, United Kingdom",
    "posted_time": "1 day ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQG4nOkPG6u9rQ/company-logo_100_100/company-logo_100_100/0/1705333214036/socium_teams_done_differently_logo?e=2147483647&v=beta&t=LVVhWHpGRdJLHEw8G60OU45wlduKV5s3p23oJkzCruE",
    "job_url": "https://uk.linkedin.com/jobs/view/product-manager-at-socium-teams-done-differently-4186532258?position=15&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=8pqjYgCvEmMCpoNECuP1mA%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Product Manager - SHOPIFY- B2C e Commerce - Hybrid London- £90000 &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;My Client in London is looking for a Product Manager.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Effective end-to-end product delivery typically involves 4 distinct (overlapping) phases:&lt;/p&gt;&lt;ol&gt;&lt;li&gt;Definition and refinement of a product vision and strategy.&lt;/li&gt;&lt;li&gt;Maintenance of a prioritised roadmap.&lt;/li&gt;&lt;li&gt;Execution of the roadmap in close collaboration with engineering and internal and external stakeholders.&lt;/li&gt;&lt;li&gt;Evaluating the success of the production vision and strategy.&lt;/li&gt;&lt;/ol&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Your role will be to substantially contribute to this process by:&lt;/strong&gt;&lt;/p&gt;&lt;ol&gt;&lt;li&gt;Definition and refinement of a product vision and strategy:&lt;/li&gt;&lt;li&gt;Work with senior management and other stakeholders to refine the production vision and product objectives in an on-going basis using appropriate inputs and your experience.&lt;/li&gt;&lt;li&gt;Maintenance of a prioritised roadmap:&lt;/li&gt;&lt;li&gt;Manage the process through which product change requests and new requirements are received, triaged, and assessed.&lt;/li&gt;&lt;li&gt;Lead the “backlog refinement” sessions during which roadmap items are discussed and (re-)prioritised, accordingly, using appropriate criteria and inputs.&lt;/li&gt;&lt;li&gt;Ensure that the roadmap remains up-to-date and accurate by removing completed or stale items.&lt;/li&gt;&lt;li&gt;Create appropriate documentation/assets that can concisely but clearly communicate to stakeholders and the engineering team the key aspects of roadmap items and how they are intended to work.&lt;/li&gt;&lt;li&gt;Execution of the roadmap:&lt;/li&gt;&lt;li&gt;Disaggregate roadmap items appropriately into epics and work tickets for the engineering team.&lt;/li&gt;&lt;li&gt;Add those tickets to Jira with sufficient standardised content and acceptance criteria.&lt;/li&gt;&lt;li&gt;Prioritise work into “sprints”, in an appropriate order, given priorities, work in progress, and resource availability.&lt;/li&gt;&lt;li&gt;Work closely with the engineering team to answer questions, provide missing information and unblock progress.&lt;/li&gt;&lt;li&gt;Participate in agile ceremonies taking the lead where appropriate.&lt;/li&gt;&lt;li&gt;Contribute to QA efforts by conducting and participating in UAT.&lt;/li&gt;&lt;li&gt;Keep appropriate documentation for non-trivial aspects to minimise errors and inefficiencies when changes need to be made to non-trivial functionality.&lt;/li&gt;&lt;li&gt;Evaluating success:&lt;/li&gt;&lt;li&gt;Ensure that appropriate product-related metrics are correctly captured.&lt;/li&gt;&lt;li&gt;Regularly assess these metrics against the original vision and objectives to gauge success.&lt;/li&gt;&lt;li&gt;Use insights from these metrics to help you revise and refine the roadmap.&lt;/li&gt;&lt;/ol&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Person specification:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ol&gt;&lt;li&gt;Have at least 5 years of experience as a Product Owner in a B2C eCommerce environment.&lt;/li&gt;&lt;li&gt;Have sufficient understanding of relevant technology concepts (web development, PHP, APIs, RDBMS, AWS, interaction of frontends with backends), so that you can bridge the gap between “business” and “tech” and can effectively collaborate with our engineering team.&lt;/li&gt;&lt;li&gt;Are intimately familiar with Scrum and Kanban and have substantial experience of working with both.&lt;/li&gt;&lt;li&gt;Have substantial experience of working with Shopify and product-managing Shopify-related software development. You are aware of Shopify’s key concepts and how it can be customised and extended to meet specific eCommerce requirements.&lt;/li&gt;&lt;li&gt;Are very comfortable using Jira, Confluence and Figma.&lt;/li&gt;&lt;li&gt;Have demonstrable experience of performing the tasks outlined in the role description.&lt;/li&gt;&lt;li&gt;Have worked in a start-up before.&lt;/li&gt;&lt;/ol&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Financial Analyst",
    "company": "Stanton House",
    "location": "Crawley, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-23",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQF5W6F2M4URdQ/company-logo_100_100/company-logo_100_100/0/1681982378109/stanton_house_logo?e=2147483647&v=beta&t=GhUOU-tnQwetHrHw6DUWELvEWXrmabmEYQNMtW_6q9I",
    "job_url": "https://uk.linkedin.com/jobs/view/financial-analyst-at-stanton-house-4214451876?position=16&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=Sh%2FYh5H9LDZqPhJAPwQxyQ%3D%3D",
    "description": "&lt;p&gt;Are you an experienced &lt;strong&gt;Financial Analyst&lt;/strong&gt; looking to make an impact in a dynamic and growing organisation? This is an exciting opportunity to join a company that is driving transformation and strategic growth.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;🔹 &lt;strong&gt;Location: Crawley (1 day a week in the office) - Very easy for someone from Central London to get too&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;🔹 &lt;strong&gt;Salary:&lt;/strong&gt; &lt;strong&gt;£75,000 - £85,000 (depending on experience) + bonus and wider benefits&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;🔹 &lt;strong&gt;Contract Type: Permeant&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Stanton House has been engaged by a well-known and growing financial services business to support them with the hiring of a a Finance Analyst. We are seeking a detail-orientated and motivated individual.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;As part of our their &lt;strong&gt;Financial Planning &amp;amp; Analysis (FP&amp;amp;A) team&lt;/strong&gt;, you will play a critical role in shaping the financial future of our organisation. You’ll work closely with senior stakeholders, providing financial insights and supporting strategic decision-making.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Your Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;✅ Assist in budgeting, forecasting, and long-term financial planning&lt;/p&gt;&lt;p&gt;✅ Analyse financial performance and provide actionable insights&lt;/p&gt;&lt;p&gt;✅ Develop financial reports and dashboards using &lt;strong&gt;MS Power Apps&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;✅ Partner with business teams to align finance and strategy&lt;/p&gt;&lt;p&gt;✅ Identify opportunities for automation and process improvement&lt;/p&gt;&lt;p&gt;✅ Conduct financial data analysis and develop financial models&lt;/p&gt;&lt;p&gt;✅ Support financial systems integration and improvement&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What We’re Looking For:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;✔ &lt;strong&gt;Significant experience in a Financial Analyst role&lt;/strong&gt;, ideally within financial services or a high-performance environment&lt;/p&gt;&lt;p&gt;✔ Expertise in &lt;strong&gt;financial planning, forecasting, financial modelling and business partnering&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;✔ Strong analytical skills with a track record of delivering insights&lt;/p&gt;&lt;p&gt;✔ &lt;strong&gt;Advanced Excel skills&lt;/strong&gt; and experience with &lt;strong&gt;MS Power Apps&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;✔ &lt;strong&gt;ACA, ACCA, or CIMA qualification&lt;/strong&gt; (or working towards one) is a plus&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;If you have the skillset required, or would like further information, please apply below. Unfortunately, we may not be able to respond to every unsuccessful applicant.&lt;/strong&gt;&lt;/p&gt;"
  },
  {
    "title": "Data Scientist",
    "company": "Codat",
    "location": "London Area, United Kingdom",
    "posted_time": "22 hours ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQEvImPpSx4SCA/company-logo_100_100/company-logo_100_100/0/1652449556206/codat_limited_logo?e=2147483647&v=beta&t=vm3H3nggn9wgoE12l74zIWDb5jYehC3hhijZanRV7H4",
    "job_url": "\"https://www.linkedin.com/jobs/view/externalApply/4183340228?url=https%3A%2F%2Fcodat%2Eio%2Fcareers%2F%3Futm_source%3DBXwd30mx7p%26ashby_jid%3Dd1426883-6416-4c94-b81d-eee706a294e1%23open-jobs&urlHash=Df0x\"",
    "description": "&lt;p&gt;&lt;strong&gt;What we do at Codat&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Codat helps banks create stronger, data-driven relationships with their business customers. Our platform makes it easy for banks to access, synchronize, and interpret data from customers' financial software, enabling critical use cases such as supplier onboarding for commercial card and virtual card programs, and underwriting business loans.&lt;/p&gt;&lt;p&gt;We empower the world's largest banks to grow share of wallet, reduce churn, and scale operations efficiently. Codat is backed by leading investors, including JP Morgan, Canapi Ventures, Shopify, Plaid, Tiger Global, PayPal Ventures, Index Ventures, and American Express Ventures.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;We are looking for a product-focused data scientist to join our engineering team. &lt;/p&gt;&lt;p&gt;You are product-minded and passionate about delivering high-quality data-driven solutions.&lt;/p&gt;&lt;p&gt;You’ll be digging through our data to find and bring value to our clients through a mixture of business acumen and technical expertise in data science disciplines.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What makes a great Data Scientist at Codat&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Action-oriented and eager to take ownership of projects and initiative&lt;/li&gt;&lt;li&gt;Start-up mindset - it’s critical that you can deliver at pace and have the attitude to get things done&lt;/li&gt;&lt;li&gt;Knowing when to to switch from scrappy exploratory code to code that adheres to best practices and production-ready standards&lt;/li&gt;&lt;li&gt;Passionate about monitoring and observability of deployed solutions&lt;/li&gt;&lt;li&gt;Proactive and collaborative approach to problem-solving, no problem is too big mindset&lt;/li&gt;&lt;li&gt;Ability to effectively communicate technical concepts to both technical and non-technical team members&lt;/li&gt;&lt;li&gt;Having a broad knowledge of various Machine Learning techniques with their benefits and drawbacks and knowing which one to pick for task at hand&lt;/li&gt;&lt;li&gt;Understanding that not all challenges require the latest LLM model, sometimes less is more&lt;/li&gt;&lt;li&gt;A team player who loves working within a multidisciplinary team and collaborating with other teams&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What you’ll bring to the team&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Strong proficiency in Python and Data science libraries like scikit-learn or equivalent&lt;/li&gt;&lt;li&gt;Experience with SQL/Databricks for data exploration&lt;/li&gt;&lt;li&gt;Ability to explain data science concepts and solutions to broad audiences&lt;/li&gt;&lt;li&gt;Implements and follows ML Ops best practices&lt;/li&gt;&lt;li&gt;Proven record of deploying models to production, ideally as a serverless applications&lt;/li&gt;&lt;li&gt;Understanding why data protection and security practices are important&lt;/li&gt;&lt;li&gt;Familiarity with CI/CD pipelines and cloud-based deployment&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;It would be advantageous but not essential to have experience in the following: &lt;/p&gt;&lt;ul&gt;&lt;li&gt;Experience with containerisation and orchestration technologies like Docker and Kubernetes (K8s)&lt;/li&gt;&lt;li&gt;Experience with LLMs&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Nobody checks every box, and we don’t expect you to! If this role excites you, we encourage you to apply, even if your experience doesn’t perfectly align with every requirement.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Benefits &amp;amp; Perks&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;We offer a range of benefits including:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;🥼 &lt;strong&gt;Healthcare- &lt;/strong&gt;We provide private health insurance through vitality after probation.&lt;/p&gt;&lt;p&gt;🌴 &lt;strong&gt;Holiday- &lt;/strong&gt;25 days+ bank holidays - rising one day per year of service up to 30 days.&lt;/p&gt;&lt;p&gt;🧩 &lt;strong&gt;Equity - &lt;/strong&gt;Success is a team game and everyone receive's a piece of the success&lt;/p&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Assistant Project Manager",
    "company": "Boccard",
    "location": "Devon, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-22",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4E0BAQGixEM_PianrQ/company-logo_100_100/company-logo_100_100/0/1631307659809?e=2147483647&v=beta&t=X38UYq4KHraNrlVXDPaKHIk22BsQ7TLGdz-kkhXs_5M",
    "job_url": "https://uk.linkedin.com/jobs/view/assistant-project-manager-at-boccard-4188514192?position=25&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=0jcDXTKnr76rLzqXHEhI9A%3D%3D",
    "description": "&lt;p&gt;Boccard UK, is working closely with our client a leading producer of high-quality dairy products and is committed to innovation and excellence. We are looking for a dedicated and dynamic Assistant Project Manager based in in Taunton who is able to travel to our Bristol office for regular meetings. This is an important and responsible role, supporting the project management lifecycle, ensuring projects are delivered safely, on time, on spec, and within budget, aiming for client satisfaction. The role supports improvements in project management processes, reporting, and setup assistance during various project phases.&lt;/p&gt;&lt;p&gt;The Assistant Project Manager will manage one or more projects or sub-projects, based at the client site in Devon, with travel to Bristol and France for stakeholder meetings.&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Assist in planning and executing projects within the food manufacturing sector.&lt;/li&gt;&lt;li&gt;Coordinate with various departments to ensure project milestones are met.&lt;/li&gt;&lt;li&gt;Monitor project progress and report on performance.&lt;/li&gt;&lt;li&gt;Lead risk and opportunity reviews&lt;/li&gt;&lt;li&gt;Follow up on actions from IRIS with owners.&lt;/li&gt;&lt;li&gt;Manage project documentation and ensure compliance with industry standards.&lt;/li&gt;&lt;li&gt;Support the Project Manager in day-to-day tasks and decision-making processes.&lt;/li&gt;&lt;li&gt;Support the Project Manager with administration of contract management including early warning notifications and scope changes.&lt;/li&gt;&lt;li&gt;Manage subcontractors and ensure contractual arrangements are met&lt;/li&gt;&lt;li&gt;Promote consistency and reliability of digital data for project delivery.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Ideally holds Bachelor’s degree in Food Science, Engineering, Business Administration, or a related field or at least to a further Education standard.&lt;/li&gt;&lt;li&gt;Previous experience in project management, preferably in the food manufacturing industry.&lt;/li&gt;&lt;li&gt;Strong organizational and multitasking skills.&lt;/li&gt;&lt;li&gt;Excellent communication and interpersonal abilities.&lt;/li&gt;&lt;li&gt;Must be fluent in English language skills&lt;/li&gt;&lt;li&gt;IT proficiency including in project management software (e.g., MS Project, Asana).&lt;/li&gt;&lt;li&gt;Knowledge of food safety and quality standards (e.g., HACCP, ISO).&lt;/li&gt;&lt;li&gt;Must hold a current driving license&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Financial Controller",
    "company": "JSS Search",
    "location": "Reading, England, United Kingdom",
    "posted_time": "4 days ago",
    "posted_datetime": "2025-04-25",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFflDFNgktA5Q/company-logo_100_100/company-logo_100_100/0/1719820348099/jss_search_limited_logo?e=2147483647&v=beta&t=fNeZfwri-qWylc0w_0V11sTRC8fSn2T3TrRP3h-9EWA",
    "job_url": "https://uk.linkedin.com/jobs/view/financial-controller-at-jss-search-4214284329?position=31&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=lQBtS8l0iWAcyylBKRKZ%2BQ%3D%3D",
    "description": null
  },
  {
    "title": "Marketing Lead",
    "company": "Sanderson",
    "location": "London Area, United Kingdom",
    "posted_time": "4 days ago",
    "posted_datetime": "2025-04-24",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGjGXOmBd8S6w/company-logo_100_100/company-logo_100_100/0/1712748196615/sandersonrecruitmentplc_logo?e=2147483647&v=beta&t=5yNzTn1DRFPjc8XxR1xAsJJj29vpHfGdUKWI802X3h4",
    "job_url": "https://uk.linkedin.com/jobs/view/marketing-lead-at-sanderson-4216584683?position=38&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=vg6viuB1qvVwrW6f%2FiDmtw%3D%3D",
    "description": null
  },
  {
    "title": "Head of Information Technology Operations",
    "company": "Chroma Recruitment",
    "location": "Wigan, England, United Kingdom",
    "posted_time": "1 day ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/D560BAQGjTq0rIgnBKQ/company-logo_100_100/company-logo_100_100/0/1721750867972/chroma_recruitment_limited_logo?e=2147483647&v=beta&t=BW103gtgalKPplsZhYbQjdg-JQnXhwJT5hbVvVxZ2EY",
    "job_url": "https://uk.linkedin.com/jobs/view/head-of-information-technology-operations-at-chroma-recruitment-4216650980?position=39&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=k5q%2BB62spQQxdBJhjEpzFA%3D%3D",
    "description": null
  },
  {
    "title": "Financial Analyst",
    "company": "Morgan McKinley",
    "location": "Milton Keynes, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-23",
    "logo_url": "https://media.licdn.com/dms/image/v2/D560BAQG3AZHiZxLLWg/company-logo_100_100/company-logo_100_100/0/1665991664218/morgan_mckinley_logo?e=2147483647&v=beta&t=hcrowdFXsf7uuZ5EcbWotEprnxvDjmtGw9xOZWH1pc0",
    "job_url": "https://uk.linkedin.com/jobs/view/financial-analyst-at-morgan-mckinley-4214471272?position=41&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=puIzoKu%2Bq9e%2FSvFeg9FUJg%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Financial Analyst&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Milton Keynes&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;£55,000 - £65,000 plus excellent benefits&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Morgan McKinley is pleased to be working in collaboration with an fast paced, consumable goods business to recruit an ambitious financial analyst who can business partner senior stakeholder across the organisation.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;They are seeking a highly skilled accountant who can provide support and constructive challenge to drive outputs and improve financial performance.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Responsibilities for the Financial Analyst will include:&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Build and evolve in depth costing processes.&lt;/li&gt;&lt;li&gt;Provide insights and analysis into performance, identify areas of improvement and drive outputs.&lt;/li&gt;&lt;li&gt;Work in tandan with the commercial teams to prepare budgets and forecasts, along with variance reporting.&lt;/li&gt;&lt;li&gt;Own the month end close.&lt;/li&gt;&lt;li&gt;Assess cost drivers and their impact on performance.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Profile&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Qualified Accountant (ACA / ACCA / CIMA) or in the final stage of their studies.&lt;/li&gt;&lt;li&gt;Strong communication skills - able to push back AND able to support stakeholders.&lt;/li&gt;&lt;li&gt;High degree of commercial acumen.&lt;/li&gt;&lt;li&gt;Strong Excel knowledge.&lt;/li&gt;&lt;li&gt;Solid experience across variance analaysis, budgeting and forecasting.&lt;/li&gt;&lt;li&gt;Results orientated, with a desire to succeed.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Company&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Based in Milton Keynes, the business is at the forefront of innovation, offer fantastic career development and are known for developing talent.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Salary &amp;amp; Benefits&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The role of Financial Analyst has a range of &lt;strong&gt;£55,000 - £65,000&lt;/strong&gt;, plus bonus and excellent benefits.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Compliance Manager",
    "company": "Lutine Bell",
    "location": "Greater London, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-22",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQH53DK9Oe6I7A/company-logo_100_100/company-logo_100_100/0/1688113691535/lutine_bell_logo?e=2147483647&v=beta&t=1_Ki9MsG1RbspJpELTFPhr88-EGvKoSufeSUxkYeptM",
    "job_url": "https://uk.linkedin.com/jobs/view/compliance-manager-at-lutine-bell-4214623768?position=45&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=I1TGtH16YRenNG1v7Rn0ww%3D%3D",
    "description": "&lt;p&gt;Lutine Bell are currently supporting a Global Insurer looking to appoint a Compliance Manager reporting directly into the Head of Compliance.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Contribute to the maintenance of the company’s compliance obligations universe.&lt;/li&gt;&lt;li&gt;Contribute to the development and implementation of compliance strategy and the annual compliance plan.&lt;/li&gt;&lt;li&gt;Contribute to the horizon scanning and monitoring of regulatory developments and support the communication and reporting to stakeholders and governance committees and update of the obligation universe.&lt;/li&gt;&lt;li&gt;Lead the identification and assessment of compliance risks of the company and support the development of appropriate mitigation strategies.&lt;/li&gt;&lt;li&gt;Lead the evaluation of the design and operational effectiveness of processes and controls relevant to maintaining compliance with obligations.&lt;/li&gt;&lt;li&gt;Support the ongoing evolution of mitigation strategies and the development and enhancement of processes and controls relevant to maintaining compliance with obligations.&lt;/li&gt;&lt;li&gt;Contribute to compliance deep dive and thematic reviews to identify risks and areas for improvement with respect to meeting compliance obligations. Provide recommendations for the remediation of issues and oversee completion.&lt;/li&gt;&lt;li&gt;Maintain the company’s customer complaints handling procedures and oversee their effective implementation.&lt;/li&gt;&lt;li&gt;Provide independent review and response of customer complaints and manage the escalation of customer complaints to the Financial Ombudsman Service.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;At least 4 years’ work experience of compliance related work in general insurance market.&lt;/li&gt;&lt;li&gt;Bachelor's degree or above.&lt;/li&gt;&lt;li&gt;Good understanding of compliance oversight methods and principles.&lt;/li&gt;&lt;li&gt;Good understanding of UK insurance regulation by the PRA and FCA.&lt;/li&gt;&lt;li&gt;Good stakeholder and relationship management skills.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;London (hybrid working)&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;up to £85,000 (plus bonus &amp;amp; benefits)&lt;/p&gt;"
  },
  {
    "title": "Senior Operations Analyst with Global Hedge Fund",
    "company": "OCR Alpha",
    "location": "London Area, United Kingdom",
    "posted_time": "5 hours ago",
    "posted_datetime": "2025-04-29",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHrHSCmAUC-uA/company-logo_100_100/company-logo_100_100/0/1661184340933/ocr_alpha_logo?e=2147483647&v=beta&t=cHXyGzZaM_Q-Oqj5eYez6EQ18UBMQN_zbT6l4nwHJJA",
    "job_url": "https://uk.linkedin.com/jobs/view/senior-operations-analyst-with-global-hedge-fund-at-ocr-alpha-4187439244?position=47&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=6%2B5gjxxLONcZX%2Bd%2FWcdRkg%3D%3D",
    "description": "&lt;p&gt;We are working with one of our clients, an established multi-strategy hedge fund with a 30 year track record, to hire for a newly created senior operations role. The role would be the most senior ops team member in the London office.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The role itself would take on a lot of responsibility in terms of managing all the funds day to day, for example dealing with various counterparties and oversight of the fund administrator. This would also be a chance to work closely alongside a number of Portfolio Managers.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The ideal candidate will have at least 5 years of buy side operations experience, and as mentioned before, have good knowledge of a variety of products. Experience in launching new funds is also highly desirable.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The role will pay a base salary of between £90-120k, depending on previous experience, plus a strong bonus structure. They also offer hybrid working.&lt;/p&gt;"
  },
  {
    "title": "Head of Social (Sports, Entertainment, Lifestyle)",
    "company": "Profiles Creative",
    "location": "London Area, United Kingdom",
    "posted_time": "4 hours ago",
    "posted_datetime": "2025-04-29",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQGRAWCUUZuMFA/company-logo_100_100/company-logo_100_100/0/1630522370121/profiles_creative_logo?e=2147483647&v=beta&t=u-aPQIpcsbJMeqek9AuXaEQ1b48PtQRYnLOmQtny16g",
    "job_url": "https://uk.linkedin.com/jobs/view/head-of-social-sports-entertainment-lifestyle-at-profiles-creative-4217599357?position=49&pageNum=0&refId=njHIRMPEmw5ggMdo72Lx5Q%3D%3D&trackingId=bCj9f1JHK%2Bt8gn2lLQI%2FZQ%3D%3D",
    "description": "&lt;p&gt;As the Head of Social for this global integrated agency within the sports, entertainment and leisure industries, you will spearhead the social media division, crafting and executing innovative strategies that set new benchmarks in the industry.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This senior, hands-on role is ideal for a visionary leader with a broad understanding of the digital marketing and creative landscape, who thrives in a fast-paced, entrepreneurial environment and is passionate about delivering best-in-class results.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You will lead an expert team across all areas of social, fostering a culture of innovation and collaboration.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The Role&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Develop and implement a comprehensive social media strategy that aligns with client objectives, encompassing all aspects of social media marketing, from content creation and community management to paid social advertising and influencer marketing.&lt;/li&gt;&lt;li&gt;Lead the team in delivering measurable results across key metrics.&lt;/li&gt;&lt;li&gt;Act as a strategic partner to clients, providing expert guidance on social media trends, best practices, and emerging opportunities.&lt;/li&gt;&lt;li&gt;Recruit, onboard, and lead a talented team of social media specialists, fostering a collaborative, innovative and high-performing environment.&lt;/li&gt;&lt;li&gt;Provide strategic direction and oversight for all social media content, ensuring alignment with client objectives, brand guidelines, and audience trends.&lt;/li&gt;&lt;li&gt;Communicate performance data and insights to clients and internal teams, providing recommendations for optimization and improvement.&lt;/li&gt;&lt;li&gt;Integrate social media strategies with other marketing efforts, such as content marketing, SEO, email marketing, and paid advertising.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The Person&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Ideally at least 6 years of experience leading high-impact social media campaigns, demonstrating a deep understanding of social media strategy and execution.&lt;/li&gt;&lt;li&gt;Expertise across various social media platforms, including TikTok, Instagram, Facebook, LinkedIn, and YouTube.&lt;/li&gt;&lt;li&gt;Exceptional leadership skills, with the ability to inspire, motivate, and guide a team to achieve exceptional results.&lt;/li&gt;&lt;li&gt;A strong analytical mindset, with a focus on data-driven decision-making and performance optimization.&lt;/li&gt;&lt;li&gt;An entrepreneurial spirit, with a passion for innovation, experimentation, and pushing creative boundaries.&lt;/li&gt;&lt;li&gt;A willingness to be hands-on in all aspects of social media, from strategy development to content creation and community management.&lt;/li&gt;&lt;li&gt;A strong understanding of the broader digital marketing landscape, including content marketing, SEO, paid advertising, and analytics.&lt;/li&gt;&lt;/ul&gt;"
  },
  {
    "title": "Financial Controller",
    "company": "JSS Search",
    "location": "Reading, England, United Kingdom",
    "posted_time": "4 days ago",
    "posted_datetime": "2025-04-25",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQFflDFNgktA5Q/company-logo_100_100/company-logo_100_100/0/1719820348099/jss_search_limited_logo?e=2147483647&v=beta&t=fNeZfwri-qWylc0w_0V11sTRC8fSn2T3TrRP3h-9EWA",
    "job_url": "https://uk.linkedin.com/jobs/view/financial-controller-at-jss-search-4214284329?position=6&pageNum=2&refId=ZVQVVtjFHL6AlV3X2nc71g%3D%3D&trackingId=o87XZNp0rqn1QkvHfMlgrQ%3D%3D",
    "description": "&lt;p&gt;I’m excited to be partnering with a fast-growing, private equity-backed multi-site business headquartered in Reading. They are looking for a commercially minded and technically strong &lt;strong&gt;Financial Controller&lt;/strong&gt; to join their finance team and play a key role in ensuring robust financial controls and reporting across the business.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The &lt;strong&gt;Financial Controller&lt;/strong&gt; will be responsible for leading the day-to-day finance function, ensuring compliance with financial regulations, setting and testing financial controls and providing guidance to stakeholders.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;You’ll be involved in:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Lead the month-end and year-end close processes ensuring accuracy and timeliness&lt;/li&gt;&lt;li&gt;Oversee statutory reporting in line with IFRS and PE requirements&lt;/li&gt;&lt;li&gt;Manage and strengthen financial controls across the business&lt;/li&gt;&lt;li&gt;Ensure compliance with tax, audit, and regulatory requirements&lt;/li&gt;&lt;li&gt;Liaise with external auditors and advisors during the annual audit process&lt;/li&gt;&lt;li&gt;Develop and manage the financial reporting framework including KPIs and board reporting&lt;/li&gt;&lt;li&gt;Business partner with senior stakeholders&lt;/li&gt;&lt;li&gt;Drive improvements in systems, processes, and financial governance&lt;/li&gt;&lt;li&gt;Support integration of acquisitions and business expansion projects&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Qualifications &amp;amp; Experience:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Fully qualified accountant (ACA/ACCA/CIMA), ideally from an audit background&lt;/li&gt;&lt;li&gt;Strong technical accounting background with experience in IFRS (15 &amp;amp; 16)&lt;/li&gt;&lt;li&gt;Demonstrable experience with Controls, Risks and Compliance, ideally from a fast-paced PLC, or PE-backed business&lt;/li&gt;&lt;li&gt;Hands-on and detail-oriented with the ability to step back and see the bigger picture&lt;/li&gt;&lt;li&gt;Strong interpersonal and communication skills with the ability to influence stakeholders&lt;/li&gt;&lt;li&gt;Comfortable working in a high-growth, agile environment&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s on Offer&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Competitive base salary of £85,000&lt;/li&gt;&lt;li&gt;Performance-based bonus&lt;/li&gt;&lt;li&gt;Hybrid working and flexible working hours&lt;/li&gt;&lt;li&gt;Opportunity to shape the finance function in a high-growth business&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If this is of interest please apply below or conversely reach out via email: toby.butler@jss-finance.com&lt;/p&gt;"
  },
  {
    "title": "Editorial Content Manager",
    "company": "Institution of Civil Engineers (ICE)",
    "location": "London Area, United Kingdom",
    "posted_time": "1 day ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/C560BAQG-sCQtu36RLQ/company-logo_100_100/company-logo_100_100/0/1630620984774/institution_of_civil_engineers_logo?e=2147483647&v=beta&t=AhwEIdIZ3WsY8aAAds95XSMJwVClzoMJp8-oU59T2-o",
    "job_url": "https://uk.linkedin.com/jobs/view/editorial-content-manager-at-institution-of-civil-engineers-ice-4218688954?position=1&pageNum=10&refId=viKzp84kAKUEXuK8gPxoaw%3D%3D&trackingId=oq29UZZIocAEzONiN1AHmw%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Editorial Content Manager&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Institution of Civil Engineers (ICE) is a global membership organisation with over 100,000 members and more than two centuries of history. As a centre of engineering excellence, we qualify civil engineers, support lifelong professional development, and assure society that the infrastructure shaping our world is safe, sustainable, and well-designed.&lt;/p&gt;&lt;p&gt;Our community of experts also provides trusted, impartial advice to policymakers on how to build and adapt infrastructure for a better future.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;We are looking for an Editorial Content Manager to lead the creation, editing, and production of high-quality NEC content across digital and print formats. This role is pivotal in upholding our content standards while aligning with TTL’s strategy of innovation, sustainability, and continuous improvement.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Copy-edit, proofread, and ensure consistency of content relating to NEC Contracts.&lt;/li&gt;&lt;li&gt;Manage content workflows and style guidelines across formats.&lt;/li&gt;&lt;li&gt;Collaborate with internal teams, SMEs, and production partners.&lt;/li&gt;&lt;li&gt;Oversee end-to-end editorial production—from concept to publication.&lt;/li&gt;&lt;li&gt;Support content promotion with marketing and sales teams.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About You:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Significant editorial experience, ideally in professional publishing.&lt;/li&gt;&lt;li&gt;Exceptional attention to detail and command of English.&lt;/li&gt;&lt;li&gt;A proven ability to translate complex information into clear and consistent organised content.&lt;/li&gt;&lt;li&gt;Experience with CMS, MS Office, and editorial QA processes.&lt;/li&gt;&lt;li&gt;Bonus: XML/SGML, InDesign, Asana.&lt;/li&gt;&lt;li&gt;Strong communicator, proactive collaborator, and highly organised.&lt;/li&gt;&lt;li&gt;Degree in English, Law, Humanities or related field.&lt;/li&gt;&lt;li&gt;Additional languages an advantage.&lt;/li&gt;&lt;li&gt;Professional qualification in Law, Construction Management or a related field would be an advantage.&lt;/li&gt;&lt;li&gt;Subject matter knowledge of NEC Contracts an advantage.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;If you're an experienced editor with a passion for clear, consistent content, we’d love to hear from you&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The ICE is an equal opportunities employer, and all reasonable adjustments will be considered for applicants with disabilities or special requirements under the terms of the Equality Act 2010.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Financial Controller",
    "company": "Morgan McKinley",
    "location": "London Area, United Kingdom",
    "posted_time": "4 days ago",
    "posted_datetime": "2025-04-24",
    "logo_url": "https://media.licdn.com/dms/image/v2/D560BAQG3AZHiZxLLWg/company-logo_100_100/company-logo_100_100/0/1665991664218/morgan_mckinley_logo?e=2147483647&v=beta&t=hcrowdFXsf7uuZ5EcbWotEprnxvDjmtGw9xOZWH1pc0",
    "job_url": "https://uk.linkedin.com/jobs/view/financial-controller-at-morgan-mckinley-4213547195?position=4&pageNum=10&refId=viKzp84kAKUEXuK8gPxoaw%3D%3D&trackingId=fygBFTl7FneBqXqiPHIGWQ%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Position: Financial Controller&lt;/strong&gt;&lt;/p&gt;&lt;p&gt; &lt;strong&gt;Location: London, UK&lt;/strong&gt;&lt;/p&gt;&lt;p&gt; &lt;strong&gt;Industry: Investment Management&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are currently partnering with a leading, privately owned, and employee-managed investment management firm that is structurally aligned with the long-term interests of its clients. This firm stands out in the investment management space due to its independence, with no external parent company or public shareholders to serve, ensuring a focus solely on its core mission. The firm’s unique employee ownership structure means that their team members, including their families, have investments that align directly with the firm’s success, with all employee deferred compensation linked to the company’s strategies.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;With a strong global presence, the firm operates across 20+ cities worldwide, managing over $250 billion in assets. This includes a diverse range of investment strategies such as equity, fixed income, private equity, and hedge funds, serving institutions, financial advisors, and individual investors worldwide. Since regaining independence in 2009, the firm has seen impressive growth, particularly in the EMEA and Latin America regions, where it now oversees nearly $40 billion in client assets.&lt;/p&gt;&lt;p&gt;We are excited to announce an opportunity to join this firm as a &lt;strong&gt;Financial Controller&lt;/strong&gt; based in London. This key position will be responsible for the financial oversight of several corporate entities within the organization. The role offers the chance to work in a collaborative and client-focused environment, contributing to a company that has consistently been recognized for its positive culture and strong employee retention rates.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Financial Oversight:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Take full ownership of the financial management for multiple corporate entities.&lt;/li&gt;&lt;li&gt;Ensure proper governance, control, and compliance with internal and external reporting requirements.&lt;/li&gt;&lt;li&gt;Oversee operational accounting entries processed by centralized functions.&lt;/li&gt;&lt;li&gt;Prepare and present monthly, quarterly, and annual management reports.&lt;/li&gt;&lt;li&gt;Manage all statutory and regulatory reporting, ensuring timely and accurate submissions.&lt;/li&gt;&lt;li&gt;Supervise cash flow and capital management activities.&lt;/li&gt;&lt;li&gt;Lead the interim and year-end audit processes.&lt;/li&gt;&lt;li&gt;Review and recommend improvements for current financial processes, procedures, and systems, and implement these changes across the finance team.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Operational Accounting:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Conduct reconciliation and review of key balance sheet accounts.&lt;/li&gt;&lt;li&gt;Manage accruals and manual rebate calculations to ensure accurate reporting.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Business Support:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Prepare board-level and business-level management reports.&lt;/li&gt;&lt;li&gt;Provide financial modeling for new product launches, fund reviews, and investor impact analysis.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Qualified accountant (preferably with at least 2+ years of post-qualification experience).&lt;/li&gt;&lt;li&gt;Strong interpersonal skills, with the ability to work with multiple internal stakeholders.&lt;/li&gt;&lt;li&gt;Highly organized with a proven ability to adhere to deadlines and escalate issues when necessary.&lt;/li&gt;&lt;li&gt;A self-starter, capable of working independently while collaborating with the wider finance team.&lt;/li&gt;&lt;li&gt;Advanced Excel skills, including financial modeling and complex functions.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is an exciting opportunity to join a high-growth, employee-centric investment firm that is deeply committed to the success of its clients and employees alike. If you’re looking for a challenging yet rewarding role within an innovative and stable organization, we encourage you to apply!&lt;/p&gt;"
  },
  {
    "title": "Head of People Programmes",
    "company": "Imperial College London",
    "location": "Greater London, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-23",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGOM2ioD3Ym6w/company-logo_100_100/company-logo_100_100/0/1719955498213/imperial_college_london_logo?e=2147483647&v=beta&t=pZqbRXAf7l2ucC7JQSlOIRKqJMRnhnyKz0wK5zpmjSs",
    "job_url": "\"https://www.linkedin.com/jobs/view/externalApply/4215382117?url=https%3A%2F%2Fwww%2Eimperial%2Eac%2Euk%2Fjobs%2Fsearch-jobs%2Fdescription%2Findex%2Ephp%3FjobId%3D23892%26jobTitle%3DHead%2Bof%2BPeople%2BProgrammes&urlHash=qhTm\"",
    "description": "&lt;br&gt;&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are excited to announce the creation of several new roles as part of a comprehensive review of the People function. This transformation has been designed to better align with the university’s mission and strategic priorities while enhancing its overall impact. We are looking forward to welcoming passionate and talented individuals who will play a pivotal role in driving our success and shaping the future of the university.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This role is a newly created, with the intention that it will help to build more collaborative ways of working, and putting the user at the centre of what we do. Most importantly, it is focused on ensuring effective delivery, and tangible, positive outcomes to project and product development work within the People Division.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What you would be doing&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;We are looking for a dynamic Programme Manager to lead the successful delivery of high-impact initiatives from inception through to completion. You’ll take ownership of all aspects of programme management—planning, risk and dependency management, governance, and reporting—while driving forward some of our most strategic priorities. In this role, you'll work closely with the Chief People Officer to lead key projects such as the People Plan 2025–2030, the People Group staff survey action plan, and the development of a vibrant HR Community of Practice across the university. You will coach and support agile project teams, helping them deliver innovative products, services, and change. Success in this role means bringing together the right people at the right time, maintaining momentum, and using your influence and determination to drive delivery forward.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Degree level qualification (or equivalent experience)&lt;/li&gt;&lt;li&gt;Proven experience in delivery projects&lt;/li&gt;&lt;li&gt;Proven experience balancing multi-disciplinary teams&lt;/li&gt;&lt;li&gt;Good financial management of project budgets and reporting&lt;/li&gt;&lt;li&gt;Previous experience of project management in HR&lt;/li&gt;&lt;li&gt;Excellent facilitation, collaboration, and communication skills&lt;/li&gt;&lt;li&gt;Good knowledge of a range of project management tools&lt;/li&gt;&lt;li&gt;Exceptional interpersonal skills, including the ability to persuade and influence stakeholders&lt;/li&gt;&lt;li&gt;Ability to understand complex customer demands and turn them into easy-to-understand user stories&lt;/li&gt;&lt;li&gt;Naturally curious and always looking to learn lessons and improve&lt;/li&gt;&lt;li&gt;Thrives on challenges and seeks to achieve results&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What we can offer you&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;The opportunity to continue your career at a world-leading institution and be part of our mission to use science for humanity&lt;/li&gt;&lt;li&gt;Benefit from a sector-leading salary and remuneration package (including 39 days’ annual leave and generous pension schemes)&lt;/li&gt;&lt;li&gt;Interest-free season ticket loan schemes for travel&lt;/li&gt;&lt;li&gt;Be part of a diverse, inclusive and collaborative work culture with various staff networks and resources to support your personal and professional wellbeing&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Further information&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;This is a full-time post. We operate a hybrid working model with the expectation of being in person three days a week.&lt;/p&gt;"
  },
  {
    "title": "Business Intelligence Developer",
    "company": "Safetykleen",
    "location": "Brentford, England, United Kingdom",
    "posted_time": "1 hour ago",
    "posted_datetime": "2025-04-29",
    "logo_url": null,
    "job_url": "https://uk.linkedin.com/jobs/view/business-intelligence-developer-at-safetykleen-4217840931?position=8&pageNum=10&refId=viKzp84kAKUEXuK8gPxoaw%3D%3D&trackingId=7tLDMIm9LS4r1g43P3Vstg%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;The Opportunity&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Want to make a real impact in a fast-paced, high-growth company? To work in a dynamic environment where your insights drive strategy and performance?&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If so, we have the perfect opportunity for you!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We’re looking for a strategic, hands-on &lt;strong&gt;Group BI Developer&lt;/strong&gt; to take ownership of our business reporting and analytics across key functional areas - ensuring Safetykleen continues to evolve and excel in meeting the future needs of our customers' and supports our vision of making our planet Safer and Kleener!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;As a key member of our Reporting &amp;amp; Analytics team, you will design and manage scalable analytical models, dashboards, and KPI reports that empower our leadership team with clear, actionable insights with a focus on core areas such as Procurement &amp;amp; Supply Chain, Inventory Management, Stock Usage, and Materials &amp;amp; Machine Management.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;You’re someone who’s driven by impact and thrives in a fast-paced, ambitious environment where your work directly influences business strategy.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;With a background in business analytics and a solid track record of delivering insightful reports, you bring both technical expertise and strategic thinking to the table. You’re an expert in using tools like &lt;strong&gt;Power BI&lt;/strong&gt; and &lt;strong&gt;SQL&lt;/strong&gt; to extract, model, and interpret data, and you’re experienced with &lt;strong&gt;Microsoft D365 Finance and Operations&lt;/strong&gt;.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Your attention to detail and ability to communicate complex information clearly allows you to translate data into compelling, actionable insights for a range of stakeholders. You’re collaborative, inquisitive, and ready to take on high-profile projects that offer professional development, European travel, and the opportunity to make a tangible impact.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Safetykleen is a leading provider of Parts Cleaning, Waste Collection and Environmental Advisory services to businesses across Europe.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Safetykleen employs over 2,000 people and serves over 50,000 businesses in 14 countries. We deliver over 1 million services per year through our unparalleled branch network. Our headquarters are based in London, and we are backed by Apax, a leading Private Equity firm.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are built on a strong business model, winning culture, and always putting the customer at the heart of everything we do.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Package&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;£60,000 - £70,000 salary per annum.&lt;/li&gt;&lt;li&gt;Company Bonus.&lt;/li&gt;&lt;li&gt;30 days holiday plus Bank Holidays.&lt;/li&gt;&lt;li&gt;5% Contributory Pension scheme.&lt;/li&gt;&lt;li&gt;Family Life assurance of 3 times life cover salary.&lt;/li&gt;&lt;li&gt;Private healthcare scheme from day 1.&lt;/li&gt;&lt;li&gt;Enhanced maternity and paternity pay.&lt;/li&gt;&lt;li&gt;Cycle to work scheme.&lt;/li&gt;&lt;li&gt;We provide support and access to a range of internal and external courses to help and progress your career with us.&lt;/li&gt;&lt;li&gt;Employee recognition program.&lt;/li&gt;&lt;li&gt;Corporate discount scheme focussed on your wellbeing, including discounted Virgin Active Gym membership – and Gymflex.&lt;/li&gt;&lt;li&gt;Taste Card Membership discount.&lt;/li&gt;&lt;li&gt;Discount and cashback at many retailers.&lt;/li&gt;&lt;li&gt;Employee Assistance Program with 24/7 confidential helpline support for employees.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Into the Detail&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Business Reporting &amp;amp; Analytics Ownership:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Take full ownership of business reporting and analytics requirements across key functional areas.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Execute the agreed delivery plan for reporting and analytics, with an initial focus on reports required for the new ERP implementation.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;KPI Definition &amp;amp; ERP Alignment:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Ensure KPIs and performance measures are defined at a granular level, aligned with ERP implementation and evolving business needs.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Work with the BI Infrastructure team to ensure data models and reporting structures are sustainable, scalable, and aligned with group standards.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Stakeholder Engagement &amp;amp; Insight Development:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Collaborate with business users to identify key business questions and develop the reporting and analytics needed to answer them.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Become a Subject Matter Expert in functional areas to deliver actionable insights and drive continuous improvement.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Build strong relationships with functional leaders to gather ongoing feedback and anticipate future reporting needs.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Data Modelling &amp;amp; BI Standards:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Build analytical data models that support a flexible and scalable reporting approach.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Ensure all reporting is built on common group standards, consistent data, and a shared methodology.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Global Enablement &amp;amp; Collaboration:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Lead and enable data resources across the wider Safetykleen organisation.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Work with local market Data Analysts to promote a common approach to analytics while adapting Group views to meet local needs when necessary.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Data-Driven Culture Advocacy:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;em&gt;Act as a key member of the team championing the benefits of data and analytics.&lt;/em&gt;&lt;/li&gt;&lt;li&gt;&lt;em&gt;Play a central role in driving a truly data-driven culture across the organisation.&lt;/em&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We look forward to hearing you!&lt;/p&gt;&lt;p&gt;&lt;/p&gt;"
  },
  {
    "title": "Applied Data Scientist",
    "company": "Harnham",
    "location": "London Area, United Kingdom",
    "posted_time": "1 day ago",
    "posted_datetime": "2025-04-28",
    "logo_url": null,
    "job_url": "https://uk.linkedin.com/jobs/view/applied-data-scientist-at-harnham-4205806736?position=10&pageNum=10&refId=viKzp84kAKUEXuK8gPxoaw%3D%3D&trackingId=GkxQov94VdqeNbm2ZxiYSg%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Applied Data Scientist&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Up to £60,000 + Benefits&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;London (3 days per week)&lt;/strong&gt;&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Join a leading data analytics firm, with a strong reputation in the loyalty analytics space, working with top-tier clients on multiyear data science and data engineering projects. If you're passionate about data science in customer loyalty and looking for a role with direct impact, this is the place for you.&lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Work directly with clients, presenting your findings and insights to drive decision-making.&lt;/li&gt;&lt;li&gt;Collaborate on clustering, regression, and time-series forecasting projects to optimize product promotions.&lt;/li&gt;&lt;li&gt;Focus on building models to assess brand performance, helping clients understand which products to promote (premium vs non-premium).&lt;/li&gt;&lt;li&gt;Attend monthly meetings at Welling Garden City to coordinate with the team and discuss progress.&lt;/li&gt;&lt;li&gt;Use SQL and Python to analyse large datasets and deliver actionable insights to clients.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;What We’re Looking For&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Experience in client-facing roles, able to communicate data-driven insights and recommendations clearly.&lt;/li&gt;&lt;li&gt;Proficient in SQL and Python for data analysis and modelling.&lt;/li&gt;&lt;li&gt;Strong experience with clustering, time-series forecasting, and regression techniques.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Please register your interest by sending your CV to Emily Burgess via the Apply link on this page.&lt;/p&gt;"
  },
  {
    "title": "Head of People Programmes",
    "company": "Imperial College London",
    "location": "Greater London, England, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-23",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQGOM2ioD3Ym6w/company-logo_100_100/company-logo_100_100/0/1719955498213/imperial_college_london_logo?e=2147483647&v=beta&t=pZqbRXAf7l2ucC7JQSlOIRKqJMRnhnyKz0wK5zpmjSs",
    "job_url": "https://uk.linkedin.com/jobs/view/head-of-people-programmes-at-imperial-college-london-4215382117?position=7&pageNum=10&refId=viKzp84kAKUEXuK8gPxoaw%3D%3D&trackingId=3lcdfs1R2aw%2B3vbKffBCMw%3D%3D",
    "description": null
  },
  {
    "title": "FP&A Senior Partner",
    "company": "Distinct",
    "location": "Nottinghamshire, England, United Kingdom",
    "posted_time": "3 hours ago",
    "posted_datetime": "2025-04-29",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQEiUOnW6vGYTQ/company-logo_100_100/company-logo_100_100/0/1699435647256/distinct_recruitment_logo?e=2147483647&v=beta&t=yIR14IFa3xHTTT6SbMcbJm5H0trM0mk2WYVoMtjdEwg",
    "job_url": "https://uk.linkedin.com/jobs/view/fp-a-senior-partner-at-distinct-4210634032?position=3&pageNum=12&refId=vDlWlG%2Fo4yjexABWy8XPpA%3D%3D&trackingId=TTaRvEXcpbSxhwCCNDb%2BhQ%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Be the Architect of FP&amp;amp;A in a High-Growth Global Business – Private Equity Backed, IPO-Bound, and Scaling Fast&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;FP&amp;amp;A Lead | £75,000–£85,000 + 25% Bonus + Private Medical + Matched Pension + Benefits | Hybrid (Nottingham HQ)&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is more than just FP&amp;amp;A. It’s building the financial engine room of a global business on the cusp of something big.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Private equity investment has ignited a transformation—think major international expansion, M&amp;amp;A activity, and IPO prep already underway. Now, they’re looking for a commercially minded FP&amp;amp;A Lead to build out scalable, data-driven planning tools and bring sharper insights to the boardroom.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You’ll work directly with the senior leadership team, in a standalone role where your voice will be heard and your ideas put into action. It’s a blank slate opportunity to design better processes, smarter models, and forecasting that actually &lt;em&gt;helps&lt;/em&gt; people make decisions.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why this one stands out:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;You’ll take ownership of FP&amp;amp;A for a division that’s outperforming within the wider group&lt;/li&gt;&lt;li&gt;Backed by one of the most renowned PE houses in the world, with clear IPO ambition&lt;/li&gt;&lt;li&gt;Genuinely future-facing—AI, automation, and tech investment are central to their growth plans&lt;/li&gt;&lt;li&gt;A people-first culture, strong retention, and a senior team that backs and supports their finance function&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What they’re looking for:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Strong academics, ideally ACA qualified or MBA route, with the foundations to influence at exec level&lt;/li&gt;&lt;li&gt;Technically solid and genuinely passionate about automation, scalable systems, data structures, and AI-enhanced planning tools—comfortable using SQL, or similar to automate processes, analyse data, and drive better insights.&lt;/li&gt;&lt;li&gt;A commercially curious problem-solver who enjoys building structure and finding smarter ways of working&lt;/li&gt;&lt;li&gt;Not the finished article—just someone ambitious, switched-on, and ready to grow with the business&lt;/li&gt;&lt;li&gt;Confident communicator who can challenge, collaborate, and simplify complex ideas for senior stakeholders&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is one of those rare roles where you’re not stepping into someone else’s shoes—you’re making your own mark. If you’ve been operating as the 'number two' in a fast-paced business and want your own space to lead, this could be the one.&lt;/p&gt;"
  },
  {
    "title": "Account Executive",
    "company": "Propel",
    "location": "London Area, United Kingdom",
    "posted_time": "1 day ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/D4E0BAQHnRv7RGMr5zg/company-logo_100_100/company-logo_100_100/0/1738839830488/propel_together_logo?e=2147483647&v=beta&t=AuO00tqg2At50tqux8N4_Acc-8nELPhSzcYeDpNjrV0",
    "job_url": "https://uk.linkedin.com/jobs/view/account-executive-at-propel-4218731687?position=6&pageNum=12&refId=vDlWlG%2Fo4yjexABWy8XPpA%3D%3D&trackingId=ob%2BC0I%2Fyt0gdtu4TFOGW%2FQ%3D%3D",
    "description": "&lt;p&gt;🚀 &lt;strong&gt;Account Executive – B2B SaaS | Remote / UK Based&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We’re hiring a high-performing Account Executive to join a growing SaaS business focused on people engagement and employee benefits. This is a new business role selling into SMB and Corporate organisations across the UK.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You’ll be responsible for driving revenue by identifying, prospecting, and closing new business opportunities - selling a platform that helps HR teams improve employee experience, engagement, and benefits management.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What you’ll be doing:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Identifying and closing new opportunities within SMB and Corporate markets&lt;/li&gt;&lt;li&gt;Leading consultative, value-based sales processes from prospecting through to negotiation and close&lt;/li&gt;&lt;li&gt;Building strong relationships with HR leaders, C-Suite executives, and key decision-makers&lt;/li&gt;&lt;li&gt;Tailoring platform demos to client needs and helping them solve real employee engagement challenges&lt;/li&gt;&lt;li&gt;Working closely with marketing, product, and customer success teams to ensure seamless client experience&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What we’re looking for:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;3+ years of B2B SaaS sales experience (bonus points for experience selling into HR, Finance, or Benefits teams)&lt;/li&gt;&lt;li&gt;Proven ability to close deals valued at £20k+ ARR&lt;/li&gt;&lt;li&gt;Experience selling into organisations with complex buying processes&lt;/li&gt;&lt;li&gt;Strong consultative selling skills.&lt;/li&gt;&lt;li&gt;Confident communication, negotiation, and presentation abilities&lt;/li&gt;&lt;li&gt;CRM proficiency (e.g., Salesforce) and a tech-savvy mindset&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What’s on offer:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Competitive base salary + bonus + equity options&lt;/li&gt;&lt;li&gt;25 days holiday (rising to 30 days with service) + the option to swap bank holidays&lt;/li&gt;&lt;li&gt;Private Medical Insurance&lt;/li&gt;&lt;li&gt;Work-from-abroad scheme&lt;/li&gt;&lt;li&gt;Annual learning and development budget&lt;/li&gt;&lt;li&gt;Discounts at top retailers and gyms&lt;/li&gt;&lt;li&gt;Comprehensive mental health and coaching support&lt;/li&gt;&lt;li&gt;Life assurance and more&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you're a driven, strategic seller looking to make an impact in a growing business with a strong mission, we'd love to hear from you!&lt;/p&gt;"
  },
  {
    "title": "Finance Business Partner",
    "company": "The Consultancy Group (London)",
    "location": "London Area, United Kingdom",
    "posted_time": "23 hours ago",
    "posted_datetime": "2025-04-28",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQHBqHgZyrAhcQ/company-logo_100_100/company-logo_100_100/0/1645707356375/theconsultancygroup_logo?e=2147483647&v=beta&t=ov9pc7DZaJUoCg8jFrvY2Dt_nca-bX__mXYGL8qr2ts",
    "job_url": "https://uk.linkedin.com/jobs/view/finance-business-partner-at-the-consultancy-group-london-4217004061?position=10&pageNum=20&refId=VyD0WKnnB3ejasBqDrHP%2Bg%3D%3D&trackingId=HOLAnMlKJmLrvjJqQASR3Q%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Finance Business Partner&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;£85,000-£90,000 plus 20% bonus&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;London&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Tech&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The Consultancy Group are working with a Global PLC business and seeking a proactive and analytical Finance Business Partner to support the Group Functions and drive financial excellence across the organization. In this role, you’ll work closely with functional leaders and their teams, contributing directly to strategic decision-making and financial performance. You’ll oversee cost forecasting, budgeting, and manage the annual budget cycle to ensure alignment with business objectives. Additionally, you'll play a key role in refining cost projections, identifying financial variances, and implementing corrective actions to improve outcomes. If you're a detail-oriented finance professional eager to make a meaningful impact, we want to hear from you! This role is hybrid, requiring three days per week in the office.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Provide detailed financial analysis and insights to support strategic and operational decision-making across functions.&lt;/li&gt;&lt;li&gt;Manage financial data interpretation and reporting, delivering clear, standardized, and ad hoc reports as needed.&lt;/li&gt;&lt;li&gt;Continuously improve financial processes to optimize P&amp;amp;L performance, control costs, and manage risks and opportunities.&lt;/li&gt;&lt;li&gt;Develop robust business cases for investment decisions, ensuring accurate forecasting and relevant commercial insights.&lt;/li&gt;&lt;li&gt;Actively participate in leadership and strategy discussions, contributing to the direction and growth of the function.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About You:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Communication Skills:&lt;/strong&gt; You have strong verbal and written skills, enabling clear presentation of financial information to senior leaders.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Adaptability:&lt;/strong&gt; Thrive in a fast-paced environment and consistently deliver high-quality work within tight timelines.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Relationship Building:&lt;/strong&gt; Able to establish trust with stakeholders and become a credible partner to coach and influence business leaders.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Analytical and Strategic Mindset:&lt;/strong&gt; Highly detail-oriented with experience in commercial finance roles, ideally within a matrixed organization.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt; Strong financial modelling skills (advanced Excel proficiency) and a qualified accountant designation are preferred.&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Commercial Awareness:&lt;/strong&gt; Demonstrated ability to drive strategy and commercial outcomes through financial insights.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Comprehensive health, dental, and vision insurance.&lt;/li&gt;&lt;li&gt;\"Work Away\" scheme allowing up to 10 weeks per year working remotely.&lt;/li&gt;&lt;li&gt;Commitment to ongoing training and professional growth.&lt;/li&gt;&lt;li&gt;5 paid volunteer days annually&lt;/li&gt;&lt;/ul&gt;"
  },
  {
    "title": "Senior Consultant",
    "company": "Consulting Point",
    "location": "London Area, United Kingdom",
    "posted_time": "3 days ago",
    "posted_datetime": "2025-04-25",
    "logo_url": "https://media.licdn.com/dms/image/v2/C4D0BAQF11393h0UhQQ/company-logo_100_100/company-logo_100_100/0/1630467131526/consulting_point_logo?e=2147483647&v=beta&t=575Y4AsIxhA6P7v_OLDl5iHRbaKwut4nzz8v-2UAJNg",
    "job_url": "https://uk.linkedin.com/jobs/view/senior-consultant-at-consulting-point-4205804574?position=2&pageNum=22&refId=AjpmNQnbzK5dc4ErPHilpQ%3D%3D&trackingId=FgHCJhr9DFB3VPsSf1Md8Q%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Cybersecurity Advisory – Multiple Roles (Consultant to Manager Level)&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;Location: London or Hybrid | Clearance: SC Cleared or Eligible | Salary: Competitive + Benefits&lt;/em&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Our client, a global consulting leader with a growing presence in the cybersecurity and technology risk space, is actively expanding its UK team. As part of a strategic growth initiative, they are hiring across multiple levels – from Consultant to Manager – to support an ambitious pipeline of work across both public and private sectors.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is an excellent opportunity for professionals with a passion for security and innovation to join a collaborative environment at the forefront of emerging technologies such as Generative AI, OT security, and secure enterprise transformation. You’ll work on high-impact engagements, advising clients on how to mitigate risk and build resilience through secure design, governance, and implementation.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Key Focus Areas&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;Generative AI &amp;amp; Innovation Risk&lt;/strong&gt;: Guide clients on secure adoption of AI tools in line with evolving regulatory frameworks (e.g., EU AI Act, GDPR).&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Security Architecture&lt;/strong&gt;: Deliver secure enterprise and application architecture aligned with best practice standards (e.g., NIST, ISO27001, CIS).&lt;/li&gt;&lt;li&gt;&lt;strong&gt;Operational Technology Security&lt;/strong&gt;: Protect critical infrastructure through robust OT security assessments and frameworks (e.g., NIST SP 800-82, CAF).&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What We’re Looking For&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Proven experience in cybersecurity, technology risk, or security architecture consulting.&lt;/li&gt;&lt;li&gt;Expertise in one or more focus areas listed above.&lt;/li&gt;&lt;li&gt;Strong stakeholder engagement and communication skills.&lt;/li&gt;&lt;li&gt;Commercial acumen and experience contributing to client delivery or business development.&lt;/li&gt;&lt;li&gt;Any of the following certifications would be desirable: CompTIA+ Security, CISSP, CISM, CISA, CCSP, ISO 4201&lt;/li&gt;&lt;li&gt;Current or eligible for SC Clearance is essential.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why Apply?&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Join a fast-growing team with clear opportunities for career progression.&lt;/li&gt;&lt;li&gt;Work on transformative projects that sit at the intersection of security and innovation.&lt;/li&gt;&lt;li&gt;Gain exposure to a dynamic mix of public and private sector engagements.&lt;/li&gt;&lt;li&gt;Be part of a firm that invests in people, learning, and thought leadership.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you're ready to take the next step in your consulting career and help shape the secure future of digital business, we’d welcome a confidential conversation.&lt;/p&gt;"
  },
  {
    "title": "Finance Business Partner",
    "company": "Investigo",
    "location": "London Area, United Kingdom",
    "posted_time": "6 days ago",
    "posted_datetime": "2025-04-22",
    "logo_url": null,
    "job_url": "https://uk.linkedin.com/jobs/view/finance-business-partner-at-investigo-4214623655?position=5&pageNum=22&refId=AjpmNQnbzK5dc4ErPHilpQ%3D%3D&trackingId=q7OdGqIwOcyMeOrOwE657A%3D%3D",
    "description": "&lt;p&gt;&lt;strong&gt;Finance Business Partner | Central London | £75-95k plus bonus&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Exciting opportunity for a high caliber individual looking for a Finance Business Partner role in a leading media organisation with a supportive culture and opportunity for progression.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This is a fantastic role for someone who is looking to develop their career in commercial finance. This role is responsible for business partnering with senior leaders, playing an active role in adding value and growing the business, budgeting, forecasting and maximising performance across the business.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This would be the perfect next step for a qualified accountant, who is audit trained followed by 2+ years in a commercial/ business partnering role in a comparable media organisation who is looking to take on more responsibility.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You must have worked within a leading technology, media or telecoms business and have an impressive career trajectory.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;The Role&lt;/em&gt;&lt;/p&gt;&lt;p&gt;Reporting into the Head of Commercial Finance, this role is responsible for providing strategic finance business partnering to the commercial teams.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Business partnering in a pro-active, commercially astute manner&lt;/li&gt;&lt;li&gt;Analyse &amp;amp; report on trading performance vs comparatives&lt;/li&gt;&lt;li&gt;Explore and analyse data, extracting valuable insights to drive performance, support decision making, and uncover opportunities&lt;/li&gt;&lt;li&gt;Financial planning including budgeting, forecasting and long term planning, including business cases for new initiatives&lt;/li&gt;&lt;li&gt;Scenario planning to guide decision-makers&lt;/li&gt;&lt;li&gt;Deliver strategic cost management; understand and optimise cost drivers and review, challenge and prioritise investment cases&lt;/li&gt;&lt;li&gt;Work with the SLT to optimise spend to ensure ROI performance is maximised&lt;/li&gt;&lt;li&gt;Preparation of reports and analyses for various board and management presentations&lt;/li&gt;&lt;li&gt;Ad-hoc analysis to spot opportunities or reduce areas of risk&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You will regularly interact with senior management, meaning that stakeholder management skills and an affable personality are a must. This role requires a strong performer and somebody with the ambition and intellect to apply their own insights were possible and suggest improvements to existing processes.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;Your Background&lt;/em&gt;&lt;/p&gt;&lt;p&gt;You are a qualified accountant with at least 3-5 years post qualified experience. Ideally, you are making your first move out of audit or have hands on experience at a comparable business.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;Location&lt;/em&gt;&lt;/p&gt;&lt;p&gt;Central London with hybrid working from home.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Please note, unfortunately our client does not offer visa sponsorship.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;If this role is of interest, please apply via this link or contact me at georgia.matthews@investigo.co.uk&lt;/strong&gt;&lt;/p&gt;"
  }
]