[
    {
        "title": "EA to CEO, Private Equity",
        "company": "ISE Partners",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/ea-to-ceo-private-equity-at-ise-partners-4192219469?position=1&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=QyEqoymvGf8XEIQiB3VzRQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:05",
        "description": "A highly experienced Private/Business EA is required to support an UHNW founder, for this global Private Equity fund, in an all encompassing EA role managing business and personal elements of their life. Working a part of a senior team, you will be responsible lifestyle management, projects and business scheduling.\nThis is a role requiring 24/7 availability, 5 days in office and a dedicated, proactive approach.\n\nWith no two days the same and huge variety, you will be someone who thrives on the challenge of responding to the requirements of a hugely demanding international office and personal life. You will enjoy operating in a demanding private PA role, embracing a challenge and take pride in delivering results, while also being able to fulfil the more structured corporate tasks in the business capacity. Working as part of a team within the CEO's office is also essential. Communication skills and problem solving are essential skills.\n\nYou should also be available 24/7 evenings and weekends, to support in a full capacity.\n\nExperience required: please review before applying:\nSalary circa £90-100K+\nExperience of supporting an UHNW individual as a Private PA is essential, with additional CEO level experience with an international remit, is essential. Applications made without this experience will not be considered.\nStrong academics\nExcellent communication skills; able to naturally function with VIP, UHNWIs and their liaison points and the ability to work well in a team.\nYou should have a calm demeanour, be extremely well organised, intuitive, proactive and bring a positive, upbeat personality.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Venture Capital and Private Equity Principals"
    },
    {
        "title": "Executive Assistant",
        "company": "Eden Recruitment Ltd",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=2&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=3Ngsb3%2Fu5KzZMWnVqvXfzA%3D%3D",
        "scraped_at": "2025-04-15 19:07:06",
        "description": "Executive Assistant - Global Financial Services\n\nJoin a globally respected financial services firm known not just for its high performance, but for its incredible culture and show-stopping offices. We’re on the lookout for a Executive Assistant to support a high-calibre team, including Senior Managing Directors and VPs—people at the top of their game.\n\nThis is more than just a traditional EA role. You’ll be a key player, helping to keep the gears moving smoothly in a fast-paced, high-stakes environment, where your expertise is respected and your contributions truly matter.\n\nWhat You’ll Be Doing:\nSeamlessly support a dynamic team of senior leaders.\nManage highly complex calendars and juggle competing priorities.\nOrganise detailed global travel itineraries with precision.\nAct as a trusted point of contact internally and externally.\nHelp nurture an inclusive, energising team culture.\n\nWhat We're Looking For:\nSolid experience as an Executive Assistant—financial services experience is highly desired.\nHigh level ability to manage schedules and travel across time zones.\nA curious, solution-focused mindset—you’re always one step ahead.\nNext-level organisation and multitasking skills.\nStrong emotional intelligence and top-tier communication skills.\n\nWhy You’ll Love It Here:\nA collaborative, respectful, and people-first culture—you’ll feel valued from day one.\nCareer growth and learning opportunities that will keep you challenged and inspired.\nHybrid flexibility (3 days in-office, 2 remote).\nA competitive salary + benefits package that recognises your worth.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Financial Services, Investment Banking, and Venture Capital and Private Equity Principals"
    },
    {
        "title": "Commercial Finance Analyst",
        "company": "Freshminds",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=3&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Qa%2FeP%2FotCHA6E0N024nIRg%3D%3D",
        "scraped_at": "2025-04-15 19:07:08",
        "description": "Freshminds has partnered with a leading entertainment brand looking to hire an Investment and Property Business Partner to drive key strategic initiatives within its investment & property people and technology functions.\n\nWorking closely with senior management and reporting to the Director of Commercial Finance, you’ll provide data-driven insights to enhance decision-making, assess capital investments, and track the performance of new sites, technology, and workforce initiatives.\n\nWhat you’ll be doing:\nManaging investment cases for property, new sites, and technology.\nDeveloping reports and analysis to support investment and capital planning.\nIdentifying trends, risks, and opportunities using advanced analytics.\n\nRequirements:\nStrong data and analytical skills (SQL, Advanced Excel, Power BI with Python/Amazon RDS desirable).\nExperience in investment, property, or multi-site businesses.\nProven consulting skill-set.\nAbility to translate complex challenges into actionable insights.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting, Finance, and Strategy/Planning",
        "industries": "Entertainment Providers"
    },
    {
        "title": "Business Analyst",
        "company": "Cornwallis Elt",
        "location": "Northampton, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-cornwallis-elt-4209817973?position=4&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Y6a%2FtywPlvddFRGoHg%2Fclg%3D%3D",
        "scraped_at": "2025-04-15 19:07:10",
        "description": "Business Analyst – TOM, Business Readiness, Operations, Process, Compliance, Regulatory - Northampton – £65,000 - £75,000 base + Bonus & Benefits\n\nMy client, a leading Financial Services organisation based in Northampton, are currently looking for a Business Analysts to join their new programme on a permanent basis.\n\nYou will be working directly with the Head Of to define the TOM across a new operations team being set up, in response to a Compliance mandate that will work across multiple business units in the bank. Further to this you will be running the analysis and providing the vision on the team set up, and how it will support the technology changes to follow, and defining the target operating model as this programme moves into BAU.\nThe ideal candidate will have a strong process delivery background with experience setting up new operations teams / functions with an appreciation for how technology is impacted and delivered.\n\nIf you have experience in any of the below, please apply:\nProven experience as a Business Analyst (preferably large scale Organisation or Financial Services)\nProven Target Operating Model (TOM) delivery\nA good background in business readiness / operations would be helpful\nSolid core business analysis skills, working from inception through to delivery\nExcellent stakeholder management\nExperience delivering to tight regulatory deadlines\n\nThis is an excellent opportunity for someone to join a new programme of work, that will cut across multiple business units within the bank.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst and Information Technology",
        "industries": "Financial Services and Banking"
    },
    {
        "title": "Data Analyst",
        "company": "Explore Group",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=5&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=x67Dhx93tqCzcSbhtR%2B8OQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:11",
        "description": "Data Analyst\n***MUST HAVE MARITIME EXPERIENCE***\n\nWe're looking for a skilled Data Analyst to turn complex data into clear insights that drive business performance. If you're passionate about data storytelling, automation, and impact, this is the role for you.\n\nResponsibilities:\nExtract, validate, and analyze large data sets for trends and insights\nBuild dashboards and reports (Power BI, Excel) to support decision-making\nCollaborate with stakeholders to define data requirements\nAudit data quality and ensure integrity across sources\nAutomate recurring reports and improve analytics workflows\n\nWhat we’re looking for:\n6+ years of experience in data analytics\nAdvanced Excel (VBA, Macros), Power BI, SQL, PowerPoint\nStrong statistical and analytical mindset\nBachelor’s/Master’s in Mathematics, Statistics, or related field\nBonus: Experience with automation tools and data audit processes\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Maritime Transportation"
    },
    {
        "title": "Account Executive - Airlines",
        "company": "Ultimate Asset",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/account-executive-airlines-at-ultimate-asset-4193501685?position=6&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=dBsSMJ1f6MSreTwNrSxJyA%3D%3D",
        "scraped_at": "2025-04-15 19:07:13",
        "description": "ACCOUNT EXECUTIVE (NEW BUSINESS) - SAAS GEOPOLITICAL RISK REALTIME & PREDICTION AI TECH\n\n\nUp to £60k base X2 OTE (maybe flex for the right candidate)\nRole can be remote/hybrid/office based\n\n*You must have recent experience selling SaaS into airlines\n\nThis company sell a risk solution used for global aviation.\n\nIt predicts in real time (and also predicts) security risks - its an absolute need to have SaaS products.\n\n\nExciting Bits\n\nIts a need to have product with a near perfect renewal rate\nMarket leaders in what they do\nIts tech that saves lifes as well saving companies a lot of money\nGreat enterprise companies onboard already including Virgin, Emirates and NATO\n\n\nRole\n\nSelling into new and upselling existing clients (its a mostly new business role)\nFocus on owning and selling into the mid market aviation space\nSelling 15k to six figure ARR deals\n\n\nRequirements\n\nYou must have at least 1 years SaaS closing experience\nYou also need recent experience selling SaaS into aviation companies\nExperience closing your own SaaS deals against a personal quota (at least 300k P/A plus)\nRecently hitting revenue targets\nHappy to occasionally come into the office\n\n\n\nGet in touch at Swaran@ultimateasset.com to find out more\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development and Sales",
        "industries": "Airlines and Aviation and Insurance"
    },
    {
        "title": "Senior Brand Designer",
        "company": "OWL",
        "location": "Shoreditch, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-brand-designer-at-owl-4208896949?position=7&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=MuUyrTORBZk8bCUwZY6dew%3D%3D",
        "scraped_at": "2025-04-15 19:07:14",
        "description": "At OWL, we connect exceptional talent with brands and agencies that want to make meaningful creative impact. On behalf of a bold and forward-thinking client, we’re looking for a Senior Brand Designer who doesn’t just think outside the box—but redefines what the box even is.\nThis role is about more than delivering beautiful work. It’s about reshaping how audiences experience brands—through immersive, boundary-pushing design that inspires, connects, and resonates.\n\nThe Opportunity\n\nAs Senior Designer, you’ll lead the charge on transformative creative, working closely with multidisciplinary teams to bring big, brave ideas to life. From concept to execution, across print, motion, 3D and beyond, you’ll craft experiences that go deeper than visuals—telling stories that move people.\n\nWhat You'll Be Doing\n\nCollaborating with writers, strategists, and account teams to build bold, integrated ideas that answer real human needs.\nCreating across media—from traditional formats to motion and experiential—with a focus on multidimensional storytelling.\nTurning ideas into reality with a deep understanding of craft, production, and detail.\nCommissioning and collaborating with illustrators, photographers, filmmakers and other creative partners.\nContributing to and creating storyboards, animations, and filmic assets.\nMentoring junior designers and nurturing future talent.\nPresenting your vision with confidence—internally and client-side—with clarity, passion, and purpose.\nWorking closely with project teams to ensure deadlines and deliverables are met without compromising creativity.\nHolding every piece of work to the highest standards of design excellence and strategic intent.\n\nWho You Are\n\nA creative leader with a sharp eye, strong ideas, and an even stronger drive to push them further.\nA storyteller who knows that powerful design starts with empathy, insight, and clear purpose.\nA perfectionist (in the best way) with meticulous attention to detail and craft.\nA natural collaborator and self-starter who thrives in fast-paced, ideas-first environments.\nSomeone who’s culturally curious and constantly feeding your creative mind with fresh perspectives.\n\nWhat’s in it for You\n\nA platform to stretch your creative wings—across film, experiential, retail, and other evolving disciplines.\nA stream of diverse, exciting projects that challenge conventions and keep things fresh.\nA values-led culture: inclusive, open, collaborative, and genuinely fun.\nThe chance to mentor rising talent, shape creative thinking, and leave a lasting mark—both inside the studio and out in the world.\n\nThe Culture You'll Be Joining\n\nThis is a team that leads with authenticity, depth, and purpose. Their values?\nRealness: Clear, actionable ideas grounded in truth—never fluff.\nRigour: A relentless pursuit of excellence and originality.\nEmpathy: Listening first, collaborating with heart, and designing with people in mind.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Design, Art/Creative, and Information Technology",
        "industries": "Staffing and Recruiting"
    },
    {
        "title": "Full Stack Engineer",
        "company": "Thyme",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/full-stack-engineer-at-thyme-4141111172?position=8&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=YZHDhc42p9JbDXvEhVwz7A%3D%3D",
        "scraped_at": "2025-04-15 19:07:16",
        "description": "🏢: Full Stack Engineer (backend leaning).\n📍Remote First (UK) with an office in Central London.\n💰: £45,000 - £75,000\n\nThis is a unique opportunity to join a growing company aiming to revolutionise the way we do our finances. With a lean, agile team of 10 Full Stack Engineers, you’ll be working in an exciting environment, directly contributing to the company’s success.\n\nAbout the Role.\nWe’re looking for a Full Stack Engineer to help design, develop, and scale our FinTech platform. This role leans heavily towards backend development, where you'll be responsible for building and optimising the core services and APIs that drive our system. You’ll work on ensuring high performance, scalability, and seamless integration across our microservices architecture.\n\nWhat You’ll Do:\n🔹Build and enhance backend services and APIs using Node.js and TypeScript.\n🔹Design and maintain a microservices architecture that ensures resilience and scalability.\n🔹Utilise AWS and serverless technologies to streamline infrastructure and deployment processes.\n🔹Write high-quality, maintainable code following best practices for security and performance.\n\nTech Stack:\n🔹Backend: Node.js, TypeScript\n🔹Frontend: React.js\n🔹Infrastructure: AWS Lambda, Serverless Computing\n🔹Architecture: Microservices\n\nWhat We’re Looking For? 👀\n🔹Hands-on experience as a Full Stack Engineer or in a similar role.\n🔹Strong proficiency in Node.js, React.js, and TypeScript.\n🔹Knowledge of cloud platforms (AWS) and serverless technologies.\n🔹Experience with microservices architecture and building scalable systems.\n\nWhy Join Us? ↘️\n🔹Work with a modern tech stack and help reshape financial processes.\n🔹Gain hands-on experience in an innovative environment.\n🔹Grow professionally with opportunities for learning and development.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Engineering",
        "industries": "Financial Services and Accounting"
    },
    {
        "title": "Chief Operating Officer",
        "company": "1st Formations",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/chief-operating-officer-at-1st-formations-4210665752?position=9&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=hBeKF2Si65MSQ4uukszTZw%3D%3D",
        "scraped_at": "2025-04-15 19:07:17",
        "description": "Who we are\n\nLeading e-commerce Corporate Services Group\nServices include: Company Formation, Address Services, Call Answering and Managed Live Chat, Company Secretarial, Law Practice, Serviced Offices\nCustomer base - 500,000\nCovent Garden-based\nFounder/owner CEO\nProfitable and growing at 20% per annum\n\n\n🚀 Ready to Be the Operational Powerhouse Behind the UK’s Next E-Commerce Giant?\n\nDo you thrive in high-growth environments? Are you obsessed with performance, scalability, and operational excellence? Do you have the leadership experience to drive performance from our Operations Team and customer-facing teams in a fast-paced environment?\nIf you're not just experienced—but exceptional—at managing scaling e-commerce operations, this might be the biggest leadership opportunity of your career.\n\n\n👊 Who Are We?\n\nWe’re a fast-growing e-commerce Group with a portfolio of category-defining brands. We’ve built something special—and we’re setting up to scale fast. We’re on the hunt for a strategic and hands-on execution-focused COO to help us lead from the front, build robust systems, and drive sustainable growth.\n\n\n🎯 What You’ll Be Doing:\n\nAs COO, you’ll be the driving force behind our day-to-day operations, aligning our teams, systems, and strategy to deliver best-in-class performance. This isn’t about maintaining the status quo—it’s about building what’s next.\n\nDevelop and execute scalable operational strategies across all brands and functions\nPartner with the leadership team to shape long-term vision and business goals\nOptimise Compliance, order fulfilment and customer service to improve efficiency and retention\nDrive cross-departmental alignment, setting KPIs and tracking success across key business units\nBuild a world-class team culture rooted in performance, accountability, and speed\nIdentify new tools, partners, and platforms to improve margins and scalability\n\n\n💥 What’s In It for You?\n\nA pivotal leadership role in one of the UK’s most exciting e-commerce ventures\nReal authority, real ownership, with the ability to lead teams of people\nDirect impact on the trajectory of multiple fast-scaling brands\nA high-performance team that moves fast and builds bold\n\n\n🔥 We Want to Hear from You If You Are:\n\nA proven senior operations professional with experience of both granular and strategic operations.\nExperienced leading and scaling teams in high-growth customer-facing environments\nData-obsessed, process-oriented, and laser-focused on results\nComfortable owning customer ops, compliance and commercial outcomes\nA strong leader who inspires trust, sets a high bar, and delivers\nA strategic thinker who is also happy to get into the weeds and get things done\n\nSalary: £120,000 to £140,000\nWorking hours: 37.5 hours per week, 09:00 to 17:30, Monday to Friday\nLocation: Office-based, Covent Garden\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Management",
        "industries": "Legal Services and Accounting"
    },
    {
        "title": "Global Procurement Manager",
        "company": "Sea Global",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/global-procurement-manager-at-sea-global-4207344988?position=10&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=tru4gNusyikvv2NW4uSKfQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:19",
        "description": "Title: Global Procurement Manager\nSector: FMCG / Manufacturing\nLocation: Remote with occasional travel to UK & Europe offices and sites\n\nSalary & Package: £75,000 - £80,000 + an additional strong benefits package\n\nSea Global are delighted to be partnering with a globally renowned leader in the FMCG sector, who are currently looking to appoint 2x Global Procurement Managers to join their team. They are a FTSE 100 consumer goods company who are transforming their procurement function and have ambitious plans for the future.\n\nGlobal Procurement Manager - Facilities Management\nGlobal Procurement Manager - Marketing\n\nThey are looking for Procurement professionals with expertise across Facilities Management e.g. Hard (Engineering, Maintenance) and Soft (Security, Cleaning, Catering)\n\nFor the other role they are looking for Procurement professionals with expertise in the Marketing category e.g. Creative Agencies, Advertising, Trade Marketing, Point of Sale (POS), Brand, Digital, Media, PR, Market Research.\n\nThe role reports directly into the Global Head of Indirect Procurement and sits within the wider procurement function where you will be responsible for managing the relevant category. They are ideally looking for someone with FMCG or similar industry experience who can hit the ground running from day one.\n\nThey are looking for someone to come in on a 12-month FTC with the option to go permanent. Please see below and reach out for more information!\n\nRole & Responsibilities\nDevelop and implement strategic sourcing strategies across the relevant category.\nResponsible for leading end-to-end procurement including Tenders, Negotiation, Supplier Relationship Management, Contract Management, and Spend Data Analysis.\nBuild relationships with local and international suppliers, negotiating and ensuring deals align with business activities.\nOversee the relevant category spend, strategic sourcing, and supplier negotiations.\n\nExperience & Requirements\nStrong understanding of procurement, category management, or strategic sourcing.\nComfortable working in a fast paced market, demonstrating excellent supplier and stakeholder management skills.\nDemonstrated ability to lead the Facilities Management or Marketing category.\nIdeally degree and/or MCIPS qualified\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Purchasing",
        "industries": "Manufacturing and Consumer Services"
    },
    {
        "title": "Project Manager",
        "company": "Cornwallis Elt",
        "location": "Northampton, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-cornwallis-elt-4209830853?position=11&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=EIQG9GfYwXd5GUpblIwICw%3D%3D",
        "scraped_at": "2025-04-15 19:07:21",
        "description": "Project Manager – Digital, Software, Payments, Regulatory, Agile, Change Management, Technology, Strategy, Stakeholder Management, Financial Services - Northampton - Permanent - £50,000- £65,000 Base + Bonus + Benefits\n\nMy client, a leading Financial Services organisation have a key permanent requirement for a number of Project Managers to join a critical regulatory programme of work in their Northampton based office.\n\nThe ideal candidate will have a solid technical background / understanding coupled with strong, broad end to end Project Management experience. This role will be supporting a number of high profile technical programme of change in the Digital and Payments space, as well as a time critical FCA regulated programme with a specific focus on the delivery of various improvements within their existing digital and payments platform.\n\nYou will need strong Project Management delivery experience in both agile and waterfall environments and will need to be comfortable facing off to senior stakeholders across the organisation. These are key projects of work that need mobilising, in which you will be in charge of complex teams and £multi-million project budgets as well as managing change within delivery, planning, risks and issues, ensuring delivery in line with the business’s requirements. My client are keen on speaking with individuals who have end to end project experience with a delivery focused mindset, who can anticipate change in a large organisation.\n\n\nThe be successful in this role you will need;\nProven Project Manager, preferably within a large-scale organisation / Financial Services\nRegulatory experience would be highly beneficial\nExcellent stakeholder management\nProven experience managing multiple project work streams\nStrong experience managing and implementing change projects\nRegulatory project experience would be highly beneficial\nAgile and waterfall methodology exposure\nStrong experience of writing and translating both business and functional specifications\nExtensive stakeholder management skills\n\nThis is an excellent opportunity for someone to join an expanding and exciting team in what is a highly visible area at the moment, with multiple on-going projects.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management and Information Technology",
        "industries": "Financial Services and Banking"
    },
    {
        "title": "Project Manager",
        "company": "Tarka Talent",
        "location": "England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-tarka-talent-4207351282?position=12&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=NtccNKjCO%2FC4MSSwBfQBgg%3D%3D",
        "scraped_at": "2025-04-15 19:07:22",
        "description": "Project Manager\n£60,000 - 75,000\nHybrid, flexible working\n\nWe are partnered with a high-growth SaaS organisation in the Energy sector who are growing their in-house consulting/project delivery team.\n\nThe Project Manager will be responsible for managing the end-to-end delivery of your assigned project from start-up, through to execution and close-down, to the required standard of quality and within specified constraints of time and costs.\n\nResponsibilities include:\nFull project lifecycle ownership, from inception to deployment and handover to BAU support\nClient leadership through the project, providing expert guidance, advice and negotiation where required\nCost estimating and budget management\nConstruction of detailed work plans coupled with activity and resource planning\nCommunication of progress across all key internal and external stakeholders\nWorking with wider teams to deliver projects creatively and analytically in a problem-solving environment\n\nWhat we are looking for:\nKnowledge of the Energy sector\nExperience in managing and coordinating complex projects from inception to completion – delivering to time, quality and budget\nExperience of delivering Agile SaaS projects\nExperience of delivering tech-lead transformation projects is essential\nEntrepreneurial mind-set and a good problem-solver, with a structured approach to formulate the best outcome\nHappy being hands-on, working in an environment with changing priorities and deadlines\nCommercially-minded\n\nLogistics:\nAt least 3 days working from home a week\nA few days a month in Windsor\nA few days a month in Nottingham\n\nBenefits include pay reviews annually linked to performance, discretionary bonus, private healthcare, and gym membership.\n\n------\n\nRegretfully, due to a high volume of applicants, we are only able to reply to those who are successful.\n\nEqual Opportunities:\n\nWe are committed to promoting equality of opportunity for all employees and job applicants. In line with the Equality Act 2010, we strive to create and maintain a working environment in which everyone is able to make the best use of their skills, free from discrimination or harassment, and in which all decisions are based on merit. No person is subjected to any less favourable treatment on any discriminatory grounds on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy and maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting",
        "industries": "Business Consulting and Services, Utilities, and Services for Renewable Energy"
    },
    {
        "title": "Information Technology Auditor",
        "company": "Lutine Bell",
        "location": "Edinburgh, Scotland, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/information-technology-auditor-at-lutine-bell-4183931288?position=13&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=M4lCGULfWat5VkFkRi3%2BWQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:24",
        "description": "Location: Edinburgh\nHybrid: 4 days per week in the office\n\nLutine Bell are supporting a leading global financial service organisation to appoint an IT Auditor into their Edinburgh office.\n\nKey Responsibilities:\nDeliver core testing controls and fieldwork with technical proficiency.\nCommunicate effectively with stakeholders and team members.\nWork on documentation and IT audit tasks.\nUnderstand risk and controls, and lead walkthroughs.\nCollaborate cross-functionally with Internal Audit (IA) teams.\n\nWhy Join Us:\nFlexible and collaborative team environment.\nOpportunity for rapid growth and career advancement.\nExposure to various areas including data, AI, infrastructure, and cybersecurity.\nAbility to carve your own path and explore new areas of the business.\nSupportive leadership that encourages innovation and exploration.\n\nRequirements:\nStrong understanding of application development, databases, operating systems, networking and other key technology infrastructure components.\nAt least 3 years in a technology audit and/or technology risk management function\nUndergraduate or graduate degree in management information systems, engineering, technology, computer science or a related field is preferred.\nRight to Work in the UK (no sponsorship available)\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology and Accounting/Auditing",
        "industries": "Financial Services"
    },
    {
        "title": "Project Manager",
        "company": "urban",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-urban-4208075921?position=14&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=1eKETMxGwAYM%2BsDdDs4Qbw%3D%3D",
        "scraped_at": "2025-04-15 19:07:25",
        "description": "Senior Architect\nLocation: Central London (Hybrid working)\nSalary: £60,000 - £65,000 per annum\n*Permanent*\n\nThe Role\nA prestigious multi-disciplinary design studio in Central London is seeking a Senior Project Manager to join their growing team. Known for delivering exceptional high-end residential and luxury hospitality projects across the UK and internationally, the studio offers a full turnkey service from architecture and interior design through to project management.\nYou’ll play a key role in managing complex, design-led projects from pre-construction through to handover - working closely with internal teams, consultants, contractors, and clients to ensure seamless delivery. Reporting to the Head of Project Management, this role is ideal for someone with a background in architecture or a construction-related field and a passion for premium design.\n\nRequirements\n5+ years of project management experience in the UK\nTrack record of delivering high-end residential, commercial, or hospitality projects\nFamiliarity with projects ranging from £1m to £15m in value\nUnderstanding of bespoke detailing and luxury finishes\nExperience managing design coordination, procurement, contracts, and construction processes\nExcellent communication and leadership skills in client-facing environments\nProficiency in Smartsheet, Excel and Microsoft Project; AutoCAD familiarity is a plus\nStrong understanding of UK building regulations, construction methods, and planning policy\nOrganised, proactive, and detail-oriented with a collaborative mindset\n\nBenefits\nWork on prestigious design-led projects across the UK and internationally\nCollaborative, supportive studio culture with scope for progression\nHybrid working arrangements\nPet friendly office\nCompetitive salary\n\nInterested in learning more or ready to apply? Email your CV to fran@bemoreurban.com\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management",
        "industries": "Construction, IT Services and IT Consulting, and Building Construction"
    },
    {
        "title": "Account Executive",
        "company": "Ultimate Asset",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/account-executive-at-ultimate-asset-4189725471?position=15&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=HM4F3G4SLTZNddw%2BT5YbBw%3D%3D",
        "scraped_at": "2025-04-15 19:07:27",
        "description": "ACCOUNT EXECUTIVE (NEW BUSINESS) - SAAS GEOPOLITICAL RISK REALTIME & PREDICTION AI TECH\n\n\nUp to £60k base X2 OTE (maybe flex for the right candidate)\nRole can be remote/hybrid/office based\n\n*You must have recent experience selling SaaS into aviation\n\nThis company sell a risk solution used for global aviation.\n\nIt predicts in real time (and also predicts) security risks - its an absolute need to have SaaS products.\n\n\nExciting Bits\n\nIts a need to have product with a near perfect renewal rate\nMarket leaders in what they do\nIts tech that saves lifes as well saving companies a lot of money\nGreat enterprise companies onboard already including Virgin, Emirates and NATO\n\n\nRole\n\nSelling into new and upselling existing clients (its a mostly new business role)\nFocus on owning and selling into the mid market aviation space\nSelling 15k to six figure ARR deals\n\n\nRequirements\n\nYou must have at least 1 years SaaS closing experience\nYou also need recent experience selling SaaS into aviation companies\nExperience closing your own SaaS deals against a personal quota (at least 300k P/A plus)\nRecently hitting revenue targets\nHappy to occasionally come into the office\n\n\n\nGet in touch at Swaran@ultimateasset.com to find out more\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development and Sales",
        "industries": "Airlines and Aviation and Insurance"
    },
    {
        "title": "Senior National Account Manager",
        "company": "Artisan People Group",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-national-account-manager-at-artisan-people-group-4189299341?position=16&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=b4XIUbOOJR9Y%2Bpky%2FYWnXQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:29",
        "description": "A masstige beauty brand is looking for an experienced Senior National Account Manager to be based in London. This is a 12 month maternity cover role starting at the end of May.\n\nAs Senior National Account Manager, you are responsible for contributing towards the development of one of the client’s three key pillar brand strategies focusing on a leading retailer, Boots UK. You will act as the key contact for all negotiation, commercial discussion and strategy with the retailer.\n\nAn overview of your key responsibilities:\nTo autonomously drive the UK growth of the brand within the leading retailer\nBuild upon the brand’s rapid growth in the retailer, maintaining sustainable profitability model\nManagement of gross margin, COGS blend, investment and local market strategies balancing the overall P&L for your account\nTo budget, forecast and manage the line level and account level requirement\nInfluence both brand retailer initiatives, to creatively deliver a growth strategy, building upon collaborative relationships, both new and established\nBe the eyes and ears of the brand within the retailer, listening to feedback, reporting the strategies of the retailers back to the brand\nBuild credible and collaborative relationships with all levels of the retail partner\nBe the driver of cross functional relationships internally and ensuring the strategic needs of the retailer business and its growth plan are met by the business\nWorking closely with Finance to ensure business accounting is accurate\n\nOur ideal candidate has experience working at Boots UK, such as a current Boots employee looking for a promotion, a category manager, an assistant buyer or a candidate who has relationships at Boots.\n\nYou should be proficient in Microsoft Office and possess a relevant degree or equivalent. You possess advanced numerical and literacy skills, enabling you to translate data into actionable insights that drive positive change. Your excellent communication abilities ensure clear and compelling presentations. Extensive beauty industry knowledge is further complemented by your keen market awareness and consumer trend interpretation skills.\n\nYour track record of progression and a mix of experience in both large and small companies, particularly within skincare, demonstrates a commitment to growth. Finally, your excellent communication skills, collaborative spirit, strong work ethic, and entrepreneurial drive position you for success.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Sales and Business Development",
        "industries": "Retail Luxury Goods and Jewelry and Retail"
    },
    {
        "title": "Head of Procurement",
        "company": "The TalentPool Company",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/head-of-procurement-at-the-talentpool-company-4209699382?position=17&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=T3O3AKuwSi3cUa9T%2FTXzYQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:31",
        "description": "About the Company - One of the fastest growing food (QSR) brands in the UK. The business continues to grow within the UK and wider regions. It's at a crucial phase to find the right people to put the necessary processes and procedures in place to achieve their plans.\n\nAbout the Role - The role is reporting into the Chief Procurement Officer, responsible for the UK & I team.\n\nResponsibilities:\n\nProvide high quality analysis and market intelligence of Procurement activities to inform strategic direction\nSourcing and risk identification in every area of the process\nTender, negotiate and coordinate the execution of framework contracts with suppliers\nEnsure project management of all sourcing activities and strategic food and non-food products\nWork with other departments to install and embed new product and existing product development processes and procedures\n\n\nAbout you:\n\nFood Procurement (ideally Restaurant/QSR/Casual Dining)\nLed and managed procurement teams (small teams count)\nEnd to end procurement\nSupported and led complex tenders for large global businesses\nStakeholder management\n\nPackage:\n£75,000 - £85,000\nRemote position with travel once a month to meet the team\nBonus\nHealthcare\nLife Insurance\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Purchasing and Supply Chain",
        "industries": "Restaurants"
    },
    {
        "title": "Financial Controller",
        "company": "Vitae Financial Recruitment",
        "location": "Watford, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/financial-controller-at-vitae-financial-recruitment-4207350738?position=18&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=QmAk%2BXCuisYJrdnC6PYjQA%3D%3D",
        "scraped_at": "2025-04-15 19:07:33",
        "description": "Job Title: Financial Controller - Insurance\nLocation: Watford\nSalary: £90,000 - £100,000 plus Travel Allowance\nBenefits: Bonus, Excellent Pension Contribution, Excellent Pension, Private Medical, 26 Days Holiday\nHybrid Working: 2-3 days per week in the office\n\nWe are seeking an accomplished finance leader with expertise in the insurance sector to join our client as a Financial Controller. This is a highly hands-on and operational role, requiring someone who is comfortable rolling up their sleeves while overseeing all aspects of financial reporting and operations. The successful candidate will ensure compliance with regulatory standards while driving efficiencies across the business.\n\nKey Responsibilities:\n\nFinancial Reporting & Compliance:\nLead the preparation of statutory accounts and audit files.\nManage regulatory filings and company secretarial duties.\nEnsure compliance with local and international accounting standards, liaising with external auditors as required.\n\nTaxation:\nOversee IPT, VAT, and Corporate Tax obligations.\nReview and prepare tax returns, ensuring timely and accurate submissions.\n\nTreasury Management:\nMaintain strong relationships with banking partners.\nManage bank mandates and approval processes.\nDevelop and monitor monthly cash forecasts to optimise liquidity.\n\nGroup Reporting:\nCoordinate quarterly group consolidation activities.\nWork closely with regional and head office finance teams to meet group reporting timelines.\n\nRegulatory Compliance:\nPrepare bi-annual and year-end submissions to regulatory bodies.\nContribute to annual reports and ensure ongoing compliance with industry regulations.\n\nFinance Operations:\nOversee the finance team’s day-to-day operations, including outsourced activities.\nDrive efficiency through the adoption of best practices and the implementation of new accounting standards.\n\nAbout You:\n\nExperience:\n10+ years of progressive finance experience, ideally within the insurance industry.\nLeadership:\nProven ability to lead and inspire teams, balancing hands-on involvement with strategic oversight.\n\nTechnical Expertise:\nFully qualified accountant (ACA or ACCA) with a deep understanding of accounting principles and IFRS standards.\nExperience with accounting systems such as SAP is advantageous.\n\nStrategic Focus:\nSkilled at prioritising resources to achieve strategic goals and delivering process improvements.\n\nCommunication:\nStrong interpersonal skills with the ability to influence stakeholders at all levels.\nAdaptability:\nEnergetic and proactive, with a results-driven approach and a commitment to continuous improvement.\n\nIT Skills:\nAdvanced Excel skills are essential.\n\nThis is an exciting opportunity for an experienced finance professional to step into a leadership role within a forward-thinking organisation. If you are ready to make a lasting impact, apply now!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Finance and Accounting/Auditing",
        "industries": "Insurance"
    },
    {
        "title": "Business Analyst",
        "company": "Arthur Recruitment",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-arthur-recruitment-4209696643?position=19&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Y1TaZPfJyqdtg%2FIWbatpUQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:35",
        "description": "Business Analyst - (Insurance)\n\nA Global insurance company is looking for a Business Analyst to join their Data team. In this role, you’ll gather and analyse business needs, design data solutions, and support project delivery.\n\nEssential skills of the: Junior Business Analyst – Data\n\nExpertise in business process mapping, data analysis, and requirements gathering.\nProficient in Azure, AWS, and data lake/data mesh concepts.\nSkilled in Agile methodologies, Jira, and Confluence.\nStrong communicator with excellent documentation skills.\nKnowledge of GDPR, Solvency II, and data governance.\n\nIf this position is of interest, please don’t hesitate to apply. Joshua from Arthur will be in touch to discuss your application.\n\nSalary: £50,000 – £65,000 per annum\nLocation: Central London, EC3A – 3 days per week\nStart Date: ASAP (up to 3 months’ notice)\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Other, Information Technology, and Analyst",
        "industries": "Staffing and Recruiting and Insurance"
    },
    {
        "title": "Corporate Credit Analyst",
        "company": "Roka Search",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/corporate-credit-analyst-at-roka-search-4210675690?position=20&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=PXwr%2BgpBFPvcJ7El4W3H%2Bg%3D%3D",
        "scraped_at": "2025-04-15 19:07:36",
        "description": "𝗖𝗿𝗲𝗱𝗶𝘁 𝗥𝗶𝘀𝗸 𝗠𝗮𝗻𝗮𝗴𝗲𝗺𝗲𝗻𝘁\n\nLevel: AVP\nPrimary Coverage: Natural Resources - Oil, Gas, Commodity Traders\nJob Type: Permanent\nLocation: London, Hybrid Working\nRelevant Experience: Must have Investment Banking / Corporate Banking Experience\n\nWe are currently working with a leading global financial institution to recruit an Assistant Vice President (AVP) - Credit Risk Management for their Corporate Credit Risk Team in London. This is a second line of defence role, offering the opportunity to play a critical part in managing and mitigating credit risks across EMEA.\n\nOur client is looking for a proactive and analytical professional to provide oversight and detailed analysis of corporate credit transactions, ensuring robust risk management practices and supporting sustainable growth.\n\nKey Responsibilities\nCredit Analysis: Conduct structured reviews of Front Office credit applications, identifying and articulating risk issues and mitigations.\nRisk Appetite Communication: Clearly communicate the Credit Department’s risk perception and appetite for transactions, ensuring alignment with bank policies and procedures.\nFront Office Collaboration: Act as a trusted partner to Front Office deal teams, providing constructive challenge on risk issues while supporting timely client delivery.\nPortfolio Management: Ensure accurate obligor grading and forward-looking risk assessments within your assigned portfolio.\nEmerging Risk Monitoring: Proactively monitor and address emerging credit risks in collaboration with Front Office and other risk functions.\nSpecial Credits Oversight: Review Self-Assessment submissions and credit cost provisioning for Special Credits.\n\nYour Background\nQualifications: Degree-level education and/or relevant professional qualifications (e.g., ACA, ACCA, ACT, CFA).\nExperience: Some experience in a credit management role (1st or 2nd line), with strong corporate credit analysis skills.\nTechnical Knowledge: Familiarity with corporate loan products, trade finance products, and derivative products, including relevant documentation.\n\nSkills:\nExceptional written and verbal communication skills, with the ability to prepare clear and concise credit papers.\nStrong interpersonal skills, with a collaborative approach to teamwork.\nHigh level of IT literacy and proficiency in risk management tools.\n\n𝕎𝕙𝕪 𝕋𝕙𝕚𝕤 𝕆𝕡𝕡𝕠𝕣𝕥𝕦𝕟𝕚𝕥𝕪?\n\nHybrid Working: Enjoy the flexibility of hybrid working, balancing office collaboration with remote productivity.\nCareer Growth: Be part of a dynamic and supportive team, with opportunities for professional development and career progression.\nImpactful Work: Play a key role in shaping the bank’s credit risk strategy and ensuring sustainable growth.\nCompetitive Package: Benefit from a salary of up to £80,000, plus a comprehensive benefits package.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Research, and Finance",
        "industries": "Banking, Investment Banking, and Investment Management"
    }
]