[
    {
        "title": "EA to CEO, Private Equity",
        "company": "ISE Partners",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/ea-to-ceo-private-equity-at-ise-partners-4192219469?position=1&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=QyEqoymvGf8XEIQiB3VzRQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:05",
        "description": "A highly experienced Private/Business EA is required to support an UHNW founder, for this global Private Equity fund, in an all encompassing EA role managing business and personal elements of their life. Working a part of a senior team, you will be responsible lifestyle management, projects and business scheduling.\nThis is a role requiring 24/7 availability, 5 days in office and a dedicated, proactive approach.\n\nWith no two days the same and huge variety, you will be someone who thrives on the challenge of responding to the requirements of a hugely demanding international office and personal life. You will enjoy operating in a demanding private PA role, embracing a challenge and take pride in delivering results, while also being able to fulfil the more structured corporate tasks in the business capacity. Working as part of a team within the CEO's office is also essential. Communication skills and problem solving are essential skills.\n\nYou should also be available 24/7 evenings and weekends, to support in a full capacity.\n\nExperience required: please review before applying:\nSalary circa £90-100K+\nExperience of supporting an UHNW individual as a Private PA is essential, with additional CEO level experience with an international remit, is essential. Applications made without this experience will not be considered.\nStrong academics\nExcellent communication skills; able to naturally function with VIP, UHNWIs and their liaison points and the ability to work well in a team.\nYou should have a calm demeanour, be extremely well organised, intuitive, proactive and bring a positive, upbeat personality.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Venture Capital and Private Equity Principals"
    },
    {
        "title": "Executive Assistant",
        "company": "Eden Recruitment Ltd",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=2&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=3Ngsb3%2Fu5KzZMWnVqvXfzA%3D%3D",
        "scraped_at": "2025-04-15 19:07:06",
        "description": "Executive Assistant - Global Financial Services\n\nJoin a globally respected financial services firm known not just for its high performance, but for its incredible culture and show-stopping offices. We’re on the lookout for a Executive Assistant to support a high-calibre team, including Senior Managing Directors and VPs—people at the top of their game.\n\nThis is more than just a traditional EA role. You’ll be a key player, helping to keep the gears moving smoothly in a fast-paced, high-stakes environment, where your expertise is respected and your contributions truly matter.\n\nWhat You’ll Be Doing:\nSeamlessly support a dynamic team of senior leaders.\nManage highly complex calendars and juggle competing priorities.\nOrganise detailed global travel itineraries with precision.\nAct as a trusted point of contact internally and externally.\nHelp nurture an inclusive, energising team culture.\n\nWhat We're Looking For:\nSolid experience as an Executive Assistant—financial services experience is highly desired.\nHigh level ability to manage schedules and travel across time zones.\nA curious, solution-focused mindset—you’re always one step ahead.\nNext-level organisation and multitasking skills.\nStrong emotional intelligence and top-tier communication skills.\n\nWhy You’ll Love It Here:\nA collaborative, respectful, and people-first culture—you’ll feel valued from day one.\nCareer growth and learning opportunities that will keep you challenged and inspired.\nHybrid flexibility (3 days in-office, 2 remote).\nA competitive salary + benefits package that recognises your worth.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Financial Services, Investment Banking, and Venture Capital and Private Equity Principals"
    },
    {
        "title": "Commercial Finance Analyst",
        "company": "Freshminds",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=3&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Qa%2FeP%2FotCHA6E0N024nIRg%3D%3D",
        "scraped_at": "2025-04-15 19:07:08",
        "description": "Freshminds has partnered with a leading entertainment brand looking to hire an Investment and Property Business Partner to drive key strategic initiatives within its investment & property people and technology functions.\n\nWorking closely with senior management and reporting to the Director of Commercial Finance, you’ll provide data-driven insights to enhance decision-making, assess capital investments, and track the performance of new sites, technology, and workforce initiatives.\n\nWhat you’ll be doing:\nManaging investment cases for property, new sites, and technology.\nDeveloping reports and analysis to support investment and capital planning.\nIdentifying trends, risks, and opportunities using advanced analytics.\n\nRequirements:\nStrong data and analytical skills (SQL, Advanced Excel, Power BI with Python/Amazon RDS desirable).\nExperience in investment, property, or multi-site businesses.\nProven consulting skill-set.\nAbility to translate complex challenges into actionable insights.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting, Finance, and Strategy/Planning",
        "industries": "Entertainment Providers"
    },
    {
        "title": "Business Analyst",
        "company": "Cornwallis Elt",
        "location": "Northampton, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-cornwallis-elt-4209817973?position=4&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Y6a%2FtywPlvddFRGoHg%2Fclg%3D%3D",
        "scraped_at": "2025-04-15 19:07:10",
        "description": "Business Analyst – TOM, Business Readiness, Operations, Process, Compliance, Regulatory - Northampton – £65,000 - £75,000 base + Bonus & Benefits\n\nMy client, a leading Financial Services organisation based in Northampton, are currently looking for a Business Analysts to join their new programme on a permanent basis.\n\nYou will be working directly with the Head Of to define the TOM across a new operations team being set up, in response to a Compliance mandate that will work across multiple business units in the bank. Further to this you will be running the analysis and providing the vision on the team set up, and how it will support the technology changes to follow, and defining the target operating model as this programme moves into BAU.\nThe ideal candidate will have a strong process delivery background with experience setting up new operations teams / functions with an appreciation for how technology is impacted and delivered.\n\nIf you have experience in any of the below, please apply:\nProven experience as a Business Analyst (preferably large scale Organisation or Financial Services)\nProven Target Operating Model (TOM) delivery\nA good background in business readiness / operations would be helpful\nSolid core business analysis skills, working from inception through to delivery\nExcellent stakeholder management\nExperience delivering to tight regulatory deadlines\n\nThis is an excellent opportunity for someone to join a new programme of work, that will cut across multiple business units within the bank.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst and Information Technology",
        "industries": "Financial Services and Banking"
    },
    {
        "title": "Data Analyst",
        "company": "Explore Group",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=5&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=x67Dhx93tqCzcSbhtR%2B8OQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:11",
        "description": "Data Analyst\n***MUST HAVE MARITIME EXPERIENCE***\n\nWe're looking for a skilled Data Analyst to turn complex data into clear insights that drive business performance. If you're passionate about data storytelling, automation, and impact, this is the role for you.\n\nResponsibilities:\nExtract, validate, and analyze large data sets for trends and insights\nBuild dashboards and reports (Power BI, Excel) to support decision-making\nCollaborate with stakeholders to define data requirements\nAudit data quality and ensure integrity across sources\nAutomate recurring reports and improve analytics workflows\n\nWhat we’re looking for:\n6+ years of experience in data analytics\nAdvanced Excel (VBA, Macros), Power BI, SQL, PowerPoint\nStrong statistical and analytical mindset\nBachelor’s/Master’s in Mathematics, Statistics, or related field\nBonus: Experience with automation tools and data audit processes\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Maritime Transportation"
    },
    {
        "title": "Account Executive - Airlines",
        "company": "Ultimate Asset",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/account-executive-airlines-at-ultimate-asset-4193501685?position=6&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=dBsSMJ1f6MSreTwNrSxJyA%3D%3D",
        "scraped_at": "2025-04-15 19:07:13",
        "description": "ACCOUNT EXECUTIVE (NEW BUSINESS) - SAAS GEOPOLITICAL RISK REALTIME & PREDICTION AI TECH\n\n\nUp to £60k base X2 OTE (maybe flex for the right candidate)\nRole can be remote/hybrid/office based\n\n*You must have recent experience selling SaaS into airlines\n\nThis company sell a risk solution used for global aviation.\n\nIt predicts in real time (and also predicts) security risks - its an absolute need to have SaaS products.\n\n\nExciting Bits\n\nIts a need to have product with a near perfect renewal rate\nMarket leaders in what they do\nIts tech that saves lifes as well saving companies a lot of money\nGreat enterprise companies onboard already including Virgin, Emirates and NATO\n\n\nRole\n\nSelling into new and upselling existing clients (its a mostly new business role)\nFocus on owning and selling into the mid market aviation space\nSelling 15k to six figure ARR deals\n\n\nRequirements\n\nYou must have at least 1 years SaaS closing experience\nYou also need recent experience selling SaaS into aviation companies\nExperience closing your own SaaS deals against a personal quota (at least 300k P/A plus)\nRecently hitting revenue targets\nHappy to occasionally come into the office\n\n\n\nGet in touch at Swaran@ultimateasset.com to find out more\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development and Sales",
        "industries": "Airlines and Aviation and Insurance"
    },
    {
        "title": "Senior Brand Designer",
        "company": "OWL",
        "location": "Shoreditch, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-brand-designer-at-owl-4208896949?position=7&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=MuUyrTORBZk8bCUwZY6dew%3D%3D",
        "scraped_at": "2025-04-15 19:07:14",
        "description": "At OWL, we connect exceptional talent with brands and agencies that want to make meaningful creative impact. On behalf of a bold and forward-thinking client, we’re looking for a Senior Brand Designer who doesn’t just think outside the box—but redefines what the box even is.\nThis role is about more than delivering beautiful work. It’s about reshaping how audiences experience brands—through immersive, boundary-pushing design that inspires, connects, and resonates.\n\nThe Opportunity\n\nAs Senior Designer, you’ll lead the charge on transformative creative, working closely with multidisciplinary teams to bring big, brave ideas to life. From concept to execution, across print, motion, 3D and beyond, you’ll craft experiences that go deeper than visuals—telling stories that move people.\n\nWhat You'll Be Doing\n\nCollaborating with writers, strategists, and account teams to build bold, integrated ideas that answer real human needs.\nCreating across media—from traditional formats to motion and experiential—with a focus on multidimensional storytelling.\nTurning ideas into reality with a deep understanding of craft, production, and detail.\nCommissioning and collaborating with illustrators, photographers, filmmakers and other creative partners.\nContributing to and creating storyboards, animations, and filmic assets.\nMentoring junior designers and nurturing future talent.\nPresenting your vision with confidence—internally and client-side—with clarity, passion, and purpose.\nWorking closely with project teams to ensure deadlines and deliverables are met without compromising creativity.\nHolding every piece of work to the highest standards of design excellence and strategic intent.\n\nWho You Are\n\nA creative leader with a sharp eye, strong ideas, and an even stronger drive to push them further.\nA storyteller who knows that powerful design starts with empathy, insight, and clear purpose.\nA perfectionist (in the best way) with meticulous attention to detail and craft.\nA natural collaborator and self-starter who thrives in fast-paced, ideas-first environments.\nSomeone who’s culturally curious and constantly feeding your creative mind with fresh perspectives.\n\nWhat’s in it for You\n\nA platform to stretch your creative wings—across film, experiential, retail, and other evolving disciplines.\nA stream of diverse, exciting projects that challenge conventions and keep things fresh.\nA values-led culture: inclusive, open, collaborative, and genuinely fun.\nThe chance to mentor rising talent, shape creative thinking, and leave a lasting mark—both inside the studio and out in the world.\n\nThe Culture You'll Be Joining\n\nThis is a team that leads with authenticity, depth, and purpose. Their values?\nRealness: Clear, actionable ideas grounded in truth—never fluff.\nRigour: A relentless pursuit of excellence and originality.\nEmpathy: Listening first, collaborating with heart, and designing with people in mind.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Design, Art/Creative, and Information Technology",
        "industries": "Staffing and Recruiting"
    },
    {
        "title": "Full Stack Engineer",
        "company": "Thyme",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/full-stack-engineer-at-thyme-4141111172?position=8&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=YZHDhc42p9JbDXvEhVwz7A%3D%3D",
        "scraped_at": "2025-04-15 19:07:16",
        "description": "🏢: Full Stack Engineer (backend leaning).\n📍Remote First (UK) with an office in Central London.\n💰: £45,000 - £75,000\n\nThis is a unique opportunity to join a growing company aiming to revolutionise the way we do our finances. With a lean, agile team of 10 Full Stack Engineers, you’ll be working in an exciting environment, directly contributing to the company’s success.\n\nAbout the Role.\nWe’re looking for a Full Stack Engineer to help design, develop, and scale our FinTech platform. This role leans heavily towards backend development, where you'll be responsible for building and optimising the core services and APIs that drive our system. You’ll work on ensuring high performance, scalability, and seamless integration across our microservices architecture.\n\nWhat You’ll Do:\n🔹Build and enhance backend services and APIs using Node.js and TypeScript.\n🔹Design and maintain a microservices architecture that ensures resilience and scalability.\n🔹Utilise AWS and serverless technologies to streamline infrastructure and deployment processes.\n🔹Write high-quality, maintainable code following best practices for security and performance.\n\nTech Stack:\n🔹Backend: Node.js, TypeScript\n🔹Frontend: React.js\n🔹Infrastructure: AWS Lambda, Serverless Computing\n🔹Architecture: Microservices\n\nWhat We’re Looking For? 👀\n🔹Hands-on experience as a Full Stack Engineer or in a similar role.\n🔹Strong proficiency in Node.js, React.js, and TypeScript.\n🔹Knowledge of cloud platforms (AWS) and serverless technologies.\n🔹Experience with microservices architecture and building scalable systems.\n\nWhy Join Us? ↘️\n🔹Work with a modern tech stack and help reshape financial processes.\n🔹Gain hands-on experience in an innovative environment.\n🔹Grow professionally with opportunities for learning and development.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Engineering",
        "industries": "Financial Services and Accounting"
    },
    {
        "title": "Chief Operating Officer",
        "company": "1st Formations",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/chief-operating-officer-at-1st-formations-4210665752?position=9&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=hBeKF2Si65MSQ4uukszTZw%3D%3D",
        "scraped_at": "2025-04-15 19:07:17",
        "description": "Who we are\n\nLeading e-commerce Corporate Services Group\nServices include: Company Formation, Address Services, Call Answering and Managed Live Chat, Company Secretarial, Law Practice, Serviced Offices\nCustomer base - 500,000\nCovent Garden-based\nFounder/owner CEO\nProfitable and growing at 20% per annum\n\n\n🚀 Ready to Be the Operational Powerhouse Behind the UK’s Next E-Commerce Giant?\n\nDo you thrive in high-growth environments? Are you obsessed with performance, scalability, and operational excellence? Do you have the leadership experience to drive performance from our Operations Team and customer-facing teams in a fast-paced environment?\nIf you're not just experienced—but exceptional—at managing scaling e-commerce operations, this might be the biggest leadership opportunity of your career.\n\n\n👊 Who Are We?\n\nWe’re a fast-growing e-commerce Group with a portfolio of category-defining brands. We’ve built something special—and we’re setting up to scale fast. We’re on the hunt for a strategic and hands-on execution-focused COO to help us lead from the front, build robust systems, and drive sustainable growth.\n\n\n🎯 What You’ll Be Doing:\n\nAs COO, you’ll be the driving force behind our day-to-day operations, aligning our teams, systems, and strategy to deliver best-in-class performance. This isn’t about maintaining the status quo—it’s about building what’s next.\n\nDevelop and execute scalable operational strategies across all brands and functions\nPartner with the leadership team to shape long-term vision and business goals\nOptimise Compliance, order fulfilment and customer service to improve efficiency and retention\nDrive cross-departmental alignment, setting KPIs and tracking success across key business units\nBuild a world-class team culture rooted in performance, accountability, and speed\nIdentify new tools, partners, and platforms to improve margins and scalability\n\n\n💥 What’s In It for You?\n\nA pivotal leadership role in one of the UK’s most exciting e-commerce ventures\nReal authority, real ownership, with the ability to lead teams of people\nDirect impact on the trajectory of multiple fast-scaling brands\nA high-performance team that moves fast and builds bold\n\n\n🔥 We Want to Hear from You If You Are:\n\nA proven senior operations professional with experience of both granular and strategic operations.\nExperienced leading and scaling teams in high-growth customer-facing environments\nData-obsessed, process-oriented, and laser-focused on results\nComfortable owning customer ops, compliance and commercial outcomes\nA strong leader who inspires trust, sets a high bar, and delivers\nA strategic thinker who is also happy to get into the weeds and get things done\n\nSalary: £120,000 to £140,000\nWorking hours: 37.5 hours per week, 09:00 to 17:30, Monday to Friday\nLocation: Office-based, Covent Garden\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Management",
        "industries": "Legal Services and Accounting"
    },
    {
        "title": "Global Procurement Manager",
        "company": "Sea Global",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/global-procurement-manager-at-sea-global-4207344988?position=10&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=tru4gNusyikvv2NW4uSKfQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:19",
        "description": "Title: Global Procurement Manager\nSector: FMCG / Manufacturing\nLocation: Remote with occasional travel to UK & Europe offices and sites\n\nSalary & Package: £75,000 - £80,000 + an additional strong benefits package\n\nSea Global are delighted to be partnering with a globally renowned leader in the FMCG sector, who are currently looking to appoint 2x Global Procurement Managers to join their team. They are a FTSE 100 consumer goods company who are transforming their procurement function and have ambitious plans for the future.\n\nGlobal Procurement Manager - Facilities Management\nGlobal Procurement Manager - Marketing\n\nThey are looking for Procurement professionals with expertise across Facilities Management e.g. Hard (Engineering, Maintenance) and Soft (Security, Cleaning, Catering)\n\nFor the other role they are looking for Procurement professionals with expertise in the Marketing category e.g. Creative Agencies, Advertising, Trade Marketing, Point of Sale (POS), Brand, Digital, Media, PR, Market Research.\n\nThe role reports directly into the Global Head of Indirect Procurement and sits within the wider procurement function where you will be responsible for managing the relevant category. They are ideally looking for someone with FMCG or similar industry experience who can hit the ground running from day one.\n\nThey are looking for someone to come in on a 12-month FTC with the option to go permanent. Please see below and reach out for more information!\n\nRole & Responsibilities\nDevelop and implement strategic sourcing strategies across the relevant category.\nResponsible for leading end-to-end procurement including Tenders, Negotiation, Supplier Relationship Management, Contract Management, and Spend Data Analysis.\nBuild relationships with local and international suppliers, negotiating and ensuring deals align with business activities.\nOversee the relevant category spend, strategic sourcing, and supplier negotiations.\n\nExperience & Requirements\nStrong understanding of procurement, category management, or strategic sourcing.\nComfortable working in a fast paced market, demonstrating excellent supplier and stakeholder management skills.\nDemonstrated ability to lead the Facilities Management or Marketing category.\nIdeally degree and/or MCIPS qualified\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Purchasing",
        "industries": "Manufacturing and Consumer Services"
    },
    {
        "title": "Project Manager",
        "company": "Cornwallis Elt",
        "location": "Northampton, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-cornwallis-elt-4209830853?position=11&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=EIQG9GfYwXd5GUpblIwICw%3D%3D",
        "scraped_at": "2025-04-15 19:07:21",
        "description": "Project Manager – Digital, Software, Payments, Regulatory, Agile, Change Management, Technology, Strategy, Stakeholder Management, Financial Services - Northampton - Permanent - £50,000- £65,000 Base + Bonus + Benefits\n\nMy client, a leading Financial Services organisation have a key permanent requirement for a number of Project Managers to join a critical regulatory programme of work in their Northampton based office.\n\nThe ideal candidate will have a solid technical background / understanding coupled with strong, broad end to end Project Management experience. This role will be supporting a number of high profile technical programme of change in the Digital and Payments space, as well as a time critical FCA regulated programme with a specific focus on the delivery of various improvements within their existing digital and payments platform.\n\nYou will need strong Project Management delivery experience in both agile and waterfall environments and will need to be comfortable facing off to senior stakeholders across the organisation. These are key projects of work that need mobilising, in which you will be in charge of complex teams and £multi-million project budgets as well as managing change within delivery, planning, risks and issues, ensuring delivery in line with the business’s requirements. My client are keen on speaking with individuals who have end to end project experience with a delivery focused mindset, who can anticipate change in a large organisation.\n\n\nThe be successful in this role you will need;\nProven Project Manager, preferably within a large-scale organisation / Financial Services\nRegulatory experience would be highly beneficial\nExcellent stakeholder management\nProven experience managing multiple project work streams\nStrong experience managing and implementing change projects\nRegulatory project experience would be highly beneficial\nAgile and waterfall methodology exposure\nStrong experience of writing and translating both business and functional specifications\nExtensive stakeholder management skills\n\nThis is an excellent opportunity for someone to join an expanding and exciting team in what is a highly visible area at the moment, with multiple on-going projects.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management and Information Technology",
        "industries": "Financial Services and Banking"
    },
    {
        "title": "Project Manager",
        "company": "Tarka Talent",
        "location": "England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-tarka-talent-4207351282?position=12&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=NtccNKjCO%2FC4MSSwBfQBgg%3D%3D",
        "scraped_at": "2025-04-15 19:07:22",
        "description": "Project Manager\n£60,000 - 75,000\nHybrid, flexible working\n\nWe are partnered with a high-growth SaaS organisation in the Energy sector who are growing their in-house consulting/project delivery team.\n\nThe Project Manager will be responsible for managing the end-to-end delivery of your assigned project from start-up, through to execution and close-down, to the required standard of quality and within specified constraints of time and costs.\n\nResponsibilities include:\nFull project lifecycle ownership, from inception to deployment and handover to BAU support\nClient leadership through the project, providing expert guidance, advice and negotiation where required\nCost estimating and budget management\nConstruction of detailed work plans coupled with activity and resource planning\nCommunication of progress across all key internal and external stakeholders\nWorking with wider teams to deliver projects creatively and analytically in a problem-solving environment\n\nWhat we are looking for:\nKnowledge of the Energy sector\nExperience in managing and coordinating complex projects from inception to completion – delivering to time, quality and budget\nExperience of delivering Agile SaaS projects\nExperience of delivering tech-lead transformation projects is essential\nEntrepreneurial mind-set and a good problem-solver, with a structured approach to formulate the best outcome\nHappy being hands-on, working in an environment with changing priorities and deadlines\nCommercially-minded\n\nLogistics:\nAt least 3 days working from home a week\nA few days a month in Windsor\nA few days a month in Nottingham\n\nBenefits include pay reviews annually linked to performance, discretionary bonus, private healthcare, and gym membership.\n\n------\n\nRegretfully, due to a high volume of applicants, we are only able to reply to those who are successful.\n\nEqual Opportunities:\n\nWe are committed to promoting equality of opportunity for all employees and job applicants. In line with the Equality Act 2010, we strive to create and maintain a working environment in which everyone is able to make the best use of their skills, free from discrimination or harassment, and in which all decisions are based on merit. No person is subjected to any less favourable treatment on any discriminatory grounds on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy and maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting",
        "industries": "Business Consulting and Services, Utilities, and Services for Renewable Energy"
    },
    {
        "title": "Information Technology Auditor",
        "company": "Lutine Bell",
        "location": "Edinburgh, Scotland, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/information-technology-auditor-at-lutine-bell-4183931288?position=13&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=M4lCGULfWat5VkFkRi3%2BWQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:24",
        "description": "Location: Edinburgh\nHybrid: 4 days per week in the office\n\nLutine Bell are supporting a leading global financial service organisation to appoint an IT Auditor into their Edinburgh office.\n\nKey Responsibilities:\nDeliver core testing controls and fieldwork with technical proficiency.\nCommunicate effectively with stakeholders and team members.\nWork on documentation and IT audit tasks.\nUnderstand risk and controls, and lead walkthroughs.\nCollaborate cross-functionally with Internal Audit (IA) teams.\n\nWhy Join Us:\nFlexible and collaborative team environment.\nOpportunity for rapid growth and career advancement.\nExposure to various areas including data, AI, infrastructure, and cybersecurity.\nAbility to carve your own path and explore new areas of the business.\nSupportive leadership that encourages innovation and exploration.\n\nRequirements:\nStrong understanding of application development, databases, operating systems, networking and other key technology infrastructure components.\nAt least 3 years in a technology audit and/or technology risk management function\nUndergraduate or graduate degree in management information systems, engineering, technology, computer science or a related field is preferred.\nRight to Work in the UK (no sponsorship available)\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology and Accounting/Auditing",
        "industries": "Financial Services"
    },
    {
        "title": "Project Manager",
        "company": "urban",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-urban-4208075921?position=14&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=1eKETMxGwAYM%2BsDdDs4Qbw%3D%3D",
        "scraped_at": "2025-04-15 19:07:25",
        "description": "Senior Architect\nLocation: Central London (Hybrid working)\nSalary: £60,000 - £65,000 per annum\n*Permanent*\n\nThe Role\nA prestigious multi-disciplinary design studio in Central London is seeking a Senior Project Manager to join their growing team. Known for delivering exceptional high-end residential and luxury hospitality projects across the UK and internationally, the studio offers a full turnkey service from architecture and interior design through to project management.\nYou’ll play a key role in managing complex, design-led projects from pre-construction through to handover - working closely with internal teams, consultants, contractors, and clients to ensure seamless delivery. Reporting to the Head of Project Management, this role is ideal for someone with a background in architecture or a construction-related field and a passion for premium design.\n\nRequirements\n5+ years of project management experience in the UK\nTrack record of delivering high-end residential, commercial, or hospitality projects\nFamiliarity with projects ranging from £1m to £15m in value\nUnderstanding of bespoke detailing and luxury finishes\nExperience managing design coordination, procurement, contracts, and construction processes\nExcellent communication and leadership skills in client-facing environments\nProficiency in Smartsheet, Excel and Microsoft Project; AutoCAD familiarity is a plus\nStrong understanding of UK building regulations, construction methods, and planning policy\nOrganised, proactive, and detail-oriented with a collaborative mindset\n\nBenefits\nWork on prestigious design-led projects across the UK and internationally\nCollaborative, supportive studio culture with scope for progression\nHybrid working arrangements\nPet friendly office\nCompetitive salary\n\nInterested in learning more or ready to apply? Email your CV to fran@bemoreurban.com\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management",
        "industries": "Construction, IT Services and IT Consulting, and Building Construction"
    },
    {
        "title": "Account Executive",
        "company": "Ultimate Asset",
        "location": "United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/account-executive-at-ultimate-asset-4189725471?position=15&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=HM4F3G4SLTZNddw%2BT5YbBw%3D%3D",
        "scraped_at": "2025-04-15 19:07:27",
        "description": "ACCOUNT EXECUTIVE (NEW BUSINESS) - SAAS GEOPOLITICAL RISK REALTIME & PREDICTION AI TECH\n\n\nUp to £60k base X2 OTE (maybe flex for the right candidate)\nRole can be remote/hybrid/office based\n\n*You must have recent experience selling SaaS into aviation\n\nThis company sell a risk solution used for global aviation.\n\nIt predicts in real time (and also predicts) security risks - its an absolute need to have SaaS products.\n\n\nExciting Bits\n\nIts a need to have product with a near perfect renewal rate\nMarket leaders in what they do\nIts tech that saves lifes as well saving companies a lot of money\nGreat enterprise companies onboard already including Virgin, Emirates and NATO\n\n\nRole\n\nSelling into new and upselling existing clients (its a mostly new business role)\nFocus on owning and selling into the mid market aviation space\nSelling 15k to six figure ARR deals\n\n\nRequirements\n\nYou must have at least 1 years SaaS closing experience\nYou also need recent experience selling SaaS into aviation companies\nExperience closing your own SaaS deals against a personal quota (at least 300k P/A plus)\nRecently hitting revenue targets\nHappy to occasionally come into the office\n\n\n\nGet in touch at Swaran@ultimateasset.com to find out more\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development and Sales",
        "industries": "Airlines and Aviation and Insurance"
    },
    {
        "title": "Senior National Account Manager",
        "company": "Artisan People Group",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-national-account-manager-at-artisan-people-group-4189299341?position=16&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=b4XIUbOOJR9Y%2Bpky%2FYWnXQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:29",
        "description": "A masstige beauty brand is looking for an experienced Senior National Account Manager to be based in London. This is a 12 month maternity cover role starting at the end of May.\n\nAs Senior National Account Manager, you are responsible for contributing towards the development of one of the client’s three key pillar brand strategies focusing on a leading retailer, Boots UK. You will act as the key contact for all negotiation, commercial discussion and strategy with the retailer.\n\nAn overview of your key responsibilities:\nTo autonomously drive the UK growth of the brand within the leading retailer\nBuild upon the brand’s rapid growth in the retailer, maintaining sustainable profitability model\nManagement of gross margin, COGS blend, investment and local market strategies balancing the overall P&L for your account\nTo budget, forecast and manage the line level and account level requirement\nInfluence both brand retailer initiatives, to creatively deliver a growth strategy, building upon collaborative relationships, both new and established\nBe the eyes and ears of the brand within the retailer, listening to feedback, reporting the strategies of the retailers back to the brand\nBuild credible and collaborative relationships with all levels of the retail partner\nBe the driver of cross functional relationships internally and ensuring the strategic needs of the retailer business and its growth plan are met by the business\nWorking closely with Finance to ensure business accounting is accurate\n\nOur ideal candidate has experience working at Boots UK, such as a current Boots employee looking for a promotion, a category manager, an assistant buyer or a candidate who has relationships at Boots.\n\nYou should be proficient in Microsoft Office and possess a relevant degree or equivalent. You possess advanced numerical and literacy skills, enabling you to translate data into actionable insights that drive positive change. Your excellent communication abilities ensure clear and compelling presentations. Extensive beauty industry knowledge is further complemented by your keen market awareness and consumer trend interpretation skills.\n\nYour track record of progression and a mix of experience in both large and small companies, particularly within skincare, demonstrates a commitment to growth. Finally, your excellent communication skills, collaborative spirit, strong work ethic, and entrepreneurial drive position you for success.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Sales and Business Development",
        "industries": "Retail Luxury Goods and Jewelry and Retail"
    },
    {
        "title": "Head of Procurement",
        "company": "The TalentPool Company",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/head-of-procurement-at-the-talentpool-company-4209699382?position=17&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=T3O3AKuwSi3cUa9T%2FTXzYQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:31",
        "description": "About the Company - One of the fastest growing food (QSR) brands in the UK. The business continues to grow within the UK and wider regions. It's at a crucial phase to find the right people to put the necessary processes and procedures in place to achieve their plans.\n\nAbout the Role - The role is reporting into the Chief Procurement Officer, responsible for the UK & I team.\n\nResponsibilities:\n\nProvide high quality analysis and market intelligence of Procurement activities to inform strategic direction\nSourcing and risk identification in every area of the process\nTender, negotiate and coordinate the execution of framework contracts with suppliers\nEnsure project management of all sourcing activities and strategic food and non-food products\nWork with other departments to install and embed new product and existing product development processes and procedures\n\n\nAbout you:\n\nFood Procurement (ideally Restaurant/QSR/Casual Dining)\nLed and managed procurement teams (small teams count)\nEnd to end procurement\nSupported and led complex tenders for large global businesses\nStakeholder management\n\nPackage:\n£75,000 - £85,000\nRemote position with travel once a month to meet the team\nBonus\nHealthcare\nLife Insurance\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Purchasing and Supply Chain",
        "industries": "Restaurants"
    },
    {
        "title": "Financial Controller",
        "company": "Vitae Financial Recruitment",
        "location": "Watford, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/financial-controller-at-vitae-financial-recruitment-4207350738?position=18&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=QmAk%2BXCuisYJrdnC6PYjQA%3D%3D",
        "scraped_at": "2025-04-15 19:07:33",
        "description": "Job Title: Financial Controller - Insurance\nLocation: Watford\nSalary: £90,000 - £100,000 plus Travel Allowance\nBenefits: Bonus, Excellent Pension Contribution, Excellent Pension, Private Medical, 26 Days Holiday\nHybrid Working: 2-3 days per week in the office\n\nWe are seeking an accomplished finance leader with expertise in the insurance sector to join our client as a Financial Controller. This is a highly hands-on and operational role, requiring someone who is comfortable rolling up their sleeves while overseeing all aspects of financial reporting and operations. The successful candidate will ensure compliance with regulatory standards while driving efficiencies across the business.\n\nKey Responsibilities:\n\nFinancial Reporting & Compliance:\nLead the preparation of statutory accounts and audit files.\nManage regulatory filings and company secretarial duties.\nEnsure compliance with local and international accounting standards, liaising with external auditors as required.\n\nTaxation:\nOversee IPT, VAT, and Corporate Tax obligations.\nReview and prepare tax returns, ensuring timely and accurate submissions.\n\nTreasury Management:\nMaintain strong relationships with banking partners.\nManage bank mandates and approval processes.\nDevelop and monitor monthly cash forecasts to optimise liquidity.\n\nGroup Reporting:\nCoordinate quarterly group consolidation activities.\nWork closely with regional and head office finance teams to meet group reporting timelines.\n\nRegulatory Compliance:\nPrepare bi-annual and year-end submissions to regulatory bodies.\nContribute to annual reports and ensure ongoing compliance with industry regulations.\n\nFinance Operations:\nOversee the finance team’s day-to-day operations, including outsourced activities.\nDrive efficiency through the adoption of best practices and the implementation of new accounting standards.\n\nAbout You:\n\nExperience:\n10+ years of progressive finance experience, ideally within the insurance industry.\nLeadership:\nProven ability to lead and inspire teams, balancing hands-on involvement with strategic oversight.\n\nTechnical Expertise:\nFully qualified accountant (ACA or ACCA) with a deep understanding of accounting principles and IFRS standards.\nExperience with accounting systems such as SAP is advantageous.\n\nStrategic Focus:\nSkilled at prioritising resources to achieve strategic goals and delivering process improvements.\n\nCommunication:\nStrong interpersonal skills with the ability to influence stakeholders at all levels.\nAdaptability:\nEnergetic and proactive, with a results-driven approach and a commitment to continuous improvement.\n\nIT Skills:\nAdvanced Excel skills are essential.\n\nThis is an exciting opportunity for an experienced finance professional to step into a leadership role within a forward-thinking organisation. If you are ready to make a lasting impact, apply now!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Finance and Accounting/Auditing",
        "industries": "Insurance"
    },
    {
        "title": "Business Analyst",
        "company": "Arthur Recruitment",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-arthur-recruitment-4209696643?position=19&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Y1TaZPfJyqdtg%2FIWbatpUQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:35",
        "description": "Business Analyst - (Insurance)\n\nA Global insurance company is looking for a Business Analyst to join their Data team. In this role, you’ll gather and analyse business needs, design data solutions, and support project delivery.\n\nEssential skills of the: Junior Business Analyst – Data\n\nExpertise in business process mapping, data analysis, and requirements gathering.\nProficient in Azure, AWS, and data lake/data mesh concepts.\nSkilled in Agile methodologies, Jira, and Confluence.\nStrong communicator with excellent documentation skills.\nKnowledge of GDPR, Solvency II, and data governance.\n\nIf this position is of interest, please don’t hesitate to apply. Joshua from Arthur will be in touch to discuss your application.\n\nSalary: £50,000 – £65,000 per annum\nLocation: Central London, EC3A – 3 days per week\nStart Date: ASAP (up to 3 months’ notice)\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Other, Information Technology, and Analyst",
        "industries": "Staffing and Recruiting and Insurance"
    },
    {
        "title": "Corporate Credit Analyst",
        "company": "Roka Search",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/corporate-credit-analyst-at-roka-search-4210675690?position=20&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=PXwr%2BgpBFPvcJ7El4W3H%2Bg%3D%3D",
        "scraped_at": "2025-04-15 19:07:36",
        "description": "𝗖𝗿𝗲𝗱𝗶𝘁 𝗥𝗶𝘀𝗸 𝗠𝗮𝗻𝗮𝗴𝗲𝗺𝗲𝗻𝘁\n\nLevel: AVP\nPrimary Coverage: Natural Resources - Oil, Gas, Commodity Traders\nJob Type: Permanent\nLocation: London, Hybrid Working\nRelevant Experience: Must have Investment Banking / Corporate Banking Experience\n\nWe are currently working with a leading global financial institution to recruit an Assistant Vice President (AVP) - Credit Risk Management for their Corporate Credit Risk Team in London. This is a second line of defence role, offering the opportunity to play a critical part in managing and mitigating credit risks across EMEA.\n\nOur client is looking for a proactive and analytical professional to provide oversight and detailed analysis of corporate credit transactions, ensuring robust risk management practices and supporting sustainable growth.\n\nKey Responsibilities\nCredit Analysis: Conduct structured reviews of Front Office credit applications, identifying and articulating risk issues and mitigations.\nRisk Appetite Communication: Clearly communicate the Credit Department’s risk perception and appetite for transactions, ensuring alignment with bank policies and procedures.\nFront Office Collaboration: Act as a trusted partner to Front Office deal teams, providing constructive challenge on risk issues while supporting timely client delivery.\nPortfolio Management: Ensure accurate obligor grading and forward-looking risk assessments within your assigned portfolio.\nEmerging Risk Monitoring: Proactively monitor and address emerging credit risks in collaboration with Front Office and other risk functions.\nSpecial Credits Oversight: Review Self-Assessment submissions and credit cost provisioning for Special Credits.\n\nYour Background\nQualifications: Degree-level education and/or relevant professional qualifications (e.g., ACA, ACCA, ACT, CFA).\nExperience: Some experience in a credit management role (1st or 2nd line), with strong corporate credit analysis skills.\nTechnical Knowledge: Familiarity with corporate loan products, trade finance products, and derivative products, including relevant documentation.\n\nSkills:\nExceptional written and verbal communication skills, with the ability to prepare clear and concise credit papers.\nStrong interpersonal skills, with a collaborative approach to teamwork.\nHigh level of IT literacy and proficiency in risk management tools.\n\n𝕎𝕙𝕪 𝕋𝕙𝕚𝕤 𝕆𝕡𝕡𝕠𝕣𝕥𝕦𝕟𝕚𝕥𝕪?\n\nHybrid Working: Enjoy the flexibility of hybrid working, balancing office collaboration with remote productivity.\nCareer Growth: Be part of a dynamic and supportive team, with opportunities for professional development and career progression.\nImpactful Work: Play a key role in shaping the bank’s credit risk strategy and ensuring sustainable growth.\nCompetitive Package: Benefit from a salary of up to £80,000, plus a comprehensive benefits package.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Research, and Finance",
        "industries": "Banking, Investment Banking, and Investment Management"
    },
    {
        "title": "Head of Product",
        "company": "Salt",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/head-of-product-at-salt-4209820691?position=21&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=ocgXEFc7TSPidqTyBTu%2BRg%3D%3D",
        "scraped_at": "2025-04-15 19:07:38",
        "description": "Role: Head of Product Management\nLocation: London (2 days a week)\nExperince: B2B Platform\nSalary: £90,000 - £110,000\n\n\nWe are partnered with a scaling tech-first business looking for a Head of Product to lead the development of its cutting-edge technology platforms. This is a high-impact role, collaborating closely with clients to develop innovative solutions.\n\nThis is an opportunity to lead the development of transformative solutions. You’ll work on cutting-edge projects, collaborate with a small, high-performing but low-ego team, and more broadly with key players within the sector. At this stage, this is a non-managerial position.\n\nThe work is interesting and meaningful. You’ll build relationships across many well-known end clients and create relationships.\n\nDay to Day:\n• Own the end-to-end product vision, strategy and execution for 1-2 key technology platforms.\n• Defined and managed the product roadmap and set clear milestones for delivery.\n• Collaborate deeply with internal and external teams\n• Create processes for innovating product features and data/technical opportunities and then take them through the stages to become working products.\n• Defined and tracked key metrics, analysing data to inform decisions on product strategy.\n• Manage vendors and service providers to ensure that services are delivered at the right speed, quality and cost.\n• At this stage, the role does not involve line management.\n\n\nIf you are interested, apply today.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Product Management",
        "industries": "Information Services"
    },
    {
        "title": "Quantitative Researcher - Commodities",
        "company": "Algo Capital Group",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/quantitative-researcher-commodities-at-algo-capital-group-4202849816?position=22&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=lrPosx%2BR9zQjk5Y9FxFisQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:40",
        "description": "A leading global hedge fund is seeking an experienced Quantitative Researcher to join their systematic commodities team in London. This role will focus on mid-frequency trading, with responsibility for the design, implementation, and optimization of advanced trading strategies across global commodity markets.\n\nResponsibilities:\nDesign, implement, and optimize mid-frequency algorithmic trading strategies for commodity markets including energy, metals and ags.\nWork alongside the PM with a focus on alpha generation, model implementation, backtesting and portfolio construction.\nWork closely with leading quantitative researchers and engineers to improve existing strategies and identify new trading opportunities.\n\nQualifications:\nAdvanced academic qualifications (Master's/PhD) in a quantitative field, such as Mathematics, Physics, Statistics, Computer Science, or a related discipline.\nProven experience in generating alpha and developing high-performing strategies within commodity markets\nStrong background in quantitative trading, with specific expertise in mid-frequency commodity strategies.\nExtensive proficiency in programming languages including Python\nDeep expertise in machine learning techniques and tools, with a focus on their application in strategy development and optimisation.\n\nThis position offers an exceptional opportunity for a seasoned quantitative researcher to make a significant impact within mid-frequency commodity markets. If you are driven by the pursuit of innovation in algorithmic trading and are looking for a challenging, high-impact role, we invite you to apply or reach out to amarsh@algocapitalgroup.com\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Finance, Research, and Engineering",
        "industries": "Financial Services, Investment Management, and Capital Markets"
    },
    {
        "title": "Head of Process (Engineering, Production and NPD)",
        "company": "Focus Management Consultants",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/head-of-process-engineering-production-and-npd-at-focus-management-consultants-4208065981?position=23&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=7WDgpA%2Benr01HhDfEYNKSw%3D%3D",
        "scraped_at": "2025-04-15 19:07:42",
        "description": "Head of Process (Engineering, Production and NPD)\nLondon\n£80,000 - £100,000 + Benefits\n\nThis Head of Process is an excellent opportunity for someone with a strong background in process engineering, engineering, and operational excellence, within food manufacturing.\n\nOur client is a leading food business with a global presence, who have excellent products and brilliant customers.\n\nWe are seeking a professional with a robust background in process engineering and engineering or production and operational excellence, ideally within the realm of food manufacturing.\nKey responsibilities include fostering collaboration among operations, engineering, production, and NPD teams, Continuous Improvement initiatives and process enhancement. The focus lies on optimising and standardising processes to enhance factory operations efficiently.\n\nReporting directly to Group Operations Director, the role mandates a seasoned professional who has exposure to corporate or large PLCs and has worked at group level before. The position necessitates a minimum of 50% travel to all sites across Europe.\n\nThe ideal individual should bring a wealth of experience in driving Operational and Engineering Excellence strategies across various sites.\n\nThe successful professional will possess strong process engineering acumen, coupled with a flair for innovation, ensuring a keen eye for enhancing operational efficiencies. An effective communicator able to work with key stakeholders, different sites, and departments.\n\nIf you feel you have the right skills and attributes for this Head of Process, then please apply!\n\nContact Daniel for more details.\n\nREF. DJF49611\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Engineering, Manufacturing, and Management",
        "industries": "Food and Beverage Manufacturing, Dairy Product Manufacturing, and Beverage Manufacturing"
    },
    {
        "title": "Senior FP&A Manager",
        "company": "Unitas Talent",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/senior-fp-a-manager-at-unitas-talent-4188506942?position=24&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=way0ruc9gBSpr7ekz0QZYw%3D%3D",
        "scraped_at": "2025-04-15 19:07:44",
        "description": "An incredibly exciting and acquisitive £1bn t/o PE backed organisation who have grown tremendously over the past 4 years are currently looking to hire a Senior FP&A Manager, who will ultimately be a succession hire into the Head of FP&A role within a 12-month period.\n\nSome of the responsibilities of the Senior FP&A Manager:\n\nOwnership the five-year budget and business plan process, working with senior executives and divisional finance directors.\nSupport the M&A team with new acquisitions, integrations and alignment to the Group’s reporting requirements.\nLead all lender reporting including business presentations to meet the Group’s covenant requirements.\nLead all investor reporting, providing key insight into Group performance and answering queries as required.\nPeople management responsibility for the FP&A analyst, providing coaching, guidance and support.\nUndertake detailed financial analysis using advanced excel and modelling skills to provide business insight to the executive and enable the Group to meet its objectives.\nSupport with the development and measurement of the Group’s KPIs.\n\nSkills, knowledge and experience of the successful Senior FP&A Manager:\n\nQualified accountant (ACA, ACCA, CIMA or equivalent)\nIdeally strong experience of financial modelling, budgeting and forecasting\nExperience of business partnering with senior stakeholders\nSignificant experience leading budgeting and forecasting processes.\nStrong presentational skills with the ability to present financial data clearly.\nCommitted team player with a proven ability to hit deadlines in a fast-paced environment.\nThe ability to challenge senior stakeholders and operate with appropriate impact and influence.\n\nIn summary, if you’re looking to join a highly impressive finance function, and work in a role that is varied with lots of exposure to exec and the genuine chance to progress to ‘Head of’, please do apply.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing",
        "industries": "Consumer Services"
    },
    {
        "title": "Finance Business Partner",
        "company": "Stanton House",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/finance-business-partner-at-stanton-house-4183950536?position=25&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=xm1TYEgr4G8NyseHSZoZlw%3D%3D",
        "scraped_at": "2025-04-15 19:07:45",
        "description": "Stanton House is partnering with a is a highly successful, Private Equity-backed global information and data services business. Following significant growth, including a major M&A transaction, our client was acquired last year by a market leading Private Equity fund. With strong revenues and EBITDA, the business is poised for its next phase of expansion, with ambitions to become a £1bn+ enterprise value platform.\n\nTo support this exciting trajectory, they are looking to appoint a Finance Business Partner. This role will work closely with operational teams, providing financial insight and strategic support to drive business performance.\n\nThis is a fantastic opportunity for a qualified professional with post-qualification experience in commercial finance or FP&A to join a high-growth company at a pivotal moment, following new private equity investment. The successful candidate will play a key role in shaping the business’s direction while collaborating with a broad range of stakeholders.\n\nKey Requirements:\nACA / ACCA / CIMA qualified, with PQE in a commercial finance/FP&A role\nAble to demonstrate close collaboration with operational teams, including examples of contributing to performance.\nOwnership of budgeting and forecasting for customer facing areas of the business, including associated costs\nA background in a commercial organisation, ideally in a subscription business\nDriving commercial decisions in partnership with stakeholders\nCommercially minded with a desire to build a strong understanding of our products and services\nA pro-active thinker and problem solver who will drive initiatives forward with creativity and pragmatism\nGood communicator who is comfortable and confident building rapport and having difficult conversations in a collaborative and constructive way, along with addressing a variety of audiences\nAbility to deliver in a fast-paced environment and multitask, prioritise and see things to conclusion\nStrong commercial acumen, gravitas and the ability to confidently operate with senior stakeholders, managing relationships and influencing decisions\nAn appropriate blend of being able to work independently but also know when and how to ensure upwards stakeholders are kept in the loop\nComfortable spending most of their time embedded in and working with parts of the business\nStrong excel skills and ability to transform discussions around plans and strategies into tangible business cases/financial plans\n\nKey Responsibilities:\nOverall responsibility for providing commercial finance support to operational functions\nThe successful candidate will be an essential and highly valued partner, meaning they will be extremely well integrated into these parts of the business\nLeading budgeting and quarterly reforecasting for specific areas, including all associated revenues and costs.\nBe able to explain trading and operational performance for their areas on a monthly basis, including providing month end commentary for the senior finance team, and support the teams they are working with on driving operational performance\nDevelopment and ongoing management of KPI’s and other performance metrics including sales pipelines for both growth and retention revenue streams, sales productivity, customers retention rates, upsell and cross sell performance\nWorking with the Head of Commercial Finance to give performance updates to the leadership teams\nNo line management responsibility\n\nIf you meet the above-mentioned criteria, please apply below. Due to a high number of applicants, we shall unfortunately be unable to respond to all unsuccessful applicants\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Finance",
        "industries": "Venture Capital and Private Equity Principals, Information Services, and Technology, Information and Media"
    },
    {
        "title": "Strategic Procurement Manager",
        "company": "Ventula Consulting",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/strategic-procurement-manager-at-ventula-consulting-4208087501?position=26&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=6VywDRf6kQKLms5uOJIIWg%3D%3D",
        "scraped_at": "2025-04-15 19:07:47",
        "description": "Strategic Procurement Manager – Europe and UK - London – Hybrid (3x a week onsite) – £50,000 - £60,000 + bonus\n\nExperienced Strategic Procurement Manager to lead and shape procurement strategies for our globally recognised exterior media client, managing a broad range of categories across the UK and Europe.\n\nIn this pivotal role, you’ll develop and execute procurement strategies for key product and service categories, while partnering closely with the Product Design Team to source and develop innovative physical products for 10 markets across Europe.\n\nThe strategic Procurement will also lead sustainability initiatives, including sourcing eco-friendly materials, tracking carbon footprints, and driving efforts to reduce environmental impact. Additionally, you’ll provide commercial insight on supplier agreements, negotiate favourable terms, and manage partnerships with high-volume suppliers—ensuring operational efficiency and cost-effectiveness.\n\nKey Requirements:\nExperienced Procurement Manager\nSourcing physical products\nCommercial input\nProcurement transformation\nERP/SAP or similar systems (preferred)\nMBA or Masters in Logistics and Supply Chain (Preferred)\n\nLocation: London\nSalary: £50-60k + Bonus\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Purchasing, Information Technology, and Supply Chain",
        "industries": "Technology, Information and Media, Broadcast Media Production and Distribution, and Information Services"
    },
    {
        "title": "Data Scientist",
        "company": "Immersum",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/data-scientist-at-immersum-4209837600?position=27&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=Lw8TRH7pgHmen6qr1tnkwQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:49",
        "description": "Job Title: Data Scientist\nSalary: £60,000-£67,500 + Benefits\nLocation: West London - Hybrid (3 days p/w in-office)\nTech: AWS, Snowflake, Airflow, DBT\n\nThe Company:\nImmersum are supporting the growth leading PropTech company on a mission to revolutionise how the property sector understands people, places, and data. By combining cutting-edge data science with powerful location intelligence, they help major organisations make smarter, faster decisions. Backed by top-tier investors and growing fast, this is your chance to shape the future of PropTech from the inside.\n\nThe Role Requirements:\nAs a Data Scientist, you’ll develop, deploy, and optimise data science solutions that sit at the heart of the company’s product offerings. You’ll play a critical role in shaping how data-driven insights fuel smarter decisions across the business.\n\nWhat you’ll be doing:\nSpotting opportunities to apply data science and ML to solve meaningful product challenges\nDesigning and building data pipelines to support experimentation and model development\nRunning structured experiments and analysing performance metrics to validate outcomes\nDeploying and maintaining models in production and delivering clear business impact\nCollaborating closely with product, engineering, and business stakeholders\n\nWhat you’ll bring:\nHands-on experience developing and productionising ML models\nStrong analytical background with applied stats, EDA, and model validation techniques\nConfidence working with structured data pipelines and modern tooling (AWS, Snowflake, Airflow, DBT)\nCuriosity for emerging techniques and an eagerness to learn and innovate\nExcellent communication skills, especially when simplifying complex findings for non-technical teams\n\nWhy Join:\nJoin a mission-led company building truly differentiated data products\nWork on greenfield projects and shape how data science is done across the business\nCollaborate with a team that genuinely values experimentation, insight, and product thinking\nFast-growing, well-funded environment with real autonomy and influence\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT System Data Services, Data Infrastructure and Analytics, and IT System Custom Software Development"
    },
    {
        "title": "Business Analyst",
        "company": "Crimson",
        "location": "Birmingham, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-crimson-4207387341?position=28&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=fhpUmt7mbespZqoj0YvCNA%3D%3D",
        "scraped_at": "2025-04-15 19:07:51",
        "description": "Business Analyst – Birmingham\n\nBirmingham – Hybrid 3 days\n\nSalary - £50,000 - £60,000 per annum\n\nOur client is seeking a highly skilled Business Analyst to join an existing BA team. In this role, you will act as a crucial link between business needs and technical solutions, ensuring seamless alignment across various sectors. Your efforts will focus on enhancing processes and delivering impactful results. The role will support a range of IT projects, encompassing both application and infrastructure-related initiatives.\n\n\nKey Skills and Responsibilities:\n\n- Proven track record working on business change and business projects as a Business Analyst\n- Conduct thorough and detailed analysis of current business processes, employing process mapping tools and methodologies to identify inefficiencies and optimisation opportunities.\n- Build and maintain strong, collaborative relationships across various business units, ensuring clear, consistent, and transparent communication. Engage with stakeholders at all levels to align business objectives and ensure their needs and expectations are met.\n- Lead and facilitate comprehensive workshops, in-depth interviews, and interactive focus groups to meticulously capture, document, and validate detailed business requirements.\n- Collaborate closely with technical teams, including software developers, system architects, and IT specialists, to translate complex business needs into actionable and practical technical solutions.\n- Identify and implement opportunities for process optimisation and continuous improvement using Agile methodology. Develop and track key performance indicators (KPIs) to measure the effectiveness of process improvements and deliver measurable business benefits.\n- Law or Finance background is advantageous\n\nInterested? Please submit your updated CV to Emma Siwicki at Crimson or immediate consideration.\nNot interested? Do you know someone who might be a perfect fit for this role? Refer a friend and earn £250 worth of vouchers!\n\nCrimson is acting as an employment agency regarding this vacancy\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting"
    },
    {
        "title": "IT Business Analyst",
        "company": "Huntr Talent Group",
        "location": "Brierley Hill, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/it-business-analyst-at-huntr-talent-group-4210602428?position=29&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=rqL0LzKdCuWJnEKKBBxCTQ%3D%3D",
        "scraped_at": "2025-04-15 19:07:53",
        "description": "Job Overview:\nOur client is looking for an IT Business Analyst to join their team. The role involves a focus on identifying opportunities for innovation, optimising processes, and ensuring the successful implementation of technology-driven solutions\n\nKey Responsibilities\nPartner with the IT Director to assess and enhance the firm’s legal services through technological advancements and process improvements.\nDevelop and present comprehensive project plans to the Strategy Board, outlining objectives, scope, timelines, and resource needs.\nConduct in-depth research and analysis to support project proposals and strategic recommendations.\nLead and oversee project initiatives, ensuring adherence to agreed-upon processes and timelines.\nTrack project progress and provide regular status updates to the IT Director.\nWork collaboratively with the Development, Infrastructure, and Operations teams to design, configure, and deploy necessary systems and tools.\nCoordinate with the training team to organize workshops and training sessions, ensuring a smooth transition to new technologies and processes.\nAssess the effectiveness of implemented projects, reporting on outcomes and applying lessons learned to future initiatives.\n\nPerson Specification\nProven experience as a Business Analyst within professional services.\nA successful track record in delivering internal consultancy projects.\nExperience collaborating with cross-functional teams and managing stakeholders.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal abilities.\nStrong organizational skills, with the ability to manage multiple projects simultaneously.\nDemonstrated experience in business process optimization and technology implementation.\nA results-driven mindset with accountability for project outcomes.\n\nDetails\nFull time\nHybrid working (4 days onsite, 1 day offsite)\nPaying £60,000\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting"
    },
    {
        "title": "Data Engineer - Equity Trading - Quant Hedge Fund - £250k",
        "company": "Paragon Alpha - Hedge Fund Talent Business",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-equity-trading-quant-hedge-fund-%C2%A3250k-at-paragon-alpha-hedge-fund-talent-business-4209603327?position=30&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=9AFuSP%2FmLrsFSG9MuRtbDw%3D%3D",
        "scraped_at": "2025-04-15 19:07:55",
        "description": "I'm collaborating with an equity trading team, embedded within one of the worlds largest systematic hedge funds. To aid there seamless data driven ecosystem, they're looking for a Data Engineer to aid several PM teams.\n\nThe firm have a huge data organization underpinning the trading lifecycle, and they place data analytics and data science teams embedded in the front office to enabled more data driven trades and investments.\n\nThe role entails bringing on targeted data sets, pipelining these; and helping to wrangle and analyze the data, ready to assist in signal generation.\n\nStack: Python, AWS, ETL, SQL\n\nThe client are looking to speak to varied Data Engineers from trading backgrounds, with someone technically astute with Python and SQL as well as multiple asset classes.\n\nIf you would like the chance to earn a market leading salary with the opportunity to work in a hybrid model in tandem; then please do apply.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Business Development, and Finance",
        "industries": "Financial Services"
    },
    {
        "title": "Project Planner",
        "company": "Sustainable Talent LTD",
        "location": "Staffordshire, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-planner-at-sustainable-talent-ltd-4187254466?position=31&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=4w5FKo4sZAWZ60eS3l6A%2Fg%3D%3D",
        "scraped_at": "2025-04-15 19:07:57",
        "description": "Job Title: Project Planner (High Voltage National Grid Projects)\n\nLocation: Essex & Midlands (Flexible with Work from Home)\nContract: Permanent\nSalary: Competitive, based on experience\n\nAbout the Role:\n\nOur client, a leading organisation in the high voltage (HV) sector, is seeking an experienced Project Planner to support the successful delivery of National Grid projects. This role is crucial in ensuring the timely and efficient execution of high-profile HV transmission and distribution projects across the UK. You will be responsible for planning, scheduling, and managing project timelines while ensuring compliance with industry standards and National Grid requirements.\n\nKey Responsibilities:\n\nDevelop and maintain detailed project schedules for HV National Grid infrastructure projects, including substations, overhead lines, and cable installations.\nWork closely with project managers, engineers, and stakeholders to align project timelines with strategic objectives.\nMonitor progress regularly, updating project plans to reflect changes, mitigating delays, and adjusting resource allocation as necessary.\nIdentify risks to project schedules and provide proactive solutions to mitigate them.\nProduce progress reports and communicate schedule updates to senior management and key stakeholders.\nEnsure full compliance with National Grid standards, health and safety regulations, and project governance.\nUtilize industry-standard planning tools such as Primavera P6, MS Project, or equivalent software.\n\nKey Requirements:\n\nProven experience in project planning for high voltage (HV) projects related to National Grid or similar.\nStrong working knowledge of Primavera P6 and/or MS Project.\nFamiliarity with the UK’s National Grid governance, safety standards, and operational procedures.\nSolid understanding of HV substations, transmission lines, and related infrastructure.\nAbility to manage multiple projects and adapt to changing priorities.\nStrong communication skills, both written and verbal, with the ability to liaise effectively with technical and non-technical stakeholders.\nA proactive problem-solver, committed to delivering high-quality results on time.\n\nQualifications:\n\nDegree or equivalent qualification in Engineering, Project Management, or a related field.\nProfessional accreditation such as APM, PMI, or equivalent is desirable.\nPrevious experience working on National Grid Transmission Owner (TO) or Distribution Network Operator (DNO) projects is highly advantageous.\n\nWhy Join Our Client?\n\nOpportunity to work on some of the most significant high voltage infrastructure projects in the UK.\nCompetitive salary and benefits package.\nFlexible working arrangements, including remote work.\nWork with industry experts and contribute to the UK’s energy future.\n\n\nIf you are a detail-oriented Project Planner with experience in HV National Grid projects, we would love to hear from you!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management",
        "industries": "Services for Renewable Energy and Construction"
    },
    {
        "title": "Change Manager",
        "company": "Tarka Talent",
        "location": "England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/change-manager-at-tarka-talent-4208080916?position=32&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=oInaOO8HWoYJcWjSd2MLdg%3D%3D",
        "scraped_at": "2025-04-15 19:07:59",
        "description": "Change Manager/ Process Design SME\n£70,000-90,000\nHybrid, flexible working\n\nI am partnered with a high-growth SaaS organisation in the Energy sector who are growing their in-house transformation office.\n\nThey are looking for a Change Manager to join their 'Ways of Working' workstream to be a process design SME. This team focuses on how the business interacts with their owner and their customers.\n\nThe role will include understanding existing processes and creating solutions to optimise them, conducting change impact assessments, and mapping the transition to new ways of working.\n\nRequirements:\nConsulting or change management experience\n5 - 10 years of experience\nIn-depth knowledge of business processes - more of a focus on business processes in a tech company rather than tech processes\nPeople change experience\nBonus:\nExperience in energy/utilities/ telco\nExperience in a SaaS B2B business in an internal-facing improvement role\n\nLogistics:\nAt least 3 days working from home a week\nA few days a month in Windsor\nA few days a month in Nottingham\n\nBenefits include pay reviews annually linked to performance, discretionary bonus, private healthcare, and gym membership.\n\n------\n\nRegretfully, due to a high volume of applicants, we are only able to reply to those who are successful.\n\nEqual Opportunities:\n\nWe are committed to promoting equality of opportunity for all employees and job applicants. In line with the Equality Act 2010, we strive to create and maintain a working environment in which everyone is able to make the best use of their skills, free from discrimination or harassment, and in which all decisions are based on merit. No person is subjected to any less favourable treatment on any discriminatory grounds on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy and maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Other",
        "industries": "Business Consulting and Services, Utilities, and Services for Renewable Energy"
    },
    {
        "title": "Commercial Financial Analyst",
        "company": "Vitae Financial Recruitment",
        "location": "Watford, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/commercial-financial-analyst-at-vitae-financial-recruitment-4207355314?position=33&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=S0icTjXWC%2BUxsP%2FNTsx0qg%3D%3D",
        "scraped_at": "2025-04-15 19:08:01",
        "description": "Commercial Financial Analyst\nWatford (Hybrid)\nCirca £60,000 + Bonus + Benefits Package\n\nThis is an exciting opportunity for a commercially focused and ambitious Qualified or Finalist (ACA, CIMA or ACCA) to join this leading global business as part of a high performing and sizeable Commercial Finance Team that offers substantial career progression opportunities.\nThe role would suit an inquisitive, analytical, proactive and commercially focused individual who wants to shape and develop a role that will act as a key Finance Business Partner to a fast-paced Marketing function with a substantial budget approaching £200M.\n\nThe role has great scope and variety and as such you will have exposure to a broad spectrum of exciting commercial projects working alongside and supporting key senior stakeholders to maxmise return on investment and ultimate shape marketing strategy,\nThis will include accurate budgeting, forecasting, reporting and business partnering to the Senior Directors and the creation / ownership of reporting dashboards, commercial KPI’s and scorecards to drive financial performance.\n\nBusiness partnering across multiple workstreams and projects you will provide finance support to new initiatives, taking advantage of growth and cost-saving opportunities to maximise returns and company profit.\n\nIn Detail:\nProvide financial modelling & reporting to support commercial decision making.\nDevelop and own the Marketing Scorecard ensuring metrics and KPI’s are in line with overall strategic objectives and financial targets.\nOwnership of month end performance updates, including detailed analysis and commentary to communicate performance to internal and external stakeholders.\nOwn all month end, budget and reforecast processes to ensure timely and accurate reporting.\nDevelop reporting packs to track actual spend vs budget/forecast, spend to go, risks and opportunities etc.\nProvide financial support and guidance to initiatives for queries of an ad-hoc nature.\nClear financial control applied - financial assumptions are captured and understood.\nPresent at bi-weekly meetings as a trusted Finance Business Partner.\nValidate people costs reporting working closely with FP&A and Cost team.\nLead on process improvement - new ways to simplify and speed up current processes.\nAct as a mentor to junior members of the team and support their development.\n\nWhat we are looking for:\nYou will be qualified for finalist ACCA, CIMA, ACA, currently working within a commercial finance role – Financial Analyst, Finance Business Partner, FP&A Analyst, Commercial Finance Analyst or similar.\nAdvanced Excel and analytical skills.\nPrevious experience of supporting non-finance stakeholders.\nYou will thrive in a fast-paced environment and have the ability to work independently, create your own priorities and proactively drive the agenda.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Finance",
        "industries": "Retail and Technology, Information and Media"
    },
    {
        "title": "NPD Manager - Drinks",
        "company": "Nter Talent",
        "location": "Kent, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/npd-manager-drinks-at-nter-talent-4208934081?position=34&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=jZZdPMVNJn6aknJamZGQsw%3D%3D",
        "scraped_at": "2025-04-15 19:08:03",
        "description": "NPD Manager – Beverages\n£50,000 - £60,000 + Bonus + Benefits\nKent\nTired of the same-old product briefs, slow decision-making, and red tape?\n\nHere’s a rare opportunity to lead end-to-end NPD projects in the fast-moving world of RTD (Ready-to-Drink) beverages, where your ideas don’t sit in a queue, they hit the shelves.\n\nThis is a hands-on, commercially-focused NPD Manager role for someone who wants more autonomy, more visibility, and more impact. You’ll be joining a business with serious manufacturing capability, global reach, and a senior leadership team that actually listens to their technical experts.\n\nWhy This Job? Why Now?\nOwn the development process from idea to launch. No handoffs, no silos, no chasing approvals from five different departments.\nWork directly with customers, not just internal stakeholders, to shape projects and pitch ideas that actually get made.\nBe part of a business that invests in innovation. Not one that talks about it on the website and forgets it at budget time.\nEnjoy stability with the freedom to shape things.\nNo more being a number. You’ll be visible, valued, and part of the company’s growth story.\n\nWhat You’ll Be Doing\nLeading the full NPD process from brief to commercialisation\nDeveloping innovative formulations in the sports, RTD, and dairy-alternative space\nManaging development trials and first production runs (in-house and with third parties)\nWorking closely with procurement, production, QA, and sales to bring products to life\nConducting sensory assessments and ensuring products meet quality and organoleptic standards\nAdvising on shelf life, packaging compatibility, and regulatory compliance\nMentoring junior team members and running internal beverage development training\nContinuously improving development processes and identifying new raw material suppliers\n\nWhat You’ll Need\nBSc/MSc in Food Science, Food Chemistry, or similar\nExperience in end-to-end beverage NPD experience\nExperience working with manufacturing teams to take products from lab to line\nSolid project management skills (a PM qualification is a bonus)\nA passion for innovation, sustainability, and commercially viable science\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Manufacturing, Production, and Supply Chain",
        "industries": "Food and Beverage Manufacturing and Manufacturing"
    },
    {
        "title": "Ecommerce Manager | Fashion",
        "company": "GradBay",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/ecommerce-manager-fashion-at-gradbay-4210011819?position=35&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=xwCDHUDd9tV9nQnqr8sslw%3D%3D",
        "scraped_at": "2025-04-15 19:08:04",
        "description": "Job Title: Ecommerce Manager\nSector: Sustainable Fashion\nLocation: London\nSalary: £60,000\n\nWho We Are\n\nOur client is a fast growth sustainable women's fashion brand and a certified B Corp, a true trailblazer in eco-friendly fashion, operating multiple retail locations across southern England.\n\nThey are committed to ethical and sustainable practices—always putting people and planet at the heart of everything we do.\n\nTheir multi-channel approach includes a thriving online store, wholesale partnerships (including marketplaces), and retail boutiques in both the UK and internationally showcasing thoughtfully produced beachwear, apparel, and accessories.\n\nThe Role\nReporting directly to the Founder, you’ll shape the digital and ecommerce strategy that propels revenue, boosts brand awareness, and showcases our sustainability ethos. You’ll oversee one direct report and work closely with the marketing team to align campaigns, content, and overall storytelling with an ethical fashion focus.\n\n1. Leadership & Collaboration\nAdvise the Founder on data-driven insights and strategic opportunities for growth.\nPartner with the marketing team to align digital marketing, campaign content, and customer acquisition strategies.\nMentor a direct report, fostering professional growth and leadership skills.\n\n2. Website Management\nOversee day-to-day operations of the Shopify Plus platform, focusing on UX and conversion optimization.\nUpload products (SKUs), create engaging product pages, and maintain imagery that reflects our commitment to responsible fashion.\n\n3. Digital Performance Marketing\nImplement and optimize paid campaigns on Google Ads and Meta, aiming to elevate traffic, revenue, and customer acquisition.\nUse SEO best practices to boost organic search visibility.\nOversee affiliate marketing partnerships to expand our brand reach and reinforce our eco-minded identity.\n\n4. Digital Strategy & Campaigns\nOwn the marketing calendar, weaving sustainability themes into promotions, product launches, and brand activations.\nDevelop customer retention strategies to lower acquisition costs and enhance lifetime value.\nUse Klaviyo and Sweet Analytics for segmented CRM campaigns that underscore our ethos and drive loyalty.\n\n5. Trading & Analytics\nMonitor key ecommerce metrics (e.g., revenue, conversion rate, AOV, repeat purchase rate) via Google Analytics and Sweet Analytics.\nPresent performance reports to the Founder and senior team, pinpointing threats and opportunities for growth.\n\n6. International Growth\nEnhance global user experiences and optimize checkout processes using tools like Global-e and Shopify Plus for seamless international expansion.\nAdjust strategies for diverse regions without compromising our consistent, sustainable brand message.\n\n7. Innovation & Development\nIdentify emerging ecommerce tools and technologies that enhance efficiency, improve CX, and strengthen our social-impact mission.\nLead A/B testing and funnel optimizations for improved site navigation and checkout flow.\n\nCandidate Requirements\nHands-on expertise in ecommerce trading, digital marketing, and Shopify Plus (ideally in fashion).\nFamiliarity with Google Ads, Meta (Facebook/Instagram), SEO, affiliate marketing, and CRM platforms like Klaviyo.\nProficient with Google Analytics and reporting tools such as Sweet Analytics.\nAdept at budget management, forecasting, and setting measurable KPIs.\nThrives in a fast-paced environment and embraces a collaborative, “roll-up-your-sleeves” mindset.\nCommitted to sustainable and ethical business practices.\nResourceful, proactive, and ready to experiment.\nManages competing priorities effectively, excelling in a growth-focused setting.\nSkilled at engaging colleagues and external partners, offering clear direction and vision.\nOrganized, detail-oriented, and capable of guiding and inspiring teams.\n\nWhy Join?\nBe part of an ethical fashion brand dedicated to making a genuine, positive impact on communities and the environment.\nLead and innovate across ecommerce and digital channels for a rapidly expanding B Corp.\nCollaborate with a passionate team committed to sustainability, responsibility, and creative growth.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Marketing",
        "industries": "Retail Apparel and Fashion and Fashion Accessories Manufacturing"
    },
    {
        "title": "Learning and Development Manager",
        "company": "JGA Recruitment Group",
        "location": "Greater Guildford Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/learning-and-development-manager-at-jga-recruitment-group-4209831971?position=36&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=8u1Ojlj%2BcUWXTmzdWJWELw%3D%3D",
        "scraped_at": "2025-04-15 19:08:06",
        "description": "Job Title: Learning and Development Lead\nSalary: £65,000 - £70,000\nLocation: Guilford, Greater London.\nHybrid: 2 days per week in office and 3 days WFH.\n\nDirect Reports: Managing a team of 3 direct reports, covering Organisational Capability, Employee Engagement and Learning and Development.\n\nJGA are partnering with a leading food and beverage retail business seeking an employee focussed and culture driven Learning and Development Lead to manage the L&D, Organisational Capability, and Leadership Development team.\n\nIf you have experience in a high volume, multi-sited, customer facing business then we would love to see an application from you! If this doesnt sound like you then please have a look at some of our other positions and feel free to apply.\n\nCore Responsibilities\nDesign and deliver training programs to enhance organizational capabilities.\nCollaborate with global teams to create and maintain relevant training content.\nPartner with stakeholders to identify current and future competency needs.\nManage the Learning Management System (LMS) and ensure course materials are up-to-date.\nBuild strong relationships with employees across various levels and global stakeholders.\nLead the design and management of the Leadership Development Curriculum.\nTrack, report, and evaluate the effectiveness of L&D programs.\nContribute to additional People & Culture projects as needed.\nShape leadership development strategies in partnership with senior leaders.\nOversee the Learning & Development budget.\n\nDesired Skills & Experience\nStrong analytical skills with a data-driven approach to decision-making.\nProven experience in team leadership.\nComfortable working in fast-paced, customer-focused environments.\nBackground in content design and implementation.\nSkills in Learning Management Systems (LMS)\nStrong business partnering and stakeholder management experience.\nPreferred: Experience with eLearning tools, instructional design, and Adobe Creative Suite\n\nPlease note - due to high application volumes, only shortlisted candidates will be contacted within 2 weeks. If you don't hear from us, your application was unsuccessful this time. We thank you for your interest and encourage you to apply for future opportunities.\n\nInterested?\nContact Sam at JGA today!\nsam@jgarecruitment.com\n\nJGA Recruitment Group Ltd (\"We\") are committed to equality of opportunity for all applications regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief, and marriage and civil partnerships. We strongly encourage suitably qualified applicants from a wide range of backgrounds to apply.\nWe are also committed to protecting and respecting your privacy. We are a specialist payroll, HR & Marketing recruitment agency and recruitment business as defined in the Employment Agencies and Employment Businesses Regulations 2003 (our business). These statements together with our privacy notices set out the basis on which any personal data we collect from you, or that you provide to us, will be processed by us.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Human Resources",
        "industries": "Food and Beverage Retail, Hospitality, and Retail"
    },
    {
        "title": "Head of Agency Partnerships",
        "company": "Worldpay",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/head-of-agency-partnerships-at-worldpay-4177523656?position=37&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=8vqxN9hXImsqcNaat6i14Q%3D%3D",
        "scraped_at": "2025-04-15 19:08:08",
        "description": "Head of Agency Partnerships\n\n\nMake your mark at one of the biggest names in payments. With proven technology, we process the largest volume of payments in the world, driving the global economy every day. When you join Worldpay, you join a global community of experts and changemakers, working to reinvent an industry by constantly evolving how we work and making the way millions of people pay easier, every day.\n\n\nAbout the team\n\nWe are seeking a highly experienced and dynamic Head of Ecommerce Agency Partnerships to join our team. This senior role requires a native ecommerce professional with a proven track record in acquiring agency partnerships to enable and grow the adoption of Worldpay’s SMB payment solution (Worldpay eCommerce) among both existing and new customers. The ideal candidate will have extensive contacts within the UK and EMEA eCommerce market and the ability to form strong commercial alliances with leading eCommerce agencies. This role demands proactivity and someone who can hit the ground running to deliver results.\n\n\nWhat you'll own\n\nRefine and execute a strategic plan to build partnerships with leading EMEA ecommerce agencies and to promote Worldpay eCommerce.\nBuild and maintain strong relationships with key decision-makers at leading UK ecommerce agencies.\nDrive the adoption of Worldpay eCommerce solutions among agency partners' existing and new customers through enablement activities supported by Worldpay business partners.\nIdentify and pursue new business opportunities to expand the agency partnership network.\nAchieve referral, reseller targets, and facilitate the enablement of these businesses.\nCollaborate with internal teams to ensure seamless integration and support for agency partners.\nMonitor market trends and competitor activities to inform strategic decisions.\nActively engage in hands-on activities to achieve and exceed sales targets and KPIs related to agency partnerships including co-selling and partner marketing.\nBe a proactive doer, not just a strategic thinker, ensuring the implementation of plans and initiatives.\nDemonstrate strong commercial abilities, including negotiating contracts and managing commercial agreements with agency partners.\n\nWhat you Bring\n\nBachelor's degree in Business, Marketing, or a related field (Master's degree preferred).\nExtensive experience in the ecommerce industry, with a focus on agency partnerships and payment solutions and/or eCommerce technology\nProven track record of acquiring and managing agency relationships.\nStrong network of contacts within the UK ecommerce market.\nExcellent communication, negotiation, and interpersonal skills.\nAbility to work independently and hit the ground running.\nStrategic thinker with strong analytical and problem-solving skills.\nHands-on approach with a focus on execution and delivering results.\n\n\n\nWhat makes a Worldpayer\n\nWhat makes a Worldpayer? It’s simple: Think, Act, Win. We stay curious, always asking the right questions to be better every day, finding creative solutions to simplify the complex. We’re dynamic, every Worldpayer is empowered to make the right decisions for their customers. And we’re determined, always staying open – winning and failing as one.\n\n\nDoes this sound like you? Then you sound like a Worldpayer.\n\n\nApply now to write the next chapter in your career.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Sales, Business Development, and Marketing",
        "industries": "Financial Services"
    },
    {
        "title": "Head of FP&A",
        "company": "We Do Group",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/head-of-fp-a-at-we-do-group-4210618303?position=38&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=inllodVbVKrxlAnt3D18pg%3D%3D",
        "scraped_at": "2025-04-15 19:08:10",
        "description": "Head of FP&A\n\n£80,000 - £85,000 + Benefits & 15% Bonus.\n\nConsumer Product and Retail Business, Central London:\n\nThis is such an exciting role - great people, fun culture, product based and GROWING!!\n\nThis is basically setting up a new FP&A division!!\n\nWe really want an emotionally intelligent, fun and commercial human!\n\nWe are looking for a fun, bright, and people-centric Head of Commercial Finance who is seeking a hands-on and progressive new role. This is a very fast-paced and creative business that is rapidly expanding.\n\nThis is offering the chance to be a key part of their journey and importantly have a massive impact.\n\nRequirements:\nQualified Accountant (ACA or equivalent).\nStrong FP&A experience – reporting through to commercial finance / data.\nAmbitious, strong communicator with a good sense of humour.\nExperience from retail, manufacturing or consumer products industries would be highly advantageous.\n\nBased in London (3 days a week in the office), this role would suit a very commercial and hands-on FP&A leader motivated by raising the profile of commercial finance across the business.\n\nThis is one of the most unique, high-potential, and exciting FP&A roles currently available in London. What makes this role so interesting is the impact you can have on building an innovative function that is data and business partnering-led.\n\nThe Role:\nThis role will be based in Central London, joining an existing team of seven. Reporting directly to the CFO, you will take ownership of all FP&A, Reporting, Commercial Finance, and Business Partnering.\n\nResponsibilities:\nManage the global FP&A function.\nSupport the CFO in driving world-class insights and data across the wider business.\nImplement and build a new KPI and reporting structure.\nDrive analysis around product launches and performance.\nUnderstand sales margins, pricing, and manufacturing costs.\nProvide financial insights to optimise performance in retail, eCommerce, and manufacturing sectors.\nEvaluate and support customer performance analysis.\nUnderstand and apply updated revenue recognition rules.\nCreate a true culture of business partnering.\nBuild all forecasting, planning, and budgeting processes.\nWork with the wider team to ensure rigorous controls and processes are in place.\nSupport in reporting commercial results to key internal and external stakeholders.\nAssist in preparing board packs and glossy accounts.\nReport key numbers and analysis to the board and stock market.\nAdvise the CEO, CTO, and MD on commercial analysis.\nLead a number of key business initiatives and projects.\n\nThis is a varied and challenging role, working alongside a talented CFO and an ambitious leadership team.\n\nYour Profile:\n\nWe are looking for an innovative commercial leader who is passionate about all aspects of FP&A and Business Partnering. Being able to work in London three days a week is critical.\n\nWhile we are sector-agnostic, experience in FMCG, Consumer Products or related industries would be particularly valuable.\n\nThe ideal candidate will have a strong understanding of supply chains, product margins, pricing strategies, and customer trends, with a proven ability to apply these insights in a high-growth environment.\n\nBenefits:\n\n£80,000 - £85,000 + Benefits.\n\nPlease apply to find out more, or connect with Patrick McCubbin on LinkedIn:\nhttps://www.linkedin.com/in/patrickmccubbin/\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing, Analyst, and Finance",
        "industries": "Food and Beverage Retail and Food and Beverage Manufacturing"
    },
    {
        "title": "Operations Support",
        "company": "Anson McCade",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/operations-support-at-anson-mccade-4209694052?position=39&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=e3JHbNR9RV5b95%2FxBjbI7w%3D%3D",
        "scraped_at": "2025-04-15 19:08:12",
        "description": "Operations Support Analyst\nLocation: London (Hybrid)\nSalary: Up to £55k\nBenefits: Performance Bonus, Significant Pension Scheme, Private Medical Cover & more.\n\nAbout the Role\nThis is your opportunity to join a FTSE 100 global technology group that’s delivering consecutive years of growth while making the world a safer, cleaner, and healthier place. Our client works on life-changing projects across health, safety, and environmental sectors — and is looking for an Operations Support Analyst to join its digitally-driven transformation journey.\n\nAs part of a dynamic operations team, you'll take ownership of the operations stream across enterprise systems and play a key role in driving process improvements, managing stakeholders, and enhancing service delivery.\n\nWhat You’ll Do\nOwn the day-to-day operational support across core enterprise platforms (HR, Finance, ERP, integrations)\nCollaborate with internal and external stakeholders globally, managing escalations and communication flows\nOptimise service performance using tools like Power BI and Excel\nDrive continuous improvement initiatives and support the product roadmap\nBuild strong vendor relationships and help uphold service standards\n\nWhat You’ll Bring\n2–3 years of experience in enterprise IT operations, ideally in a global setting\nProven ability to manage stakeholder expectations and escalations\nConfident with service operations, performance reporting, and process analysis\nBackground in supporting business systems such as ERP, HR, or Finance platforms\nITIL or Lean/Six Sigma exposure (desirable but not essential)\n\nWhat’s in It for You?\nJoin a company that’s not just growing, but leading positive change through innovation. They offer real progression opportunities — whether that’s toward Operations Management, Architecture, or the Project/BA route.\n\nAbout the Company\nOur client is a global group of life-saving technology companies. As one of the UK’s top-performing FTSE 100 businesses, it is renowned for steady growth and sustainable impact. With a footprint across 40+ operating companies worldwide, they are committed to tackling some of the most pressing challenges in health, safety, and the environment through cutting-edge innovation.\n\nBe part of something bigger. Apply today.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology and Project Management",
        "industries": "IT System Operations and Maintenance, Medical Equipment Manufacturing, and Industrial Machinery Manufacturing"
    },
    {
        "title": "Group Financial Controller",
        "company": "SF Executive",
        "location": "Northamptonshire, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/group-financial-controller-at-sf-executive-4208404929?position=40&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=62GHm%2BPjxh%2Fm2Ha%2BHEDJHg%3D%3D",
        "scraped_at": "2025-04-15 19:08:13",
        "description": "SF Executive are partnered with a Northamptonshire based, private equity backed service business who are seeking a Group Financial Controller. Reporting directly to the CFO, this is a critical role in the development of the business as it continues to scale. This role requires a motivated individual as it provides an ideal opportunity to grow with the business.\n\nThe Group Financial Controller will be responsible for the development and maintenance of the financial control environment including all finance operational processes and development of business systems.\n\nThe key responsibilities for this position include:\n• Group consolidation\n• Finance and operational systems\n• Treasury/ cash management\n• Cash forecasting\n• Taxation\n• Billing/ credit control/ purchase ledger\n• Integration of new acquisitions\n• Governance\n• Maintaining a clean audit report\n• Supporting commercial teams on margin improvement plans\n\nThis role is being offered on a hybrid basis consisting of 4 days in the office with and adult approach to flexibility.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Finance",
        "industries": "Wholesale"
    },
    {
        "title": "Product Manager",
        "company": "Burns Sheehan",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/product-manager-at-burns-sheehan-4210628888?position=41&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=ildz7ypV7bzwunf%2FX%2FBoeg%3D%3D",
        "scraped_at": "2025-04-15 19:08:15",
        "description": "🚀🛠️ Product Manager | Eco-Friendly Scale-Up | Ops-Focused 🛠️🚀\n\nRole: Product Manager\nLocation: Aldgate, London (On-Site)\nSalary: up to £75,000\n\nReady to own a product domain at a rapidly growing, eco-conscious scale-up? 💚 Want to play a key role in streamlining operations and boosting performance across the board? This could be your next big move! 👀\n\nThis green-minded, on-demand vehicle subscription buisiness has been shaking things up for 10 years 🚗⚡—and with $100m+ in funding under their belt, they’re not slowing down anytime soon. They’re expanding fast and need a Product Manager who’s all about smart systems, smooth ops, and scaling success 📈\n\n🔍 What’s the role?\nYou’ll own a major product area—think onboarding, CRM, ERP, or subscription management—playing a key part in how the business runs. You’ll help shape the roadmap, optimise internal tools, and make life easier for teams across the company.\n\n🧠 What they need from you:\nExperience as a Product Manager in a tech-first environment\nBackground with ops-centric tools: onboarding flows, CRM, ERP, or subscription management\nObsessed with processes, efficiencies, and making things just work 🔧\n\n🤝 What’s in it for you?\n🌟 Full ownership of a high-impact product line\n📅 Quarterly & annual goals to help you shine\n🧠 Work with a brilliant team of engineers, designers, and ops pros\n🌍 Be part of a mission-led company shaping the future of urban transport\n\nIf you think this sounds like you, and would like to learn more about the company and the role please get in touch!📧☎️\n\n🚀🛠️ Product Manager | Eco-Friendly Scale-Up | Ops-Focused 🛠️🚀\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Product Management",
        "industries": "Technology, Information and Media"
    },
    {
        "title": "Vice President, M&A Boutique, Business Services",
        "company": "Walker Hamill",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/vice-president-m-a-boutique-business-services-at-walker-hamill-4207353045?position=42&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=vvQxWSDi8takDHLgq2zh1Q%3D%3D",
        "scraped_at": "2025-04-15 19:08:16",
        "description": "REF: PA53533\nJob Title: Vice President, Business Services\nIndustry: Global Investment Bank\nEmployment Type: Permanent\nLocation: London\nSalary Guide: £140,000 - £160,000 + Bonus\n\nOur client is an established global investment bank with strong coverage across both publicly traded and privately owned companies. The business services team is highly experienced with an outstanding reputation and strong track record in the space, leveraging a network formed over many years. After a successful 2024, the team are looking to add a VP to build on a strong pipeline for 2025.\n\nDescription\nYou will work closely with experienced Managing Directors supported by a team of Associates and a growing team of Analysts. Working in a diverse sector across five key verticals (Commercial & Industrial Services, Professional & Human Capital Services, Information Services, Technology & Education Services and Distribution) advising both business owners and senior executives on buy/sell side mergers & acquisitions, refinancing, capital raises and related activities.\n\nSkills\nThe successful candidate for this Vice President role will currently be working at VP level in a global or boutique investment bank, or corporate finance advisory firm. You will have a strong track record in midmarket deals in business services space or related sectors. The ability to build relationships both internally across the firm and externally with business leaders will be vital to success. A balance of strong technical skills and soft interpersonal skills are required to further your growth in an impressive team.\n\nApply\nTo apply for this Vice President role, please use the Apply button.\n\nPlease note that due to the expected volume of applications, we will only be able to respond to those candidates whose experience matches the requirements of our client. We are sorry, but if you have not heard from us within the next ten days, please assume you have been unsuccessful on this occasion.\n\nWalker Hamill has been a specialist accountancy, strategy, private equity and M&A recruiter for over 30 years. We have an extensive client group, including major multinational listed organisations, investment banks, corporate finance advisors, private equity backed businesses and privately owned companies. We recruit across all sectors and have particularly strong client relationships in FMCG, media, retail, pharma/biotech, technology, property/real estate, leisure and business services. Headquartered in London, we have additional offices in continental Europe.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Finance",
        "industries": "Investment Banking"
    },
    {
        "title": "Senior Product Manager",
        "company": "i3",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-product-manager-at-i3-4207381895?position=43&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=IvKgQRGpRmbOA3xvFoiewA%3D%3D",
        "scraped_at": "2025-04-15 19:08:18",
        "description": "SENIOR CLAIMS PRODUCT MANAGER\nInsurance Claims Systems Product Owner / Product Manager\nPermanent\nLondon\nc£100,000 + Bonus + Bens\nMUST HAVE\nProven track record in working with a Claims function\n\nSenior PO role; requires extensive and in-depth Global Claims Systems experience - Operating in an AGILE environment.\nWorking for a very prestigious Global Insurance Carrier.\nBe responsible for implementing, maintaining and championing Claims systems, working closely with the global Claims teams. This role will initially focus on continuing the implementation of the Reinsurance Claims system and several priority initiatives while working with Technology and Operations Business Agility Lead.\nKey Responsibilities\nManages Claims products for the organisation\nThe main point of contact for the Claims Team for support of and requests for new technical services and products\nCollaborates with Business Agility Product Owners and stakeholders to contribute to the development of the program vision.\nWith the team, accountable for developing and achieving product level KPIs. Manages product(s) with a moderate degree of strategy, scope, and complexity.\nOwns and maintains the technical product backlog and is accountable for its contents and prioritisation.\nAccountable for clear, actionable user stories.\nSets priorities and actively participates in squad/team quarterly planning.\nSets expectations with stakeholders for delivery of new capabilities, features, and functionalities. Participates in team demos, retrospectives, and all other ceremonies.\nWorks daily with the agile working group, clarifying business requirements, removing roadblocks, constantly communicating, and supporting alignment around product strategy.\nCollaborates with technology and business leadership to align development and business goals and priorities\nwhile working with stakeholders and squad/team to remove roadblocks to execution. Resolves open issues/questions quickly and efficiently.\nreports on feasibility, cost of delay ramifications, economies, or other aspects of planned or potential changes to the product.\nregulatory, compliance, and other industry constraints on the product\nensure priorities are aligned across squads/teams both within and outside the portfolio.\nbuilds the squad/team product roadmap\ncontributes to strategy inputs from stakeholders.\nContributes to program level planning.\nInfluences stakeholder expectations\nLeads customer-driven design and usability testing for the squad/team\nAssists the technical team with testing, user research, UX etc\nSupports the Scrum Master\nSkills and Experience\ntrack record in working with a Claims function\nexperience in insurance\ncommunication and collaboration skills\nAgile\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development, Product Management, and Information Technology",
        "industries": "Insurance and Professional Services"
    },
    {
        "title": "Performance Marketing Executive",
        "company": "Propel",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/performance-marketing-executive-at-propel-4209812404?position=44&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=L09huaV9moPtUb1hvC9Wiw%3D%3D",
        "scraped_at": "2025-04-15 19:08:19",
        "description": "Senior Performance Marketing Executive – B2C Fintech Scaleup 🚀\n\nPropel is excited to be working with a high-growth B2C fintech scaleup that’s transforming how people manage their finances. Backed by strong investment and built around a mobile-first product, this business is making serious noise in the industry.\n\nWhat you’ll be doing:\n\nSupport the planning and execution of paid media campaigns across channels like social, PPC, YouTube, and more.\nOptimise performance across channels, focusing on customer acquisition and ROI.\nAssist in A/B testing, landing page improvements, and conversion rate optimisation.\nWork with GA4, GTM, and other analytics platforms to track, report, and improve performance.\nPartner with internal teams and agencies to ensure alignment with wider growth and brand goals.\nStay up to date on trends in paid social, performance marketing, and fintech.\n\nWhat they’re looking for:\n\nAround 2+ years’ experience in digital or performance marketing, ideally in a B2C or fintech setting.\nHands-on experience with paid media channels, PPC, and basic SEO knowledge.\nData-driven mindset with a keen interest in testing and optimisation.\nFamiliarity with tools like GA4, Looker, or similar analytics platforms.\nProactive, collaborative, and eager to learn and grow in a fast-paced environment.\n\n📍 Location: Central London – 4 days in-office\n\nIf this sounds like you (or someone great in your network), apply today or send your CV to hope.smithers@propellondon.com ✨\n\nSenior Performance Marketing Executive – B2C Fintech Scaleup 🚀\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Marketing",
        "industries": "Financial Services"
    },
    {
        "title": "Enterprise Application Lead",
        "company": "Versende Ltd",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/enterprise-application-lead-at-versende-ltd-4177545562?position=45&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=F150I5BUUaakMUkuXNOBMA%3D%3D",
        "scraped_at": "2025-04-15 19:08:21",
        "description": "Job Title: Enterprise Application Lead\nJob ID: 07896\nSalary: £55-75k (15% bonus)\nLocation: Hybrid – Enfield & Home Based (Minimum 2 days in the office a week)\nJob Type: Permanent\nIndustry: FMCG\n\nThe Client\nWe are working with a fast-paced and innovative FMCG company, producing high-quality consumer products enjoyed by people everywhere. With a strong commitment to excellence and continuous improvement, we’re investing in cutting-edge digital and technology solutions to drive our business forward.\n\nThe Role\nAs the Enterprise Application Lead, you will be responsible for managing and evolving the IT enterprise systems to support both short- and long-term business needs. You’ll lead a dynamic team across IT Applications and IT Project Management, working closely with senior stakeholders to shape the future of technology within our business.\n\nKey Responsibilities:\n✅ Lead the development and implementation of enterprise applications to meet business objectives\n✅ Manage vendor relationships and oversee service levels\n✅ Plan and deliver system upgrades, migrations, and new deployments\n✅ Capture insights from stakeholders to inform future IT strategy\n✅ Define change management and communication strategies for system initiatives\n✅ Resolve technical issues, minimize downtime, and ensure business continuity\n✅ Oversee IT governance, GDPR compliance, and security best practices\n✅ Lead, mentor, and develop a high-performing IT team\n\nWhat We’re Looking For:\n✔ Experience in a technology leadership role, managing enterprise applications and teams\n✔ Strong background in enterprise operations, software development, and cloud computing\n✔ Excellent project management skills, with the ability to juggle multiple initiatives\n✔ Strong communication and stakeholder management abilities\n✔ Certifications in project management, IT governance, or cloud platforms (e.g., PMP, ITIL, AWS, Azure) are a plus\n\nThis is a fantastic opportunity to shape the future of IT in a leading FMCG business. If you’re passionate about driving digital transformation, we’d love to hear from you!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Food and Beverage Services"
    },
    {
        "title": "Finance Business Partner",
        "company": "Goodman Masson",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/finance-business-partner-at-goodman-masson-4187777936?position=46&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=becLxcqdc8a5rrzZTq1e8Q%3D%3D",
        "scraped_at": "2025-04-15 19:08:23",
        "description": "Renewable Energy - Finance Business Partner - 60-70k\n\nMy client a Multi-National & listed Renewable Energy Developer is looking for a Finance Business Partner to join their rapidly growing Team of 24.\n\nIdeally, I am looking for a qualified accountant (ACA /CIMA/ACCA) who has extensive experience in commercial finance. Experience with energy, construction and infrastructure would be a significant advantage.\n\nThe role will offer a clear route to Commercial Finance manager in the next 18 months and will take on reports as the role develops.\n\nThe role has 3 core responsibilities:\n\n•Firstly, the individual would take ownership of the company’s business plan/financial strategy, ensuring the forecast and budget is updated. Developing the models to include all new business, tenders, and Bids.\n\n•Secondly, the candidate will be expected to business partner with a wide range of operational stakeholders (this will include engineers, surveyors, and product development) providing financial analysis as required; identifying trends and opportunities to improve efficiency, generate revenue as well as reduce/control cost\n\n•Thirdly, the individual will support the operational/sales teams with pricing. This will include analyzing the viability of new products/contracts from an opportunity, strategic, pricing, and enterprise risk perspective\n\nThe salary on offer is £60-70k, with a discretionary bonus, and a leading benefits package.\n\nThe role is based in central London requiring one day in four days from home (with travel once a month to operational sites - expenses paid for)\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Consulting",
        "industries": "Accounting and Services for Renewable Energy"
    },
    {
        "title": "Senior Business Analyst",
        "company": "Bruin",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-bruin-4207352081?position=47&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=ff1gwhlzBSqEDfCkyaG4Jw%3D%3D",
        "scraped_at": "2025-04-15 19:08:24",
        "description": "A boutique alternative investments firm based in London, require a Senior Business Analyst / Systems Analyst to join their investments project team on a permanent basis.\n\nThe business are private markets / assets focused and the project teams manages all of the change and transformation initiatives across their technology. They have a suite of alternative investment specific applications that this team support from an implementation and upgrade perspective.\n\nThe current major programmes are centered around data transformation, new systems roll outs and target operation model design/implementation.\n\nThe ideal candidate will have:\n\ngood experience across Private Markets / Assets, Private Credit, Private Debt or Private Equity change and transformation - ESSENTIAL\nexcellent business analysis skills and experience gained working on investment systems or projects.\ngood project management and relationship management skills.\ngood technical skills around SQL, ETL, business intelligence and data transformation.\nexperience upgrading or implementing new systems / applications\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Information Technology, and Project Management",
        "industries": "Investment Management and Financial Services"
    },
    {
        "title": "Project Manager",
        "company": "Falcon Green",
        "location": "Epsom, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/project-manager-at-falcon-green-4188012279?position=48&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=UuA8sYfld0w42LMleuZ%2FsQ%3D%3D",
        "scraped_at": "2025-04-15 19:08:26",
        "description": "Main contractor seeking experienced Project Manager to manage and successfully deliver a recently won project in Surrey. You will be leading the delivery of a £40M new build care home from inception to handover. This job involves delivery of 112 homes. A trade background is preferred.\n\nKey Responsibilities\nResponsibility for ensuring the project is completed on time, within budget and to the highest quality and safety standards.\nKey liaison with Client, ensuring Client is regularly updated.\nInstruct, coach and direct the project staff with respect to construction, contractual and regulatory requirements.\nEffective management and co-ordination of subcontractors and ensure all personnel on site conduct their duties to the highest standards.\nManage day to day operational duties.\nContinually improve operations, decrease turnaround times, streamline work processes, and work cooperatively and jointly to provide quality seamless customer service.\nDevelop and deliver progress reports, analyse results and troubleshoot problem areas.\nBuild, grow and develop business relationships for the success of the project\nProvide feedback and record information from the project for ‘lessons learnt seminars’ and for continuous staff development.\n\nQualifications & Experience\nQualification in a trade, construction, or site management\nMinimum 5 years’ experience in Project Manager role with main contractor\nSMSTS, First Aid and CSCS Card required.\nProven track record of successful delivery of large-scale residential projects\nStrong commercial awareness and cost control ability with a proven track record in construction planning.\nTechnical competence with the ability to set and track project milestones and deliverables.\nExtensive experience in leading and directing project teams and effectively managing sub-contractors.\nThorough knowledge of health & safety policies and procedures\nKnowledge and ability to use MS Office, MS Project/Powerproject etc..\n\nIf you are well suited to this role, please apply through the link and we will contact you for a confidential discussion.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management and Management",
        "industries": "Construction and Building Construction"
    },
    {
        "title": "Head of Finance",
        "company": "SRM Recruitment",
        "location": "Milton Keynes, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/head-of-finance-at-srm-recruitment-4208066244?position=49&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=EcpFehunawE0Czz3iDpobA%3D%3D",
        "scraped_at": "2025-04-15 19:08:27",
        "description": "An excellent commercial Head of Finance opportunity has arisen with one of the UK's most successful property developers based in Milton Keynes. A FTSE 100 and entrepreneurial business, our client has an excellent reputation for valuing the strategic input from the finance team, leading to long term career paths within the business.\n\nReporting to the Divisional Finance Director, key responsibilities will include:\n\n▪ Coordination and review of management information reporting packs and Board Packs;\n▪ Have a detailed understanding of, and driving the business to hit, a range of project and corporate forecasts and targets;\n▪ Managing the consolidation and presentation of monthly profit and cashflow forecast;\n▪ Responsibility for controlling the project balance sheet, establishing a detailed understanding of work in progress, sales deposits, and accounting provisions for the development.\n▪ Develop the business plan for the project with other functional heads within the division and ensuring it is aligned to the Group’s strategic objectives.\n▪ Ownership of the budget and forecast for the projects, ensuring it is accurate and well managed, and ultimately delivering it.\n▪ Lead and manage the project finance team and ensure accuracy, quality and efficiency are maximised.\n▪ Manage the interim and year end process with external auditors through to sign off for the division.\n▪ Oversee all month end processes for the projects and timely delivery of management information to both the divisional management team.\n\n\nApplicants must be:\nACA, ACCA or CA Qualified (or overseas equivalent) with at least 5 years PQE\nEducated to degree level with good academic track record\nBe confident communicator, capable of making numbers meaningful to commercial non finance stakeholders.\nEnjoy working in an entrepreneurial environment, across different business functions.\n\nSalary Guide £90,000 - £100,000 + Car Allowance & Bonus per annum,\n\nIf you have not received feedback within 7 working days after applying, please assume your application has been unsuccessful.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Finance",
        "industries": "Construction"
    },
    {
        "title": "Compliance Officer",
        "company": "Rev & Regs",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/compliance-officer-at-rev-regs-4209859041?position=50&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=dQio%2FHOwFNZO%2FVEKZ424sA%3D%3D",
        "scraped_at": "2025-04-15 19:08:29",
        "description": "Rev & Regs are recruiting for a Compliance Officer for a UK Challenger Bank (Lending/Finance/Savings).\n\nThis is a generalist compliance role which will undertake monitoring reviews (including thematic reviews), provide regulatory advice and guidance, develop policies and procedures, and keep abreast of new regulatory changes (horizon scanning).\n\nResponsibilities:\n\nDelivery and completion of thematic reviews as part of the Bank’s Annual Compliance Monitoring Plan.\nDelivery of second line quality assurance reviews. Assessing the strength of a range of first line controls.\nArticulating clear and accurate feedback on second line Thematic and Assurance Reviews.\nProviding regulatory advice and guidance. Answering Risk and Compliance queries.\nReview and development of policies and procedures.\nSupporting the closure of Compliance owned Corrective Action Plans, off the back of Thematic reviews.\nSupport the creation and publication of monthly reporting to relevant Committees.\nProactive horizon scanning, keeping the Risk and Compliance Team and wider business up to date on all regulatory changes.\nContribute to the 2LoD oversight of key projects and programmes\n\nExperience:\n\nGood knowledge and experience of regulatory responsibilities within Banking/Lending/Finance.\nDemonstrable experience of Thematic Review Report writing.\nExperience of quality assurance testing.\nAn ability to self-teach and conduct research into FCA and PRA regulatory requirements.\nExperience of a PRA and FCA regulated environment\nKnowledge of FCA Handbook: COBS, TCF/Consumer Duty, Conduct Risk.\nA relevant professional qualification (e.g. ICA, IRM) - Preferable.\n\n\nLocation: Hybrid (2/3 & 3/2 every other week) - London, City.\nSalary: £65,000 pa + bonus + benefits package\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing, Legal, and Quality Assurance",
        "industries": "Banking and Financial Services"
    },
    {
        "title": "Associate Interior Designer",
        "company": "Jak Consultancy",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/associate-interior-designer-at-jak-consultancy-4209819658?position=51&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=EMmQ7YQMxqS9SX4MD329Gw%3D%3D",
        "scraped_at": "2025-04-15 19:08:31",
        "description": "Job Title: Senior Associate Interior Designer - Workplace Interior Design\nLocation: London (or remote to London)\nSalary Range: £80,000 - £100,000 per annum\nAbout Us:\nOur client is a dynamic and innovative global design firm specialising in workplace interior design. With a presence in Australia they have established themselves as leaders in delivering exceptional design solutions.\nWe are seeking an experienced, self-motivated, and creative yet practical Senior Associate Designer to join the team in London. Whether working at the vibrant London office or remotely, you will collaborate with the EMEA client services and Project Management (PM) team. The EMEA team is frequently on the move, managing and overseeing projects across Europe, providing an exciting and dynamic work environment.\nResponsibilities:\nAs the Senior Associate Designer, you will report directly to the Global Design Director and play a crucial role within our global workplace design team. Your responsibilities will include:\nCollaborating with the Client Services team to understand client needs and contribute to new business development opportunities.\nEstablishing effective relationships with clients, stakeholders, and internal colleagues to develop comprehensive design briefs.\nGenerating and managing design timelines within overall project master programs, coordinating with Project Managers and communicating changes to clients.\nCreating conceptual and design development presentations using various graphic techniques, including space planning and 3D visuals.\nConducting design reviews, presenting concepts to team members, and performing cost analysis.\nPreparing technical documentation, including written specifications, tender, and construction documents.\nStaying abreast of global workplace strategy and design trends, ensuring designs comply with applicable building codes and spatial standards.\nSourcing materials, equipment, and furniture specifications to meet design, program, and budget parameters.\nAttending project and site meetings, coordinating with consultants throughout the design and delivery phases.\nProblem-solving design and buildability issues while maintaining the original design intent.\nAssisting in developing project-related collateral for marketing or pitch purposes, including layouts, 3D visuals, diagrams, and data.\nAd hoc travel for site inspections and client meetings.\n\nAbout the Role:\nIn this role, you will be an integral part of the global design team, contributing your expertise to create innovative and globally relevant interior designs. Your proximity to the EMEA client services and PM team, either at the London office or remotely, will allow for seamless collaboration and engagement in all project phases.\nRequirements:\nThe successful candidate will possess:\nAt least 11 years' experience in workplace interior design.\nProven ability to establish effective relationships with clients, stakeholders, and colleagues.\nExperience in developing new business opportunities to support the Client Services team.\nStrong communication and interpersonal skills.\nProject planning, leadership, organizational, and problem-solving skills.\nExperience in managing other designers and specialist design support throughout projects.\nAmbition to provide high-quality, globally relevant workplace strategy and interior design.\nA balanced approach to quality, timing, and budget considerations.\nAcute attention to detail when reviewing own and checking others' work.\nProficient use of SketchUp, AutoCAD Architecture, and the Adobe Suite of products.\nExperience in space planning, conceptual design development, and technical documentation.\nPrior involvement in all design stages of projects from feasibility through to construction.\nClear understanding of the project delivery process and ability to collaborate with consultants while maintaining the conceptual design intent.\n\nAbout You:\nWe are looking for a hands-on interior designer with a practical yet creative approach. Your ability to work independently or as part of a geographically diverse team, coupled with a keen eye for detail and strong problem-solving skills, will make you an ideal candidate for this role.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Design",
        "industries": "Design Services and Construction"
    },
    {
        "title": "Financial Controller | PE Backed",
        "company": "Goodman Masson",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/financial-controller-pe-backed-at-goodman-masson-4208077092?position=52&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=JAOpvojpFMDaZkVGpiW%2Buw%3D%3D",
        "scraped_at": "2025-04-15 19:08:32",
        "description": "Financial Controller | London | PE-Backed Media-Tech | £80,000 – £90,000 + Excellent Bonus & Benefits\n\nGoodman Masson is exclusively partnering with a high-growth, PE-backed media-tech business to hire a talented Financial Controller. This is a rare opportunity to join a fast-scaling, highly profitable company where you’ll take a lead role in shaping the finance function during a critical phase of expansion.\n\nReporting directly to the Finance Director, you’ll manage a team of five across financial & management reporting, FP&A, and audit. This is a broad, hands-on role with real influence – ideal for someone who thrives in dynamic environments and wants to make change.\n\nWhy this role?\nLead the UK P&L in a fast-growing PE-backed business\nBroad scope: own everything from reporting to commercial\nStrong leadership exposure, reporting to a forward-thinking Finance Director\nOpportunity to build, improve and transform systems & processes\nHybrid model – based in Central London, with flexibility\n\nKey Responsibilities:\nLead delivery of statutory and management accounts (P&L, balance sheet, cash flow)\nOversee financial reporting, tax, audit, treasury, and internal controls\nDrive finance transformation, improving systems, processes, and controls\nManage FP&A processes\nMaintain cash flow visibility and support working capital management\nLead on VAT submissions and tax compliance\nProvide strategic business partnering to divisional leaders and non-finance teams\nBe a key driver of financial discipline and control across the business\n\nAbout You:\nQualified Accountant (ACA / ACCA / CIMA) with experience in a similar role\nA hands-on leader with strong technical background\nPrior experience in a high-growth, fast-paced environment (ideally PE-backed but not a requirement)\nExcellent Excel skills (Pivot Tables, VLOOKUPs, complex formulas)\nStrong communicator who can build trust across finance and non-finance\nA natural problem solver – proactive, solutions-driven and process-focused\n\nPlease apply for further details.\n\nFinancial Controller | London | PE-Backed Media-Tech | £80,000 – £90,000 + Excellent Bonus & Benefits\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Finance",
        "industries": "Market Research, Advertising Services, and Technology, Information and Media"
    },
    {
        "title": "Financial Controller",
        "company": "Camino Search",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/financial-controller-at-camino-search-4209849659?position=53&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=5oiQ4owmgO8CcG0S8a4PNg%3D%3D",
        "scraped_at": "2025-04-15 19:08:34",
        "description": "We are thrilled to collaborate with a well-established, private equity-backed SaaS business. The company has experienced remarkable growth both nationally and internationally, securing a strong market presence. With huge recent investment, they are expanding organically and through acquisitions. As part of this growth, they are seeking a Financial Controller to join their team and work closely with the global business.\n\nWe are looking for an individual who will drive transformation and ensure robust financial control across the organization. This role involves close collaboration with the senior leadership team and leading an established finance function. This position offers extensive exposure across the finance function and key external stakeholders.\n\nKey Responsibilities:\nOverseeing the monthly reporting cycle for the UK and US entities, including consolidation, controls, and processes.\nLeading the monthly consolidation process across multiple entities and currencies.\nManaging budgeting and forecasting.\nProviding oversight of monthly management accounts.\nDriving the implementation and enhancement of financial controls and systems.\n\nEssential Requirements:\nACA / ACCA / CIMA qualified.\nExperience working within a SaaS environment.\nExperience working with US sales taxes.\nNetsuite experience\n\nWhats in it for you?\nCompetitive Salary\nHybrid working model\nTravel abroad for work\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Accounting/Auditing and Finance",
        "industries": "Software Development and IT System Custom Software Development"
    },
    {
        "title": "Service Operations Manager - Private Equity",
        "company": "Cornwallis Elt",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/service-operations-manager-private-equity-at-cornwallis-elt-4207359344?position=54&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=VKwQ%2BU1w2t4vTUDSDlLTSw%3D%3D",
        "scraped_at": "2025-04-15 19:08:35",
        "description": "Service Operations Manager - Private Equity\nCirca £75,000\nHybrid Working/London\nOur client, a boutique asset manager, is seeking a hands-on Service Delivery Manager. This is a brand-new role within the business as they look to build out the service operations team in-house.\n\nThe successful candidate will manage support processes, and work with third-party vendors and the business to improve service quality. They will also play a key role in shaping IT strategy and driving continuous improvement across the department.\n\nKey requirements:\nPrevious experience establishing or maturing ITSM capabilities\nExperience with ServiceNow\nSolid skills and knowledge of Microsoft technology stack, security and collaboration technologies\nPrivate Markets experience is essential\n\nThis is an exciting opportunity to join a growing business and help establish an in-house service operations team.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Investment Management and Venture Capital and Private Equity Principals"
    },
    {
        "title": "Finance Business Partner",
        "company": "Stanton House",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/finance-business-partner-at-stanton-house-4207339888?position=55&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=8GJaBLTwrqb0KEpu4paITQ%3D%3D",
        "scraped_at": "2025-04-15 19:08:37",
        "description": "Finance Business Partner (Tech&Product) – Payments / Fintech (Large Cap- exit in 2 years)\nUp to £90,000 + bonus\nLondon based (Hybrid working) With occasional travel internationally\n\nA rapidly growing FinTech organisation is seeking a Finance Business Partner to support its Technology and Product functions. The business delivers accessible, cutting-edge payment solutions to empower companies of all sizes, and is focused on innovation, scalability, and long-term value creation.\n\nThis role sits at the intersection of Finance and Technology/Product teams, providing commercial insight and strategic financial support to drive performance and optimise investment across platforms and development initiatives.\n\nKey Responsibilities\n\nLead the financial planning process for the Technology and Product teams, including the development of budgets and forecasts.\nWork closely with senior stakeholders, including the CTO, CPO, and CEO, to align financial plans with product and tech roadmaps.\nMonitor performance against budget, providing variance analysis and recommendations to inform future planning cycles.\nDeliver timely and insightful management reporting across Technology and Product spend, including capital and operational expenditure.\nTrack key metrics such as development velocity, product delivery timelines, and ROI on tech investments.\nSupport improved consistency, clarity, and transparency in reporting to enable strategic decision-making at senior levels.\nAnalyse cost drivers and KPIs within Technology and Product functions to support effective resource allocation and performance improvement.\nBuild and maintain detailed financial models to evaluate different scenarios relating to product development, platform enhancements, or infrastructure investments.\nCollaborate with department leads to ensure financial metrics are well understood and linked to business outcomes.\nProvide strategic financial guidance on technology investments, vendor agreements, R&D initiatives, and build vs buy decisions.\nContribute to long-term planning around product innovation, digital transformation, and tech scalability, ensuring financial sustainability.\nProvide ad-hoc financial insights and support to Tech, Product, and cross-functional leadership teams.\nConduct industry benchmarking and analysis to inform product investment decisions and identify areas for competitive advantage.\nPartner with teams across Finance, including FP&A, treasury, and accounting, to ensure accurate financial data and reporting.\nBuild strong working relationships with technical and product stakeholders, acting as a commercial advisor and liaison between Finance and operational functions.\n\nAbout You:\n\nFluent English, with excellent communication and interpersonal skills.\nStrong financial modelling and analytical capability, able to interpret complex data and draw meaningful conclusions.\nA degree in Finance, Economics, Engineering, or a related field; qualifications such as CIMA, ACCA or CFA are a distinct advantage.\nAt least 4 years’ experience in a finance business partnering, FP&A, or commercial finance role – ideally with exposure to technology or product-led environments.\nSolid understanding of capitalisation of development costs, software lifecycle, and tech investment evaluation.\nExperience supporting R&D, SaaS metrics, or Agile delivery models is beneficial.\nAbility to influence stakeholders and challenge constructively within cross-functional settings.\nProficiency in Excel, PowerPoint and financial planning systems.\nA proactive, analytical mindset with strong attention to detail and a passion for supporting innovation through sound financial management.\n\nThis role is ideal for someone looking to make a strategic impact in a technology-driven business, playing a key role in shaping the future of digital product delivery through financial leadership.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Finance, and Strategy/Planning",
        "industries": "Venture Capital and Private Equity Principals, Banking, and Financial Services"
    },
    {
        "title": "Head of Sales - Education",
        "company": "Connecting Education",
        "location": "Greater Bristol Area, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/head-of-sales-education-at-connecting-education-4210593521?position=56&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=C82p0fqky4ucMitjxYV71A%3D%3D",
        "scraped_at": "2025-04-15 19:08:39",
        "description": "Are you a successful senior sales manager looking to take a step up? Experienced in the education/training sector? Super driven and want to achieve growth? This might be the role for you!\n\n\nThe company\nOur client is a DfE-accredited, Ofsted-outstanding training company providing apprenticeships, professional development and the DfE’s ‘Golden Thread’ (trainee teachers to school Executive Leaders).\n\nThe company strongly believes that every child should benefit from an excellent education regardless of their background. To achieve that, they support and train the educational professionals who work alongside them to be the best they can be, so in turn, they can transform the lives of children and young people.\n\n\nThe role\nThe company is looking for an experienced sales professional to step into the Head of Sales role. In this role, you’ll be responsible for recruiting, training, and overseeing the performance of multiple teams to hit the company's annual targets.\n\nAdditionally, you will develop and implement effective sales strategies. You will need to be comfortable setting monthly and Quarterly sales targets and effectively driving the teams to achieve.\n\nResponsibilities include:\nBuild highly effective relationships with both internal and external stakeholders.\nStay informed about company policies and recruitment strategies.\nIdentify opportunities for process improvements and enhanced approaches.\nUtilize Excel, Power BI, CCRM, and SPIRIT to create meaningful reports and data that support the department and highlight our status to stakeholders, including Senior Leadership Team (SLT) members.\nCollaborate with marketing and partnership teams to proactively seek new partner organizations and opportunities, expanding the program's offerings.\n\n\nThe package\n£60,000-65,000 base salary\nRealistic bonus of up to £25,000 per annum\n28 days holiday and get an extra day for each year you stay with us, up to max 33 days PLUS bank holidays\nHealthcare Plan, which includes access to a private GP\nFrom day 1, free life insurance covering up to x4 your salary\nCompany pension\nGet 25% off online learning resources for year 1 to GCSE with EdPlace\nChoose what flexible benefits you want after you’ve passed probation – this could be buying extra holiday, dental, topping up your healthcare plan, bikes, gym membership, electric cars and give as you earn\n\n\nTo be successful, you’ll have…\nProven track record of managing the sales process from planning to closing\nExperienced in identifying, recruiting, and hiring talented salespeople\nProven experience in sales, recruitment, or apprenticeships\nKnowledge of apprenticeships\nAbility to communicate, inspire, and motivate others\nProfessional demeanour\nAbility to work well under pressure and effectively address issues as they arise\nOpen to change and actively seeking ways to improve processes and team outputs\nA motivated, self-starter character\nA tenacious, confident, goal-driven approach\nStrong mentoring, coaching, and people management skills\nExcellent time management skills to maximize the ability to reach goals\nStrong written and verbal communication skills, with an excellent telephone manner\nExceptional sales, marketing, and networking skills\n\n\nApply!\nIf you’re a super-driven sales pro, looking to lead a successful sales division and make a genuine impact in the education sector, apply now!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Sales, Business Development, and General Business",
        "industries": "Primary and Secondary Education, Education, and Professional Training and Coaching"
    },
    {
        "title": "Data & Analytics Consultant - (CRA / Scorecards)",
        "company": "Ventula Consulting",
        "location": "Greater London, England, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-cra-scorecards-at-ventula-consulting-4208089086?position=57&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=KoOgCerpKZ8bQGUDTImKig%3D%3D",
        "scraped_at": "2025-04-15 19:08:40",
        "description": "Data & Analytics Consultant - (CRA / Scorecards)\n\nI’m helping one of the world’s great financial institutions recruit a Data & Analytics Consultant - to help develop scorecards.\n\nConsultants are responsible for providing external clients with analytical support and project analysis. This includes answering client queries related to data characteristics, scores and also involvement in analytical projects, for example, credit strategy development, model development and other bespoke analytics to solve client specific problems.\n\nThe role involves using data mining tools and programming languages such as (SQL and Python) to prepare data for analysis and business decision making and also involves delivering analytical and commercial solutions for internal and external clients. We need someone who can combine business requirements, existing processes and data knowledge to create analytical solutions.\n\n· Relevant numerical degree with a 2:1 or above\n· Experience in programming languages SQL and Python in a credit risk environment\n· An innovative mindset and attention to detail\n· You possess excellent written and verbal communication skills with the ability to communicate with team members and clients at various levels, including business leaders\n· Relevant numerical degree with a 2:1 or above\n· Experience in programming languages SQL and Python in a credit risk environment\n· An innovative mindset and attention to\n\nThis is a hybrid position requiring 3 days in the office and 2 work from home.\n\nThe salary is a basic between £70-80K depending on experience. This is a fantastic opportunity to work for one of the worlds great finance companies in a very visible and important position with great career development prospects.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst and Information Technology",
        "industries": "Financial Services and Information Services"
    },
    {
        "title": "Senior Business Analyst",
        "company": "Arthur Recruitment",
        "location": "London Area, United Kingdom",
        "posted_date": "2025-04-14",
        "url": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-arthur-recruitment-4209800009?position=58&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=nBdP1mSiS9a8hF%2BqTTDkSw%3D%3D",
        "scraped_at": "2025-04-15 19:08:42",
        "description": "Senior Business Analyst – Data | Insurance\n\nA global insurance company is seeking a Senior Business Analyst to join their Data team. You will bridge business needs with technical solutions, drive data strategy, and enhance data quality and governance.\n\nEssential Skills:\n\n5+ years in business analysis, with experience in insurance and data-driven projects\nStrong expertise in cloud platforms (Azure, AWS) and modern data architectures\nProficiency in Agile methodologies, Jira, and Confluence\nExcellent stakeholder management and communication skills\nCertifications (BCS Business Analysis, ScrumMaster, Agile Product Owner) are a plus\n\nRole Details:\n\nLocation: Central London (Hybrid – 3 days per week)\nSalary: Competitive\nStart Date: ASAP (up to 3 months’ notice)\n\nNote: Please do not apply if you do not have insurance experience or if you have been a contractor.\n\nIf this position is of interest, please don’t hesitate to apply. Joshua from Arthur will be in touch to discuss your application.\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Insurance and Technology, Information and Media"
    },
    {
        "title": "Project Development Manager (Renewable Energy)",
        "company": "Piper Maddox",
        "location": "Windsor, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/project-development-manager-renewable-energy-at-piper-maddox-4210612030?position=59&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=V7hgF952NOOVYtj2lYNCTg%3D%3D",
        "scraped_at": "2025-04-15 19:08:43",
        "description": "Project Development Manager - Renewable Energy.\n\nBerkshire office base - Two Days in Office, Three WFH.\n\nSalary Range: £60,000 - 70,000 DOE.\n\nPiper Maddox are working with a global player in the Renewable Energy industry to grow out their UK team. They have significant presence in over 15 different international territories and have been a mainstay in the sector for over 20 years. On a global scale, they have over 30GW in their overall pipeline (development and construction phases).\n\nIn the UK, they have three office bases and this position would be based out of their English office location. The business model in the UK is a mixture of full project development and construction, as well as project sale when projects reach the RTB stage. This is for a range of Solar, Onshore Wind, and BESS developments.\n\nThey are looking to strengthen their team with the addition of a Project Development Manager to come onboard to play a leading role in the development of their pipeline. You will also have the opportunity to act as a mentoring leader for more junior members of their development team.\n\nYour role would surround the Project Management of utility scale developments from inception, through to the RTB stage - resulting in either handing over to construction, or into project sale.\n\nYou will be responsible for coordinating the origination of potential new land & project opportunities, managing the planning application process with external consultants, ensuring project feasibility both commercially and financially, as well as managing the liaison between these different project aspects throughout the project lifecycle.\n\nThis would be a fantastic opportunity for someone who is looking to play a leading role in the development of clean energy projects. This company has a nice balance of having a streamlined team in the UK with a tight knit and collaborative culture, while being a part of a large international organization with good market stability.\n\nIf you have between 3 & 5 years of project development experience dedicated to the renewable energy sector, this could be a good fit for you, so apply to learn more!\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Project Management, Management, and Business Development",
        "industries": "Renewables & Environment"
    },
    {
        "title": "Senior Business Analyst",
        "company": "Computer Futures",
        "location": "Bristol, England, United Kingdom",
        "posted_date": "2025-04-15",
        "url": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-computer-futures-4210631075?position=60&pageNum=0&refId=NbD6BW1IyWfnuQzd8J39TA%3D%3D&trackingId=f8Y%2BuTKLy0XKB77F%2F6N5Kg%3D%3D",
        "scraped_at": "2025-04-15 19:08:45",
        "description": "Are you a Senior Business Analyst looking for your next challenge?\n\nI'm currently working with a leading organisation in the financial services sector, who are on the lookout for a Senior Business Analyst to join the team. This is a fantastic opportunity to help shape the future of their business processes, driving innovation and delivering exceptional value to both customers and internal stakeholders.\n\nAs a Senior Business Analyst, you will work closely with delivery stream stakeholders to create and manage business requirements, translating them into actionable plans. Your role will involve understanding the business's operating context, supporting the development of business strategies, and ensuring alignment with broader delivery stream objectives and key results.\n\nWhat you'll be doing:\n\nConduct detailed business analysis, outlining problems, opportunities, and solutions for the business.\nWork with IT and business stakeholders to gather, document, and analyse system and business requirements.\nCollaborate with technical teams to design and implement solutions that meet business needs.\nFacilitate workshops and meetings to gather requirements and validate solutions with stakeholders.\nDevelop and maintain detailed documentation including business requirements, functional specifications, user stories, and use cases.\nSupport the development of test plans and test cases, and participate in testing activities to ensure solutions meet business requirements.\nAnalyse and evaluate business processes, identifying areas for improvement and implementing solutions to enhance efficiency.\nEnsure compliance with regulatory requirements and maintain high standards of conduct and risk management within a financial services environment.\n\nWhat you'll need:\n\nExtensive experience as a Business Analyst within a financial services regulated environment.\nGood technical understanding and experience with IT systems, software development life cycle, and infrastructure within financial services.\nExperience with regulatory requirements from the FCA and familiarity with compliance and risk management.\nProven ability to work with Agile and Waterfall methodologies, including experience with tools such as Jira and Confluence.\nStrong analytical skills with the ability to interpret complex data and translate it into actionable insights.\nExcellent communication and stakeholder management skills, with the ability to work effectively with both technical and non-technical teams.\n\nWhat you'll get:\n\nAnnual salary up to £70,000 DOE.\nAnnual bonus of up to 10%.\nHybrid working.\nMatched pension contributions of up to 10%.\n26 days holiday, plus bank holidays, with the option to purchase up to 5 additional days each year.\n2 day's volunteering leave per year.\n\nIf you meet a handful of the above requirements and are interested in the role, then please apply and if suitable I will be in touch to discuss in further detail.\n\nDesired Skills and Experience\nBusiness Analyst, BA, Analyst, Data, Technical Requirements\n\nTo find out more about Computer Futures please visit www.computerfutures.com\n\nComputer Futures, a trading division of SThree Partnership LLP is acting as an Employment Business in relation to this vacancy | Registered office | 8 Bishopsgate, London, EC2N 4BQ, United Kingdom | Partnership Number | OC387148 England and Wales\n",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Technology, Information and Internet"
    }
]