[
    {
        "title": "Data Analyst",
        "company": "Explore Group",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=1&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2F3naK8RtwyKGJtXA4YkCrA%3D%3D",
        "scraped_at": "2025-04-15 21:42:10",
        "description": "Data Analyst\n***MUST HAVE MARITIME EXPERIENCE***\n\nWe're looking for a skilled Data Analyst to turn complex data into clear insights that drive business performance. If you're passionate about data storytelling, automation, and impact, this is the role for you.\n\nResponsibilities:\nExtract, validate, and analyze large data sets for trends and insights\nBuild dashboards and reports (Power BI, Excel) to support decision-making\nCollaborate with stakeholders to define data requirements\nAudit data quality and ensure integrity across sources\nAutomate recurring reports and improve analytics workflows\n\nWhat we’re looking for:\n6+ years of experience in data analytics\nAdvanced Excel (VBA, Macros), Power BI, SQL, PowerPoint\nStrong statistical and analytical mindset\nBachelor’s/Master’s in Mathematics, Statistics, or related field\nBonus: Experience with automation tools and data audit processes",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Maritime Transportation",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=1&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2F3naK8RtwyKGJtXA4YkCrA%3D%3D"
    },
    {
        "title": "Business Data Analyst",
        "company": "McGregor Boyall",
        "location": "Belfast, Northern Ireland, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-data-analyst-at-mcgregor-boyall-4208879156?position=2&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RspOHjJB1BBf0XDT7mayAg%3D%3D",
        "scraped_at": "2025-04-15 21:42:10",
        "description": "Business Data Analyst\nBelfast\n\nWe are currently seeking an experienced Business Analyst & Data Specialist to join a high-profile Front Office Risk & Control function within a globally recognised financial institution. This role offers the opportunity to contribute to the enhancement of booking controls across a full spectrum of traded products, ensuring the accuracy, integrity and risk alignment of front-office trade activity.\n\nKey Details\nStart Date: ASAP\nDuration: Until 31/12/2025\nLocation: Belfast\nPay Rate: Up to £600/day (Inside IR35)\n\nAbout the Team\nYou will be part of a dedicated in-business risk and control group responsible for the design, implementation, and monitoring of trade booking controls. The team operates across all global markets businesses and works closely with Sales & Trading, Technology, Operations, Compliance, and Audit.\n\nKey Responsibilities of a Business Data Analyst:\nAnalyse booking processes and trade data flows to assess control gaps and data suitability.\nDefine business requirements for reporting, metrics, and monitoring tools.\nCollaborate with trading desks, technology teams and operations to support the delivery of new controls.\nProvide quality assurance through testing and data-driven control assessments.\nProduce management information (MI) and reports that evidence control performance and effectiveness.\nSupport audit reviews, investigate control issues, and contribute to continuous control enhancements.\nMaintain and update procedural documentation relating to ongoing monitoring and reporting activities.\n\nEssential Skills & Experience for a Business Data Analyst\nProven experience within Markets, ICG, or relevant functions such as risk, operations, product control or middle office.\nStrong understanding of traded products and trade lifecycle control principles.\nDemonstrable experience defining business requirements and managing technology delivery.\nConfident stakeholder management, with excellent written and verbal communication skills.\nStrong analytical mindset and problem-solving skills with a control-focused approach.\nAdvanced Excel capabilities; experience working with databases and large datasets.\nExperience with data analysis tools such as Python, Tableau or Power BI is highly desirable.\n\nDesirable Skills\nExperience working in a Front Office or trade control setting.\nProduct knowledge across Markets asset classes including Fixed Income and Derivatives.\nExposure to Manager Control Assessments (MCA) or similar internal risk frameworks.\n\n\nMcGregor Boyall is an equal opportunity employer and do not discriminate on any grounds.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst",
        "industries": "Banking",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-data-analyst-at-mcgregor-boyall-4208879156?position=2&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RspOHjJB1BBf0XDT7mayAg%3D%3D"
    },
    {
        "title": "Data Engineer - Equity Trading - Quant Hedge Fund - £250k",
        "company": "Paragon Alpha - Hedge Fund Talent Business",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-equity-trading-quant-hedge-fund-%C2%A3250k-at-paragon-alpha-hedge-fund-talent-business-4209603327?position=3&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=pwOhfKKNiBmVxDA2nNRqEw%3D%3D",
        "scraped_at": "2025-04-15 21:42:11",
        "description": "I'm collaborating with an equity trading team, embedded within one of the worlds largest systematic hedge funds. To aid there seamless data driven ecosystem, they're looking for a Data Engineer to aid several PM teams.\n\nThe firm have a huge data organization underpinning the trading lifecycle, and they place data analytics and data science teams embedded in the front office to enabled more data driven trades and investments.\n\nThe role entails bringing on targeted data sets, pipelining these; and helping to wrangle and analyze the data, ready to assist in signal generation.\n\nStack: Python, AWS, ETL, SQL\n\nThe client are looking to speak to varied Data Engineers from trading backgrounds, with someone technically astute with Python and SQL as well as multiple asset classes.\n\nIf you would like the chance to earn a market leading salary with the opportunity to work in a hybrid model in tandem; then please do apply.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Business Development, and Finance",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-equity-trading-quant-hedge-fund-%C2%A3250k-at-paragon-alpha-hedge-fund-talent-business-4209603327?position=3&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=pwOhfKKNiBmVxDA2nNRqEw%3D%3D"
    },
    {
        "title": "Senior Data Analyst",
        "company": "Muzz",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-analyst-at-muzz-4210907908?position=4&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=WP9mrf2fpoGMPxWucSQdSA%3D%3D",
        "scraped_at": "2025-04-15 21:42:11",
        "description": "Senior Data Analyst\nLondon, UK (Hybrid - 2 days)*\n£50,000 - £60,000 + equity\n\nWe’re looking for a smart and ambitious senior data analyst, with real entrepreneurial flair to join our team to understand our members and all the metrics that matter. Love numbers and love being commercial? This role presents a clear pathway to leadership within the team, offering career growth for a motivated and driven individual.\n\nMuzz is the world’s largest Muslim dating and marriage app. We’ve got over 15 million members and have helped more than 600,000 couples get married. We’re on our way to become the first $1 billion Muslim tech brand – but we need your help!\n\nDay to day\n\nYou’ll be joining an 8 strong team of data analysts, data engineers and data scientists whose goal is to grow the company and optimize our product as we expand into new markets around the world\nYou’ll be deeply understanding our user behaviour on the app with a view to generating actionable insights for our product\nYou’ll own reporting – build and maintain dashboards to assess KPIs whilst enabling stakeholders to self-serve their own data questions\nYou’ll provide analytical support across all areas of the product development lifecycle, from opportunity to product strategy, new feature analysis and experimentation\nYou’ll work closely with our product managers, mobile and backend engineers and UX in a cross-functional team\nYou’ll lead on the development of our data transformations and collaborate with data analysts on testing and monitoring our core datasets\n\nRequirements\n\nMinimum of 4 years of professional experience in a dedicated data analytics role, such as a Data Analyst, Business Intelligence Analyst, or similar\nCommercial Experience with a cloud data warehouse such as BigQuery/Redshift\nExcellent SQL knowledge, and proven experience in optimizing queries for performance, scalability, and ease of maintenance\nDesign and implement reusable data models to answer multiple business requirements\nExperience of mentoring junior data analysts or analytics engineers and evolving the environment for them to do their best work\nAbility to work flexibly, be organised and capable of prioritizing requests\nExcellent communication skills and presenting to non-technical audiences\n\nNice to have\nExperience with DBT\nExperience with ThoughtSpot/Looker",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst and Information Technology",
        "industries": "Software Development",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-analyst-at-muzz-4210907908?position=4&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=WP9mrf2fpoGMPxWucSQdSA%3D%3D"
    },
    {
        "title": "Senior Data Insights Analyst at $100m Funded Social-Good Start-Up",
        "company": "Grey Matter Recruitment",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-insights-analyst-at-%24100m-funded-social-good-start-up-at-grey-matter-recruitment-4207349366?position=5&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=z6rHEzzCE3xnbZ5GvVM3DQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:12",
        "description": "This is your chance to perform the job you love and make a difference in society whilst doing it! Help this one-of-a-kind Social Good platform change the world by delivering crucial insights across the business.\n\nThe Company\n$130M funding from over 40 VC investors\nThe platform has raised hundreds of millions of dollars for charities worldwide\nOne of Fast Company's most innovative companies in the world\nHuman-centric company focused on making a real-world positive impact\nStock options, Medical Insurance etc\n\nThe Role\nIn a flat structure reporting to the Director of Analytics, you will own the analytics practice and work on cross-functional data insights\nHelp shape and define this practice and oversee the data insights piece through a period of global expansion\nCollect, analyse and present data from a variety of sources including Web, User Journey, Customer Insights etc\n\nDesired skills and experience\nExtensive BI or analytics and insights experience\nStrong communication and excellent data storytelling skills and experience\nWeb Analytics and GA / GA4 or similar tools experience\neCommerce industry experience",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology, Analyst, and Product Management",
        "industries": "Fundraising, Software Development, and Technology, Information and Media",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-insights-analyst-at-%24100m-funded-social-good-start-up-at-grey-matter-recruitment-4207349366?position=5&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=z6rHEzzCE3xnbZ5GvVM3DQ%3D%3D"
    },
    {
        "title": "Data & Analytics Consultant – Modelling / CRA Data",
        "company": "Ventula Consulting",
        "location": "Nottingham, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208404878?position=6&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ly82loe9aS2dW3sr6nYy8Q%3D%3D",
        "scraped_at": "2025-04-15 21:42:13",
        "description": "Data & Analytics Consultant – Modelling / CRA Data\n\nOne of world’s leading financial services companies (products used by 93% of Fortune 500) requires a Data & Analytics consultant. You will work closely with clients to proactively understand their challenges, propose and develop solutions and lead the execution of analytical and consultancy projects, including the design and development of complex modelling assignments utilising CRA data. You will have frequent engagements with external customers / stakeholders and will manage multiple analytics and consultancy projects.\n\nResponsibilities.\nProactive client engagement, developing partnerships with risk / analytics counterparts within clients; developing a deep knowledge of the relevant industries, clients’ business models, challenges and opportunities to address these.\nLead a small team of analysts, providing supervision and leadership\nWrite compelling proposals to win new analytics and consultancy opportunities\nResponsible for delivering analytics projects leveraging CRA data assets. This includes credit strategy and model developments to the required quality standards and timescales. This will cover all stages, including sample design, retrospective analysis, performance analysis, population split analysis and reject analysis.\nDevelop deep data knowledge in the structure, application and permissible use of data sources, across consumer, commercial and open banking lines of business\nApplication of statistical techniques (including Regression techniques, Machine Learning techniques, Decision Trees, CHAID Analysis & Cluster Analysis) to solve business problems.\nApplication of data mining tools and programming languages Python and SQL to prepare data, undertake analysis and develop solutions for internal and external clients.\nResponsible for presenting proposals, approaches and results to stakeholders, including complex statistical techniques to a range of technical / non technical audiences of all sizes through to C-Suite, to generate improved business decisions and profitability.\nUnderstanding of the regulatory landscape within which the assigned clients operate\nWork closely with internal Sales and Strategy Consulting teams to inform and shape broader opportunities and solutions\n\nWhat experience you need\nExperience in programming languages Python and SQL in a credit risk environment\nExperience in the use of credit bureau data\nAn innovative mindset, with experience identifying opportunities that deliver incremental business benefit through leveraging of data and analytics\nStrong technical expertise and experience of statistical techniques to solve business problems\nStrong communication and consulting skills, with the ability and confidence to present to business partners and clients\nYou possess excellent written and verbal communication skills with the ability to communicate with team members and clients at various levels, including business leaders.\nExperience in leading and management\nPrevious analytical consultancy in a big data environment\nDeep understanding of the industry / regulatory landscape\nExposure to machine learning techniques\nCloud experience using GCP or Amazon AWS\n\nThis position offers a basic salary between £70-80K with an excellent benefits package and bonus scheme. The role requires 3 das a week in the office.\n\nThis is a wonderful opportunity to work for one of the worlds leading financial data companies who are known around the world.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Analyst",
        "industries": "Information Services, Data Infrastructure and Analytics, and Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208404878?position=6&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ly82loe9aS2dW3sr6nYy8Q%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Searchability NS&D",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-searchability-ns-d-4210605998?position=7&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=09sOuQaPjJqEy0J6jpA2Ew%3D%3D",
        "scraped_at": "2025-04-15 21:42:14",
        "description": "NEW CONTRACT OPPORTUNITY AVAILABLE WITHIN A LEADING NATIONAL SECURITY COMPANY FOR A DATA ENGINEER WITH DV CLEARANCE\n\n\nContract job opportunity for a Data Engineer\nNational Security client\nPalantir Foundry\nFlexible daily rate DOE\nCentral London based organisation in an easily accessible location\nTo apply please call 07704 152 640 / 0203 854 0120 or email dominic.barbet@searchability.com\n\nWHO WE ARE?\nWe are recruiting a contract Data Engineer to work with a leading national security client in central London. Due to the nature of the work, you must hold a DV or enhanced DV Clearance.\n\nWE NEED THE DATA ENGINEER TO HAVE….\nCurrent DV clearance MOD or Enhanced\nExperience with big data tools such as Hadoop, Cloudera or Elasticsearch\nExperience With Palantir Foundry\nExperience working in an Agile Scrum environment with tools such as Confluence / Jira\nExperience in design, development, test and integration of software\nWillingness to learn new technologies\n\n\nIT WOULD BE NICE FOR THE DATA ENGINEER TO HAVE….\nCloud based architectures\nMicroservice architecture or server-less architecture\nMessaging / routing technologies such as Apache Nifi / RabbitMQ\n\n\nTO BE CONSIDERED….\nPlease either apply by clicking online or emailing me directly to dominic.barbet@searchability.com For further information please call me on 0203 854 0120 or 07704 152 640. I can make myself available outside of normal working hours to suit from 7am until 10pm. If unavailable, please leave a message and either myself or one of my colleagues will respond. By applying for this role, you give express consent for us to process & submit (subject to required skills) your application to our client in conjunction with this vacancy only. Also feel free to connect with me on LinkedIn, just search Dominic Barbet. I look forward to hearing from you.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting",
        "industries": "IT Services and IT Consulting and Software Development",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-searchability-ns-d-4210605998?position=7&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=09sOuQaPjJqEy0J6jpA2Ew%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Immersum",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-immersum-4209834793?position=8&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=sXQqlz2K1fX1h2oevLDMjQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:15",
        "description": "Job Title: Lead Data Engineer (leading a team of 5).\nSalary: £130,000 – £150,000 + benefits\nLocation: West London - Hybrid (3 days p/w in-office)\nTech: AWS, Snowflake, Airflow, DBT, Python\n\nThe Company:\nImmersum have engaged with a leading PropTech company on a mission to revolutionise how the property sector understands people, places, and data. By combining cutting-edge data science with powerful location intelligence, they help major organisations make smarter, faster decisions. Backed by top-tier investors and growing fast, this is your chance to shape the future of PropTech from the inside.\n\nThe Role Requirements:\nYou’ll take ownership of the design and delivery of scalable, high-performing data pipelines that drive core product features and insights. Sitting at the heart of the engineering and data function, you’ll play a critical role in the company’s continued success. You will also lead a small team of 5 Data Engineers to up skill and lead by example.\n\nWhat you’ll be doing:\nLeading the build of reusable, production-grade data flows\nDesigning high-performance data processing and streaming systems\nDefining best practices in data modelling, integration, and storage\nEnsuring code quality, performance, and maintainability at scale\nCollaborating across product, data science, and engineering teams\nLeading a small team of 5 data engineers\n\nWhat you’ll bring:\nStrong leadership experience in data engineering\nDeep expertise with AWS, Snowflake, Airflow, and DBT\nA pragmatic, product-first approach to building data systems\nExcellent communication and stakeholder management skills\nSolid understanding of agile data development lifecycles\n\nWhy Join:\nBe a key player in a fast-growing, mission-led PropTech scale-up\nOwn greenfield projects and shape the data engineering roadmap\nExcellent opportunities for career growth\nBuild innovative products that are redefining an entire industry",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT System Custom Software Development, Data Infrastructure and Analytics, and IT System Data Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-immersum-4209834793?position=8&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=sXQqlz2K1fX1h2oevLDMjQ%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Tenth Revolution Group",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-tenth-revolution-group-4204808631?position=9&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=p900WKXhIIEIkqmPhWOLCg%3D%3D",
        "scraped_at": "2025-04-15 21:42:16",
        "description": "Data Engineer\nI am working with a data driven Microsoft partnered consultancy who are looking for a Databricks Data Engineer to join their growing team. You will have the opportunity to work with some of the latest Microsoft technologies with a focus on projects on Databricks implementations.\n\nYou will join a team at the centre of a number of data-driven projects where you will be responsible for the design, development and creation of data solutions. You will work on the full end-to-end product lifecycle from platform design to insights creation.\n\nAs part of this role, you will be responsible for some of the following areas\nDesign, develop and maintain data pipelines that are responsible for the ingestion and transformation of data between different sources\nCreate and develop data models\nDevelopment of cloud data platforms solutions\n\nTo be successful in the role you will have\nSolid experience designing and delivering data solutions focused on Databricks\nStrong ETL experience with tools such as ADF or SSIS\nExperience working with Azure technologies – Synapse, Fabric, Data Lake\nKnowledge of data architecture principles and data modelling\n\nIn this role you will be required to attend the office on an ad-hoc basis in London, with the remaining time spent working remotely. Some of the benefits included with the role are listed below\nStarting salary of up to £60,000\nPerformance related annual bonus\n25 days annual leave (plus bank holidays)\nEmployer pension contribution scheme\nPrivate health/medical care\nVarious retail discounts and more!\n\nThis is just a brief overview of the role. For the full information, simply apply to the role with your CV, and I will call you to discuss further. My client is looking to begin the interview process ASAP, so don’t miss out, APPLY now! To do so please email me at a.pinkerton@tenthrevolution.com or call me on 0191 3387487.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-tenth-revolution-group-4204808631?position=9&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=p900WKXhIIEIkqmPhWOLCg%3D%3D"
    },
    {
        "title": "Commercial Finance Analyst",
        "company": "Freshminds",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=10&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Zb%2F2yELe4hZZnfsMKkgOFQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:18",
        "description": "Freshminds has partnered with a leading entertainment brand looking to hire an Investment and Property Business Partner to drive key strategic initiatives within its investment & property people and technology functions.\n\nWorking closely with senior management and reporting to the Director of Commercial Finance, you’ll provide data-driven insights to enhance decision-making, assess capital investments, and track the performance of new sites, technology, and workforce initiatives.\n\nWhat you’ll be doing:\nManaging investment cases for property, new sites, and technology.\nDeveloping reports and analysis to support investment and capital planning.\nIdentifying trends, risks, and opportunities using advanced analytics.\n\nRequirements:\nStrong data and analytical skills (SQL, Advanced Excel, Power BI with Python/Amazon RDS desirable).\nExperience in investment, property, or multi-site businesses.\nProven consulting skill-set.\nAbility to translate complex challenges into actionable insights.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting, Finance, and Strategy/Planning",
        "industries": "Entertainment Providers",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=10&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Zb%2F2yELe4hZZnfsMKkgOFQ%3D%3D"
    },
    {
        "title": "Principal Data Consultant",
        "company": "Fynity",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/principal-data-consultant-at-fynity-4194399546?position=11&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=rfgjG17t0EXjhaLpKDr3sw%3D%3D",
        "scraped_at": "2025-04-15 21:42:19",
        "description": "Principal Data Consultant\n\nPrincipal Data Consultant required by a dynamic and leading boutique data strategy consultancy.\n\nThis is a fantastic opportunity to work on interesting and complex data strategy and transformation projects. You will get to engage with a wide variety of clients from large enterprises and small start-ups to niche charities. taking ownership of projects across the full lifecycle\n\nThe Role\nIn this client-facing, Principal Data Consultant role, you will lead and drive high-impact strategic data initiatives for clients. You will work across and lead a variety of different client projects spanning data strategy formation, data maturity assessments, data literacy initiatives and data governance as well as more technical data/analytics projects.\n\nDay-to-day, you will be the client’s primary point of contact, lead workshops with senior stakeholders, define the scope of work and manage the project plan, mentoring and guiding more junior team members when required. You will also get the opportunity to use your hands-on data skills, whether that be in coding, assisting with data migrations or integration.\n\nThis is a varied and interesting role where which will tap into your broad and deep knowledge of data to help harness solutions and solve client problems. The need is very much for a do-er… not just a ‘thought leader’.\n\nWhat do you need?\nTo be considered, you will have a strong background in managing and delivering complex and/or strategic data projects or transformations across the full lifecycle.\n\nIdeally, you will have experience from within a client-facing consultancy environment where you can evidence success on a range of different strategy, advisory and solution delivery projects.\n\nYou will have experience in creating data strategy and will be highly familiar with data maturity assessments, data vision generation, use case & value mapping and data literacy.\n\nIn terms of technical skills, you will bring some experience in designing, building and configuring end-to-end analytics solutions, writing code (e.g. SQL, Python), data modelling, data migration and a knowledge of general IT architecture and systems integration. You should also bring good skills in documentation.\n\nFinally, you will bring a real passion for data and must have excellent communication and presentation skills up to CxO level, with the ability to build relationships to trusted advisor level. Commercial exposure to developing and delivering successful proposals, presentations or bids is also desirable, and you must be a self-starter who can lead and take ownership of projects and teams, guiding them to achieve goals and objectives.\n\nWhat is on offer?\nThis is a hybrid role that offers lots of flexibility to work remotely, but visits to the office in London (London Bridge) are required 1-2 times per week to collaborate with your colleagues. There may also be occasional visits to client sites as well as the group HQ in Surrey.\n\nOn offer is an excellent salary (depending on your level of experience), from £70,000 to £90,000 as well as an annual bonus of c£5k-£8k (paid quarterly), private medical, contributory matched pension (up to 5%), 25 days holiday and other benefits.\n\nIf you are a Senior Data Consultant ready to step up or a Principal Data Consultant looking for an exciting new challenge - APPLY NOW - interviewing immediately!",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Information Technology",
        "industries": "IT Services and IT Consulting and Business Consulting and Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/principal-data-consultant-at-fynity-4194399546?position=11&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=rfgjG17t0EXjhaLpKDr3sw%3D%3D"
    },
    {
        "title": "Data & Analytics Consultant – Modelling / CRA Data",
        "company": "Ventula Consulting",
        "location": "Leeds, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208407234?position=12&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=nQ4l5ZpM0%2FWrsD39kTzesA%3D%3D",
        "scraped_at": "2025-04-15 21:42:20",
        "description": "Data & Analytics Consultant – Modelling / CRA Data\n\nOne of world’s leading financial services companies (products used by 93% of Fortune 500) requires a Data & Analytics consultant. You will work closely with clients to proactively understand their challenges, propose and develop solutions and lead the execution of analytical and consultancy projects, including the design and development of complex modelling assignments utilising CRA data. You will have frequent engagements with external customers / stakeholders and will manage multiple analytics and consultancy projects.\n\nResponsibilities.\nProactive client engagement, developing partnerships with risk / analytics counterparts within clients; developing a deep knowledge of the relevant industries, clients’ business models, challenges and opportunities to address these.\nLead a small team of analysts, providing supervision and leadership\nWrite compelling proposals to win new analytics and consultancy opportunities\nResponsible for delivering analytics projects leveraging CRA data assets. This includes credit strategy and model developments to the required quality standards and timescales. This will cover all stages, including sample design, retrospective analysis, performance analysis, population split analysis and reject analysis.\nDevelop deep data knowledge in the structure, application and permissible use of data sources, across consumer, commercial and open banking lines of business\nApplication of statistical techniques (including Regression techniques, Machine Learning techniques, Decision Trees, CHAID Analysis & Cluster Analysis) to solve business problems.\nApplication of data mining tools and programming languages Python and SQL to prepare data, undertake analysis and develop solutions for internal and external clients.\nResponsible for presenting proposals, approaches and results to stakeholders, including complex statistical techniques to a range of technical / non technical audiences of all sizes through to C-Suite, to generate improved business decisions and profitability.\nUnderstanding of the regulatory landscape within which the assigned clients operate\nWork closely with internal Sales and Strategy Consulting teams to inform and shape broader opportunities and solutions\n\nWhat experience you need\nExperience in programming languages Python and SQL in a credit risk environment\nExperience in the use of credit bureau data\nAn innovative mindset, with experience identifying opportunities that deliver incremental business benefit through leveraging of data and analytics\nStrong technical expertise and experience of statistical techniques to solve business problems\nStrong communication and consulting skills, with the ability and confidence to present to business partners and clients\nYou possess excellent written and verbal communication skills with the ability to communicate with team members and clients at various levels, including business leaders.\nExperience in leading and management\nPrevious analytical consultancy in a big data environment\nDeep understanding of the industry / regulatory landscape\nExposure to machine learning techniques\nCloud experience using GCP or Amazon AWS\n\nThis position offers a basic salary between £70-80K with an excellent benefits package and bonus scheme. The role requires 3 das a week in the office.\n\nThis is a wonderful opportunity to work for one of the worlds leading financial data companies who are known around the world.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Analyst",
        "industries": "Information Services, Data Infrastructure and Analytics, and Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208407234?position=12&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=nQ4l5ZpM0%2FWrsD39kTzesA%3D%3D"
    },
    {
        "title": "Executive Assistant",
        "company": "Eden Recruitment Ltd",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=13&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=kq1vRleBcVwb3d0Dp7DFJA%3D%3D",
        "scraped_at": "2025-04-15 21:42:22",
        "description": "Executive Assistant - Global Financial Services\n\nJoin a globally respected financial services firm known not just for its high performance, but for its incredible culture and show-stopping offices. We’re on the lookout for a Executive Assistant to support a high-calibre team, including Senior Managing Directors and VPs—people at the top of their game.\n\nThis is more than just a traditional EA role. You’ll be a key player, helping to keep the gears moving smoothly in a fast-paced, high-stakes environment, where your expertise is respected and your contributions truly matter.\n\nWhat You’ll Be Doing:\nSeamlessly support a dynamic team of senior leaders.\nManage highly complex calendars and juggle competing priorities.\nOrganise detailed global travel itineraries with precision.\nAct as a trusted point of contact internally and externally.\nHelp nurture an inclusive, energising team culture.\n\nWhat We're Looking For:\nSolid experience as an Executive Assistant—financial services experience is highly desired.\nHigh level ability to manage schedules and travel across time zones.\nA curious, solution-focused mindset—you’re always one step ahead.\nNext-level organisation and multitasking skills.\nStrong emotional intelligence and top-tier communication skills.\n\nWhy You’ll Love It Here:\nA collaborative, respectful, and people-first culture—you’ll feel valued from day one.\nCareer growth and learning opportunities that will keep you challenged and inspired.\nHybrid flexibility (3 days in-office, 2 remote).\nA competitive salary + benefits package that recognises your worth.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Financial Services, Investment Banking, and Venture Capital and Private Equity Principals",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=13&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=kq1vRleBcVwb3d0Dp7DFJA%3D%3D"
    },
    {
        "title": "Business Analyst",
        "company": "Crimson",
        "location": "Birmingham, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-crimson-4207387341?position=14&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gA%2FIjNfHshfs9mouK8vEGA%3D%3D",
        "scraped_at": "2025-04-15 21:42:23",
        "description": "Business Analyst – Birmingham\n\nBirmingham – Hybrid 3 days\n\nSalary - £50,000 - £60,000 per annum\n\nOur client is seeking a highly skilled Business Analyst to join an existing BA team. In this role, you will act as a crucial link between business needs and technical solutions, ensuring seamless alignment across various sectors. Your efforts will focus on enhancing processes and delivering impactful results. The role will support a range of IT projects, encompassing both application and infrastructure-related initiatives.\n\n\nKey Skills and Responsibilities:\n\n- Proven track record working on business change and business projects as a Business Analyst\n- Conduct thorough and detailed analysis of current business processes, employing process mapping tools and methodologies to identify inefficiencies and optimisation opportunities.\n- Build and maintain strong, collaborative relationships across various business units, ensuring clear, consistent, and transparent communication. Engage with stakeholders at all levels to align business objectives and ensure their needs and expectations are met.\n- Lead and facilitate comprehensive workshops, in-depth interviews, and interactive focus groups to meticulously capture, document, and validate detailed business requirements.\n- Collaborate closely with technical teams, including software developers, system architects, and IT specialists, to translate complex business needs into actionable and practical technical solutions.\n- Identify and implement opportunities for process optimisation and continuous improvement using Agile methodology. Develop and track key performance indicators (KPIs) to measure the effectiveness of process improvements and deliver measurable business benefits.\n- Law or Finance background is advantageous\n\nInterested? Please submit your updated CV to Emma Siwicki at Crimson or immediate consideration.\nNot interested? Do you know someone who might be a perfect fit for this role? Refer a friend and earn £250 worth of vouchers!\n\nCrimson is acting as an employment agency regarding this vacancy",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-analyst-at-crimson-4207387341?position=14&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gA%2FIjNfHshfs9mouK8vEGA%3D%3D"
    },
    {
        "title": "Data Acquisition Lead",
        "company": "Invecta",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-acquisition-lead-at-invecta-4209888661?position=15&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fU6QyKMlap1Mq3VtrfjALQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:24",
        "description": "We are working with a leading insurance organsiation who are looking for a Data Acquisition Lead to play a key role in supporting their data lake and lakehouse architecture strategy. You will work closely with data architects and data scientists to acquire and document production-ready data sources, utilising modern methods and tools in line with best practice.\n\nKey Responsibilities\nCollaborate with data engineers, architects, and scientists to source and integrate corporate data assets.\nSupport the development of scalable and efficient data pipelines (ETL/ELT), ensuring data is clean, transformed, and ready for analytics.\nDrive the acquisition and sharing of data for counter-fraud and strategic insight purposes.\nApply best-in-class data documentation and governance principles.\nWork within the framework of data protection and information governance, ensuring compliance with relevant legislation.\nBuild strong stakeholder relationships to secure strategic data assets.\n\nAbout You\nYou are someone who brings strong technical knowledge combined with stakeholder and project management skills. You understand the complexity of data across large, multi-functional organisations and know how to turn strategy into practical, operational outcomes.\n\nRequired Experience\nProven experience in acquiring, processing, and sharing data in large or complex organisations.\nStrong background in data engineering and ETL development.\nExperience working with diverse data sources and building production-ready pipelines.\nSolid understanding of data protection laws and governance frameworks.\nTrack record of influencing stakeholders and managing cross-functional relationships.\nExperience in delivering reports and dashboards for performance and analytical use.\nFamiliarity with data science and analytics concepts.\n\nKey Skills\nStrong analytical and numerical reasoning.\nDeep understanding of data structures and database management.\nConfident problem solver with innovative and strategic thinking abilities.\nExcellent communication, influencing, and negotiation skills.\nAbility to balance multiple priorities and deliver under pressure.\nSkilled in translating strategic objectives into actionable plans.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology, Analyst, and Accounting/Auditing",
        "industries": "Insurance, Financial Services, and Business Consulting and Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-acquisition-lead-at-invecta-4209888661?position=15&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fU6QyKMlap1Mq3VtrfjALQ%3D%3D"
    },
    {
        "title": "Head of Data Management",
        "company": "Forsyth Barnes",
        "location": "West Midlands, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/head-of-data-management-at-forsyth-barnes-4210575031?position=16&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=tYW8pbN2Z4TS6fuLY7hhLA%3D%3D",
        "scraped_at": "2025-04-15 21:42:25",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/head-of-data-management-at-forsyth-barnes-4210575031?position=16&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=tYW8pbN2Z4TS6fuLY7hhLA%3D%3D"
    },
    {
        "title": "IT Business Analyst",
        "company": "Huntr Talent Group",
        "location": "Brierley Hill, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/it-business-analyst-at-huntr-talent-group-4210602428?position=17&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=YWr78mNJdUQ9pXXn4vCjvw%3D%3D",
        "scraped_at": "2025-04-15 21:42:27",
        "description": "Job Overview:\nOur client is looking for an IT Business Analyst to join their team. The role involves a focus on identifying opportunities for innovation, optimising processes, and ensuring the successful implementation of technology-driven solutions\n\nKey Responsibilities\nPartner with the IT Director to assess and enhance the firm’s legal services through technological advancements and process improvements.\nDevelop and present comprehensive project plans to the Strategy Board, outlining objectives, scope, timelines, and resource needs.\nConduct in-depth research and analysis to support project proposals and strategic recommendations.\nLead and oversee project initiatives, ensuring adherence to agreed-upon processes and timelines.\nTrack project progress and provide regular status updates to the IT Director.\nWork collaboratively with the Development, Infrastructure, and Operations teams to design, configure, and deploy necessary systems and tools.\nCoordinate with the training team to organize workshops and training sessions, ensuring a smooth transition to new technologies and processes.\nAssess the effectiveness of implemented projects, reporting on outcomes and applying lessons learned to future initiatives.\n\nPerson Specification\nProven experience as a Business Analyst within professional services.\nA successful track record in delivering internal consultancy projects.\nExperience collaborating with cross-functional teams and managing stakeholders.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal abilities.\nStrong organizational skills, with the ability to manage multiple projects simultaneously.\nDemonstrated experience in business process optimization and technology implementation.\nA results-driven mindset with accountability for project outcomes.\n\nDetails\nFull time\nHybrid working (4 days onsite, 1 day offsite)\nPaying £60,000",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/it-business-analyst-at-huntr-talent-group-4210602428?position=17&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=YWr78mNJdUQ9pXXn4vCjvw%3D%3D"
    },
    {
        "title": "Senior Data/Analytics Engineer",
        "company": "Wave Talent",
        "location": "United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-analytics-engineer-at-wave-talent-4190843332?position=18&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PtDcaedEt9usM0dr0OXqGg%3D%3D",
        "scraped_at": "2025-04-15 21:42:28",
        "description": "💻 Job Title: Senior Data/Analytics Engineer\n💰 Salary: up to £115k\n🌴 38 days of annual leave + bank holidays\n🔗 Industry: B2B2C platform\n📍 Location: could be mostly remote\nideally in close proximity to London or Edinburgh to visit the office on weekly basis, however, open to only monthly visits to either office\n\nWith 1.1 million members and over 300 corporate clients (including the likes of Amazon, Google and HSBC to name just a few), this rapidly growing data and technology platform is a UK leader in their field.\n\nAs the company's first dedicated Data hire, working directly under the CTO, you'll establish the foundation for their data infrastructure and analytics capabilities. This is a unique opportunity to build and shape the data landscape from the ground up, working closely with cross-functional teams to enable data-driven decision-making across the organisation.\n\nThis pivotal role sits somewhere between Data Engineering and Analytics Engineering and will involve:\nDesigning, developing, and maintaining scalable data models and pipelines to ensure clean, well-structured data for analytics and reporting\nImplementing and maintaining ELT/ETL processes using tools like DBT and Fivetran\nOwning and optimising data warehousing (Snowflake) and ensuring efficient data management\nCollaborating with software engineers, product managers and business stakeholders to understand data needs and deliver high-quality, accessible datasets\nEstablishing best practices for data governance, quality, documentation and version control\nIdentifying opportunities to improve data accessibility and driving automation in data workflows\n\n✅ Must have requirements:\nStrong proficiency in SQL and DBT\nAt least intermediate proficiency in Python and Git\nExperience designing, building and maintaining data pipelines\nFamiliarity with date warehousing architecture and implementation\nVisualisation experience, ideally with Tableau\n\n👍 Bonus points for:\nExperience with Fivetran and Snowflake\nFamiliarity with cloud infrastructure (ideally AWS)\nExperience with Terraform and Docker\n\n🛂 Please note: unfortunately, this role does not offer VISA sponsorship.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Technology, Information and Media",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-analytics-engineer-at-wave-talent-4190843332?position=18&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PtDcaedEt9usM0dr0OXqGg%3D%3D"
    },
    {
        "title": "Business Analyst",
        "company": "TXM Recruit",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-txm-recruit-4207394466?position=19&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=ta3JCE4vHhOtLZjq5LUKKg%3D%3D",
        "scraped_at": "2025-04-15 21:42:29",
        "description": "Job Title: Business Analyst – IT\nLocation: London (Hybrid)\nSalary: £65,000 + Bonus + Excellent Benefits\n\nAre you an experienced Business Analyst ready to make an impact on high-profile digital transformation initiatives? This is a unique opportunity to join a forward-thinking organisation undergoing a major IT transformation, with a multi-year roadmap to modernise its entire technology estate.\n\nThe Opportunity\nOur client is delivering a broad portfolio of change across every business function—spanning customer experience, commercial, operations, finance, and HR. With numerous new and ongoing projects, they are expanding their Business Analysis function and looking for skilled professionals to help drive innovation and business value.\nYou'll play a critical role in bridging the gap between business stakeholders and solution delivery teams, ensuring that requirements are accurately captured, well-understood, and successfully delivered.\n\nWhat You’ll Be Working On\nYou'll contribute to projects such as:\nRedeveloping customer-facing websites\nDriving efficiencies through robotic process automation and AI\nRolling out new IT service management capabilities\nSupporting large-scale enterprise integrations with 3rd-party suppliers\nEnhancing commercial and operational performance through modern tech solutions\n\nThis is part of a wider transformation to a digital-first, cloud-enabled operating model designed to accelerate time-to-value and embed innovation at the core of the business.\n\nAbout You\nYou’re a seasoned Business Analyst who thrives in complex, fast-paced environments. You bring a strategic mindset, strong attention to detail, and the ability to align diverse stakeholder groups around a shared vision. You’re also confident navigating both Agile and Waterfall methodologies, and adept at leading cross-functional workshops.\n\nKey Requirements\nProven experience as a Business Analyst within large-scale IT or digital transformation programmes\nTrack record of working on complex integration projects, especially involving 3rd-party suppliers\nStrong stakeholder management and facilitation skills, including experience working with senior business leaders\nExcellent verbal and written communication skills\nDeep experience in process engineering and requirement documentation\n\nWe’d love to hear from you even if you don’t meet every requirement!",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Research, Analyst, and Information Technology",
        "industries": "Staffing and Recruiting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-analyst-at-txm-recruit-4207394466?position=19&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=ta3JCE4vHhOtLZjq5LUKKg%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "Perch Group",
        "location": "Blackpool, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-perch-group-4210909975?position=20&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2BZJlvpUpmprL027dAG5ZsQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:30",
        "description": "📢Perch Group are searching for a Senior Data Engineer.\n\nAt Perch Group, our vision is clear: to lead the UK debt purchase and collection industry by harnessing cutting-edge technology to drive ethical, efficient, and data-driven debt resolution.\nOur annual mission is to empower hundreds of thousands of customers to positively engage with and resolve their outstanding debts. We do this through an empathetic and customer-centric approach that is at the heart of our success.\n\nTo support our ambitious growth agenda, Perch Group is expanding its development team and seeks a Senior Data Engineer. This permanent role will lead a team focused on delivering robust data solutions across our five businesses. You will leverage your deep expertise in traditional data engineering (database design, T-SQL) and Microsoft Azure's data services (Data Factory, Power BI, and pipelines) to address complex business challenges. We are looking for a candidate who can effectively translate business requirements into technical specifications and guide a team to successful implementation.\n\n💵£60,000-70,000 + up to 20% of your annual salary, paid as a bonus.\n📍This role is based at our Blackpool office. We offer hybrid working options.\n\nYou'll make a major contribution by demonstrating…\n\nAccountabilities\n\nTechnical Leadership & Mentorship\nProvide technical leadership and guidance to the data engineering team, fostering a culture of technical excellence and innovation.\nMentor junior engineers, sharing technical expertise and best practices to enhance their skills and knowledge.\n\nData Architecture & Design\nArchitect and implement robust designs, ensuring optimal performance, scalability, and security.\nTranslate high-level solution designs into detailed technical specifications, including data models, ETL processes, and database schemas.\nEstablish and enforce data modelling best practices, promoting data integrity and consistency across all platforms.\n\nETL Development & Optimization\nDevelop and optimize complex ETL pipelines for diverse data sources (on-premise and cloud-based), utilizing best practices for data extraction, transformation, and loading.\nImplement data quality checks and validation processes within ETL pipelines, ensuring data accuracy and reliability.\nOptimize ETL performance for speed and efficiency, addressing bottlenecks and improving data processing times.\n\nData Platform Management & Governance\nMaintain and enhance the company's data platforms, ensuring high availability, performance, and security.\nImplement data governance policies and procedures, ensuring compliance with data quality standards and regulatory requirements.\nDesign and implement data observability and data quality monitoring solutions, enabling proactive identification and resolution of data issues.\n\nMeasures\n\nETL Performance Metrics\nMeasured by ETL pipeline execution time, throughput, and resource utilization.\nPerformance of database query optimisation and data retrieval.\n\nData Quality & Accuracy\nMeasured by data accuracy rates, data validation pass rates, and the number of data quality incidents.\nAccuracy of business logic and ETL conversion.\n\nDelivery Efficiency & Timeliness\nMeasured by the speed and efficiency of data solution delivery, including adherence to project timelines and milestones.\nSpeed of delivery.\n\nCode Quality & Reusability\nMeasured by code review metrics, adherence to coding standards, and the level of code reusability.\n\nBehaviours\n\nTechnical Passion & Innovation\nDemonstrates a strong passion for data technologies and a commitment to staying up-to-date with the latest trends and best practices.\nProactively seeks out opportunities to improve data processes and leverage new technologies.\n\nProblem-Solving & Best Practices\nPossesses a strong problem-solving mindset, with the ability to identify and resolve complex technical challenges.\nAdheres to and promotes data engineering best practices, ensuring code quality, performance, and maintainability.\n\nContinuous Learning & Growth\nEmbraces a growth mindset, with a strong desire for continuous learning and professional development.\nActively seeks out opportunities to expand technical skills and knowledge.\n\nTechnical Communication & Collaboration\nCommunicates technical concepts clearly and effectively to both technical and non-technical audiences.\nCollaborates effectively with cross-functional teams, fostering a positive and productive work environment.\nConfident communicator, who can articulate problems and solutions just as clearly to the executive team as to engineering teams.\n\n\n\nYou should apply for this role if you have the following experience…\n\nEssential\n\nMinimum 5+ years of experience in designing and implementing data ETL processes and design.\nExpert-level proficiency in T-SQL, SSIS, and the Microsoft data stack (SQL Server, Azure SQL Database).\nProven experience in designing and implementing data models and database schemas for complex data environments.\nStrong understanding of data quality principles and best practices, with experience implementing data governance policies.\nDemonstrated ability to troubleshoot and resolve complex data-related issues.\nStrong analytical and problem-solving skills.\nStrong teamwork, interpersonal and collaboration skills with colleagues and clients.\n\nDesirable\n\nProficiency in Azure Active Directory for managing identities and service principals.\nExperience with Azure DevOps for CI/CD pipeline development and data operations (DataOps).\nExperience with Python or other relevant coding languages.\nExperience with Data Observability tools.\n\n\n⌛️The Application Timeline\n\nA first stage video call with the internal recruitment team (15 minutes)\nA second stage call with the hiring manager (15 minutes)\nA face to face or video call with the hiring manager (45 minutes - 60 minutes)\n\nTypically, the average successful applicant will be within this timeline for 2-3 weeks. Please note we will close this role once we have enough applications for the next stages therefore you should submit your application asap to avoid any disappointment.\n\nIf you do not receive a response after 3 weeks of applying, please assume you have been unsuccessful as we may experience a high volume of applications.\n\nIf you have any questions or suggestions of how we can assist you in your application due to disability or personal reasons, please email recruitment@perchgroup.co.uk.\n\nWhat’s In It For You\n\n💵 £60,000-70,000 + up to 20% of your annual salary, paid as a bonus.\n📍This role is based at our Blackpool office. We offer hybrid working options.\n⏰ 37.5 hours per week. We offer flexible working hours between our core hours of 8am- 6pm, Monday to Friday.\n🎓 The opportunity to complete formal qualifications and learn on the job in a successful, growing organisation.\n➕ And many more benefits to support your wellbeing and professional development.\n\nWe are an equal opportunities employer\n\nWe’re an equal opportunity employer. All applicants will be considered for employment without attention to age, ethnicity, religion, sex, sexual orientation, gender identity, family or parental status, national origin, or veteran, neurodiversity or disability status.\n\nAt Perch, our strength lies in our team, their enthusiasm, and their passion for the business. Whether you’re looking to gain foundational skills in financial services, have a knack for customer service, or seek to expand your horizons, we likely have the perfect opportunity for you.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-perch-group-4210909975?position=20&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2BZJlvpUpmprL027dAG5ZsQ%3D%3D"
    },
    {
        "title": "Information Technology Auditor",
        "company": "Lutine Bell",
        "location": "Edinburgh, Scotland, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/information-technology-auditor-at-lutine-bell-4183931288?position=21&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=xALrVET9W50T2XR69u3VGQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:31",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/information-technology-auditor-at-lutine-bell-4183931288?position=21&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=xALrVET9W50T2XR69u3VGQ%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "TLP Consultancy Ltd",
        "location": "Epsom, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-tlp-consultancy-ltd-4207605304?position=22&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=58vAUIVm3AgzZRBRbOlDOA%3D%3D",
        "scraped_at": "2025-04-15 21:42:33",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-tlp-consultancy-ltd-4207605304?position=22&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=58vAUIVm3AgzZRBRbOlDOA%3D%3D"
    },
    {
        "title": "Quantitative Researcher - Commodities",
        "company": "Algo Capital Group",
        "location": "Greater London, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/quantitative-researcher-commodities-at-algo-capital-group-4202849816?position=23&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=CBOwAhrjW18Xtj0%2B2koHKg%3D%3D",
        "scraped_at": "2025-04-15 21:42:34",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/quantitative-researcher-commodities-at-algo-capital-group-4202849816?position=23&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=CBOwAhrjW18Xtj0%2B2koHKg%3D%3D"
    },
    {
        "title": "Chief Technology Officer",
        "company": "MBN Solutions",
        "location": "United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/chief-technology-officer-at-mbn-solutions-4207384537?position=24&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ehdjc8k08oLTPlT87yKmHw%3D%3D",
        "scraped_at": "2025-04-15 21:42:35",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/chief-technology-officer-at-mbn-solutions-4207384537?position=24&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ehdjc8k08oLTPlT87yKmHw%3D%3D"
    },
    {
        "title": "Data Protection Officer",
        "company": "c2c (Trenitalia c2c Ltd)",
        "location": "Greater London, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-protection-officer-at-c2c-trenitalia-c2c-ltd-4210685269?position=25&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2B2vuPmUXtkZcdO3h8w6pFQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:36",
        "description": "The Role:\n\nTo lead, develop, implement, revise and oversee the c2c data protection programme. The successful candidate will be responsible for implementing policies and procedures, and monitoring compliance and data practices internally, to ensure the business and its functions comply with the requirements of applicable data protection regulations and that the compliance programme is effective in preventing, identifying, detecting, and correcting any non-compliance.\nResponsibilities:\nManaging compliance with statutory requirements imposed by the Data Protection Act (DPA 2018) and other applicable UK data protection legislation / regulations.\nDevelop and update data protection policies and procedures ensuring compliance with legislation and incorporating the Information Commissioner’s Office best practice and guidance.\nReview tender and new supplier submissions with other relevant functions including procurement and information security teams.\nManagement of data protection assessment’s including providing advice and guidance to ensure risks are mitigated to an acceptable level.\nManagement of the process for data subjects to exercise their individual data rights and manage the response process.\nPerforming duties and obligations pertaining to privacy compliance for the business.\nManagement of the data protection employee training and awareness framework.\nManage the completion of Freedom of Information requests.\nManage an assurance program and related audits.\nConduct data protection impact assessments (DPIAs)\nOversee the maintenance of records (Processing Activities / ICO’s Accountability Framework etc.) required to demonstrate DP compliance.\nImplement the data incident response and data breach notification procedures, making an assessment whether a personal data breach meets the threshold for escalation to the ICO and support with risk mitigation advice.\nManage the relationships with, and company reporting to, relevant Data Protection Authorities.\nManagement of the data protection team to ensure compliance goals are achieved.\n\nSkills Required:\n\nExpert knowledge of relevant data privacy legislation and enforcement regimes in the UK, and a good understanding of other major privacy frameworks.\nSufficient knowledge of information technology and data management systems required.\nAbility to effectively communicate data protection issues to senior managers, employees, and data subjects and building strong relationships with stakeholders.\nAbility to manage time well, prioritise effectively, and handle multiple deadlines.\nPragmatic in devising actions and solutions to mitigate privacy risks.\nStrong influencing skills to obtain management commitment to implement mitigating actions.\nAble to gain a detailed understanding of the business and assess c2c’s internal/external risk profile and regulatory obligations.\nGood people management skills, able to motivate, inspire and coach staff effectively.\nAbility to manage confidential and sensitive information with the appropriate\ndiscretion.\nAbility to work independently/autonomously avoiding any conflicts of interest.\n\nRequired Experience:\nData Protection and/or Privacy certification such as, IAPP CIPP-E, CIPM, essential. Looking to work towards the Certified AI Governance Professional (AIGP)\nProven experience in developing and implementing data protection policies, procedures, and processes to ensure compliance with data protection legislation.\nPost qualifying experience in managing or advising on similar programmes essential.\nStrong understanding of risk management.\nKnowledge of Freedom of Information Act 2000, Human Rights Act 1998, Protection of Freedom Act 2012, Data Protection Act (DPA 2018) and the United Kingdom - General Data Protection Regulation (UK-GDPR).\nExperience in developing policy and compliance training.\nExperience in dealing with Data Protection Authorities and industry bodies.\nExperience in managing data incidents and breaches.\nKnowledge of cybersecurity risks and information security standards.\n\nData Governance Business Partner\nThe Role:\nThe Data Governance Business Partner will be responsible for implementing data protection policies, managing data breach responses, conducting regular audits, training sessions, records of processing activities, data protection assessments and supporting the DPO in compliance activities.\nResponsibilities:\nReviewing and update of data protection related policies and procedures.\nParticipation and taking the lead in the production and regular review of Data Protection Impact Assessments, Legitimate Interest Assessments, Transfer Risk Assessments, Supplier Assessments and maintaining an up-to-date Accountability Framework Assessment.\nDay to day management of Subject Access Requests and Freedom of Information Requests.\nReviewing with relevant line managers and data owners the businesses Records of Processing Activities.\nProduce and manage data protection training material. Deliver training face to face and or on-line to employees at all levels of the business.\nAssist in managing, recording and reporting of any personal data incidents.\nSkills Required:\nKnowledge of UK data privacy legislation and enforcement regimes.\nBroad knowledge of information technology and data management systems and procedures.\nGood communications skills at all levels.\nManagement of time critical activities, priorities affectively and able to achieve multiple deadlines for activities and tasks.\nAble to prepare training material and undertake training of others.\nExperience Required:\nData Protection and/or Privacy certification such as, IAPP CCIP-E and CIPM essential.\nPrevious experience of working in a data protection role.\nPrevious experience in data protection assessments.\nFamiliarity with data processing systems, information security practices and technical measures to protect personal data.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "General Business",
        "industries": "Rail Transportation",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-protection-officer-at-c2c-trenitalia-c2c-ltd-4210685269?position=25&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2B2vuPmUXtkZcdO3h8w6pFQ%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "Wave Talent",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-wave-talent-4193425882?position=26&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=XMuVY0%2BoI6KVbk%2Fv3dn5ag%3D%3D",
        "scraped_at": "2025-04-15 21:42:37",
        "description": "💻 Job Title: Senior Data Engineer\n💰 Salary: up to ~£110k + very generous equity (of the same value as your salary!)\n📍 Location: Shoreditch (2 office days/week)\n💵 Industry: FinTech / Payments\n\nHaving raised over £7m at seed stage, this FinTech company is shaking up the payments space with their innovative real-time price comparison solutions, making card payments a lot fairer and cheaper for smaller businesses and their customers 🤝\n\nWith a host of very impressive investors backing this venture, and working in collaboration with the world's largest players in payments, this company is causing the biggest change to how businesses access card payments in over two decades.\n\nAs the company is gearing up for Series A funding, they're looking expand their Data team to leverage a vast amount of data they're collecting from their clients on daily basis and turn this into valuable insights and analytics.\n\n✅ Must have requirements:\nPython\nSQL\nExpertise designing and maintaining ETL/data pipelines\nCloud infrastructure - AWS is highly desirable, but GCP and Azure backgrounds are also ok\nTerraform\nExperience working in a small, fast-growing start-up (ideally having gone from Seed to Series A growth stage)\n\n👍 Bonus points for:\nFamiliarity with AI / experience working with AI products\nExperience with data orchestration and data warehousing\nExperience with DBT\nUnderstanding of Business Intelligence and Data Science\nStrong academic background\n\n🛂 Please note: unfortunately, this role does not offer VISA sponsorship.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-wave-talent-4193425882?position=26&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=XMuVY0%2BoI6KVbk%2Fv3dn5ag%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "DATAHEAD",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-datahead-4209830922?position=27&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RtYdeFqO6kmXa98wK8j2%2BQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:38",
        "description": "Senior Data Engineer\nLocation: London | Hybrid\nTech Stack: Azure | Synapse | Databricks | Power BI\nCloud Focus: Cloud-native + hybrid integration\nSalary: £80,000 - £100,000 + 20% bonus\n\nWe’re hiring a Senior Data Engineer on behalf of a global financial services firm undergoing large-scale digital and cloud transformation. This role sits at the intersection of cloud-native architecture and legacy system integration, and is critical to building scalable, secure data solutions using the Azure ecosystem.\n\nYou’ll work across modern and hybrid environments, lead pipeline development, and play a hands-on role in shaping the firm’s data engineering framework — with real impact on decision-making, performance, and productivity.\nWhat You’ll Do\nLead the design and build of end-to-end data pipelines on Azure Synapse and Databricks.\nWork with DevOps and Architecture teams to ensure seamless integration between cloud and legacy on-prem systems.\nContribute to a cloud-native data engineering framework built around a “single version of the truth.”\nCreate and govern analytical data sets that power self-serve insights across the business.\nDeliver clean, secure, and scalable code using SQL, Python, and DAX in a Spark environment.\nCollaborate with data architects and analysts to ensure data products are aligned to user needs.\nMaintain documentation and champion data quality, validation, and best practices.\nSupport and mentor engineers, and contribute to code reviews and standards.\n\nWhat You Bring\nStrong hands-on experience with Azure Data Factory, Synapse, Databricks, and Power BI.\nSolid SQL and DAX skills; basic Python for Spark environments is a plus.\nExperience building pipelines in a lakehouse architecture with hybrid on-prem/cloud data sources.\nKnowledge of DevOps concepts within a data engineering environment.\nDeep understanding of data modelling, warehousing, and visualisation for analytics.\nExposure to financial services or insurance environments is preferred.\nComfortable navigating complexity, legacy integration challenges, and fast-paced change.\n\nWhy This Role?\nOwn critical engineering work across a modern Azure stack\nInfluence the integration strategy between legacy systems and cloud platforms\nBe part of a business making bold investments in data and technology\n\nPlease Apply!",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Financial Services and Insurance",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-datahead-4209830922?position=27&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RtYdeFqO6kmXa98wK8j2%2BQ%3D%3D"
    },
    {
        "title": "Lead Data Engineer",
        "company": "Peaple Talent",
        "location": "Sunderland, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/lead-data-engineer-at-peaple-talent-4207333742?position=28&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fHpWJKWATtKLJX9LKZrYsA%3D%3D",
        "scraped_at": "2025-04-15 21:42:39",
        "description": "Peaple Talent has partnered with a global digital engineering consultancy who are recruiting for a Lead Data Engineer on a permanent basis based out of their Sunderland office. You will have a great understanding of technology consultancy services along with fantastic communication and stakeholder engagement skills as this role will be client facing.\n\nSkills and experience:\nProven experience as a Lead Data Engineer with a focus on Azure cloud services.\nExperience of managing small teams whilst also being hands-on.\nStrong database fundamentals including SQL/TSQL, performance and schema design.\nExperience architecting and building data applications using Azure, specifically a Data Warehouse and/or Data Lake.\nTechnologies:\nAzure Data Factory, Azure Synapse Analytics, Azure Data Lake, Azure Databricks and Power BI. Experience with creating low-level designs for data platform implementations.\nETL pipeline development for the integration with data sources and data transformations including the creation of supplementary documentation.\nProficiency in working with APIs and integrating them into data pipelines.\nStrong programming skills in Python.\nExperience of data wrangling such as cleansing, quality enforcement and curation e.g. using Azure Synapse notebooks, Databricks, etc.\nExperience of data modelling to describe the data landscape, entities and relationships.\nExperience with data migration from legacy systems to the cloud.\nExperience with Infrastructure as Code (IaC) particularly with Terraform.\nProficient in the development of Power BI dashboards.\nStrong focus on documentation and diagramming (e.g. ERDs).\nStrong communication and teamwork skills to collaborate with cross-functional teams effectively.\n\nIt would be great if you have:\nAzure Data Fundamentals DP-900 certification.\nAzure Fundamentals AZ-900 certification.\nGood knowledge of data governance, data quality, security, metadata cataloguing and Master Data Management.\nMachine Learning and AI development experience\n\nBenefits:\nUp to 10% bonus (based on company and personal performance).\nAn employer pension scheme\n25 days holiday + 8 bank holidays, with the option to carry forward or 'cash-in' 5 days each year\nLife Insurance & Income protection\nEnhanced Maternity Pay & Paternity Pay\nCycle to work scheme\nTravel loan scheme\nA Tech Scheme which lets you choose from over 5000 tech products at up to a 12% discount\nFree unlimited Udemy account for every employee to support their continuous learning and improvement",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/lead-data-engineer-at-peaple-talent-4207333742?position=28&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fHpWJKWATtKLJX9LKZrYsA%3D%3D"
    },
    {
        "title": "Cyber Incident Response Consultant - UK - £60,000 to £100,000 + bonus + allowance",
        "company": "LT Harper - Cyber Security Recruitment",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/cyber-incident-response-consultant-uk-%C2%A360-000-to-%C2%A3100-000-%2B-bonus-%2B-allowance-at-lt-harper-cyber-security-recruitment-4207607328?position=29&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Xdz%2BPmqQ1UgCGkPH2ixY6Q%3D%3D",
        "scraped_at": "2025-04-15 21:42:40",
        "description": "Cyber Incident Response Consultant | Leading Global Consultancy\n\nOur client, a globally recognised consultancy with one of the most established and high-performing Cyber Incident Response teams in the UK, is looking to hire new incident response talent. As one of only 9 accredited Tier 1 responders in the UK, this team is trusted by major organisations to lead them through complex, high-stakes cyber incidents.\n\nThis is a standout opportunity to join a dynamic, growing team at the forefront of cyber defence. You’ll gain broad exposure across industries, work on some of the most significant incidents in the UK, and benefit from top-tier training and certifications.\n\n\nKey Responsibilities of a Cyber Incident Response Consultant:\n\nLead and coordinate response efforts for high-impact cyber incidents\nConduct forensic analysis of compromised systems, memory dumps, and network data.\nProvide clients with actionable insights on emerging threats and attacker tactics.\nCollaborate directly with stakeholders during response and recovery engagements.\nSupport pre-sales efforts by contributing to bids, proposals, and client pitches.\n\n\nKey requirements of a Cyber Incident Response Consultant:\n\nProven hands-on experience managing and investigating cybersecurity incidents. Ideally, 1-5 years in an incident response role.\nSolid understanding of networks, operating systems, and key programming/scripting concepts.\nFamiliarity with a wide range of security frameworks, tools, and methodologies.\nExcellent written, presentation, and interpersonal communication skills.\n\n\nDesirable Extras:\n\nSC or DV clearance, or a willingness to obtain it.\nCertifications like;\nCREST Certified Incident Manager (CCIM)\nGIAC Certified Incident Handler (GCIH)\nA degree (ideally postgraduate) in Cyber Security, Information Security, or a related STEM field.\n\nYou must be based in the UK to apply and be able to commute into a local office monthly.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology, Consulting, and Other",
        "industries": "IT Services and IT Consulting, Technology, Information and Internet, and Information Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/cyber-incident-response-consultant-uk-%C2%A360-000-to-%C2%A3100-000-%2B-bonus-%2B-allowance-at-lt-harper-cyber-security-recruitment-4207607328?position=29&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Xdz%2BPmqQ1UgCGkPH2ixY6Q%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "E-Resourcing Ltd - Specialist I.T. Recruitment",
        "location": "Epsom, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-e-resourcing-ltd-specialist-i-t-recruitment-4210692374?position=30&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=MPgi9%2FkjPFTzSHIxStka0w%3D%3D",
        "scraped_at": "2025-04-15 21:42:41",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-e-resourcing-ltd-specialist-i-t-recruitment-4210692374?position=30&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=MPgi9%2FkjPFTzSHIxStka0w%3D%3D"
    },
    {
        "title": "AI Engineer",
        "company": "ReCulture",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/ai-engineer-at-reculture-4207615032?position=31&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=j8ThCVCbJovjtmfbmUFX%2FQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:42",
        "description": "Founding Engineer\nLondon (hybrid)\n£80,000\n\nAbout ReCulture:\nAt ReCulture, we’re not your typical recruitment agency. We’re talent matchmakers - connecting top talent with environments where they’ll thrive. Our approach goes beyond the surface, focusing on behaviours and values as much as skills. Partnering with clients like an in-house team but moving at the speed of an agency, we deliver long-term impact by ensuring the right values fit.\n\nWe're looking for a highly skilled and innovative Founding Engineer to join our AI-driven startup. In this pivotal role, you'll take ownership of building and optimising our client’s backend systems, integrating LLM APIs, and ensuring a seamless user experience. If you thrive in a fast-paced, experimental environment and want to shape the future of AI-powered products, this is the opportunity for you.\n\nKey Skills and Responsibilities\nExpert-level Python development experience\nPrevious experience scaling chatbots with multiple agents\nProven experience with LLM APIs (OpenAI, Anthropic, or similar) developing advanced, non-trivial chatbots that go beyond simple LLM API calls, incorporating complex function calling, multi-step workflows, and dynamic tool integrations.\nStrong debugging skills.\nExperience working with MongoDB for chatbot memory and data storage\nAbility to think from a user's perspective, beyond just engineering tasks\nExperience integrating eCommerce APIs (Shopify, Wix, BigCommerce)\nDevelop, optimise, and maintain our architectural improvements for scalability and complex features\nFine-tune LLM APIs (OpenAI, Anthropic, etc.) to enhance chatbot functionality\nDebug complex technical issues across frontend, backend, and LLM interactions\nImplement prompt chaining and refining techniques to improve chatbot accuracy\nWork closely with the team to experiment with new AI tools and APIs (like DeepSeek)\nAutomate repetitive tasks, improve CI/CD pipelines, and enhance development efficiency.\n\nAPPLY NOW or email Elin@re-culture.co.uk",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Information Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/ai-engineer-at-reculture-4207615032?position=31&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=j8ThCVCbJovjtmfbmUFX%2FQ%3D%3D"
    },
    {
        "title": "Production Support Engineer - Buyside",
        "company": "Vertus Partners",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/production-support-engineer-buyside-at-vertus-partners-4207360603?position=32&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=dRM8lY2ckVP5nikutdHyRg%3D%3D",
        "scraped_at": "2025-04-15 21:42:44",
        "description": "My client, a global asset manager is looking to hire a Production Support Engineer to join their growing team where you'll provide front-office support across a number of markets.\n\nThis role is critical in maintaining the smooth operation of their OMS so if you're passionate about delivering technical support within a fast-paced trading environment whilst being surrounded by an array of talented professionals then this is the role for you.\nRequirements\n\nPrevious experience supporting trading environments including platforms and internal/external users\nStrong knowledge of Linux, FIX protocol and relational databases such as SQL Server\nExperience with OMS/PMS\nAbility to script in Python and/or Bash is a bonus\nFamiliarity with asset classes like Equities, Fixed Income, Futures, and FX",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/production-support-engineer-buyside-at-vertus-partners-4207360603?position=32&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=dRM8lY2ckVP5nikutdHyRg%3D%3D"
    },
    {
        "title": "Artificial Intelligence Engineer",
        "company": "MBN Solutions",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/artificial-intelligence-engineer-at-mbn-solutions-4207383624?position=33&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=18cHH3K0LhMtTC8O0riqHQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:45",
        "description": "AI Engineer – Startup (AI Consultancy) - London (Hybrid) Upto £95k +shares\n\nWe’re working with a fast growth AI Consultancy with offices in London, Manchester and Edinburgh. The business is under a year old and currently sitting at 50 people, generating revenue with a range of AI projects including fact extraction, conversational AI, Co-pilots, knowledge graphs, spanning across a variety of clients such as Investments, Insurance, F&B and CPG.\n\nThe founders have proven experience in building a consultancy from scratch and exiting, having previously built a Data Science consultancy and successfully sold to a ‘big 4’ , they are on course to replicate their success here.\n\nThis has fuelled rapid growth in the team and we are looking for AI Engineers of different experience levels to join us in building the business by developing end2end LLM products for our clients.\n\nWhat we’re looking for:\nWe’re looking for people that have experience building production ready AI solutions, to design, build and deploy AI solutions in collaboration with our clients. You’ll be applying some of the SOTA research in AI to develop applications. As such we would expect you to have:\n\nEffective communication skills\nBackground in foundational Computer Vision/NLP\nStrong Software Engineering skills (3 years+)\nDeveloped LLM architecture and deployed LLM applications\nUptodate with current trends in AI\nSome experience with applying latest techniques like RAG architecture, GenAI, Parallel training etc\n\nThe role is hybrid, with adhoc requirements to be on client premises (London) this could be between 1-5 days a week, so we would need someone that is flexible.\nThis is a fantastic opportunity to work on a broad range of problems, applying SOTA AI solutions, in a high growth business, set for success and you will be rewarded with:\n\nBase salary of upto £95k\nMeaningful EMI shares (our proven history speaks for itself)\n25 Days holiday\nStatutory pension contribution\nPrivate medical\n\nPlease note: you must be eligible to work in the UK to be considered for this position.\n\nInterested?\nIf you think you fit the bill, get in touch by clicking the ‘apply now’ button or get in touch with me by the following:\nEmail me at mo@mbnsolutions.com\nCall me on 02037736498",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology and Engineering",
        "industries": "IT Services and IT Consulting, Technology, Information and Media, and Software Development",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/artificial-intelligence-engineer-at-mbn-solutions-4207383624?position=33&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=18cHH3K0LhMtTC8O0riqHQ%3D%3D"
    },
    {
        "title": "AI Engineer",
        "company": "Tenth Revolution Group",
        "location": "United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/ai-engineer-at-tenth-revolution-group-4208021547?position=34&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fIMziS01aGmvqYWIhPce3A%3D%3D",
        "scraped_at": "2025-04-15 21:42:46",
        "description": "AI Engineering Consultant - Home-based - £55-60k\n\nPlease note - this role requires you to be based in the UK on a permanent basis with the unrestricted right to work in the UK. This organisation is not able to offer sponsorship now or at any time in the future.\n\nA well-respected Microsoft Consulting Partner are looking to recruit for talented AI Engineering Consultants to join their team and grow their AI practice in line with client demand and their strong pipeline of projects.\n\nIn this role you will be working as part of an agile team working closely with clients to support them with the implementation and optimisation of the latest AI technologies. As a Consultant you will work with clients to understand their business needs and then design appropriate AI solutions which will ensure success.\n\nThis will be a varied and challenging role. Your responsibilities will include:\n\nWork closely with clients to understand their business challenges and opportunities to apply AI driven solutions.\nWork as part of a team to develop models and algorithms using AI technologies.\nBe an AI tech champion who can provide expertise in AI technologies.\nCarry out necessary data analysis to ensure that data is prepared for AI modelling.\nTrack AI model performance, making necessary amendments.\nProvide clients with the necessary training around their AI tools.\n\nTo be a good fit for this role you should be an experienced individual who has worked within a data focused tech environment with a passion for AI technologies. You should have the following technical experience:\n\nExperience working within a Microsoft Azure cloud environment.\nStrong experience with Python.\nExperience with AI & Machine Learning technologies.\nAI framework & library experience.\n\nYou should have strong communication skills and feel confident dealing directly with clients to be a good fit for this role.\n\nThis role offers you the opportunity to work with the latest technologies on fascinating projects within an organisation who will give you the tools to progress and truly invest in your development. Your package will include:\n\nStarting salary of £55-60k perm annum.\nBonus of 10% paid annually.\n25 dedicated training days.\n\nTo apply for this role please submit your CV or contact David Airey on 0191 338 7508 or at d.airey@tenthrevolution.com.\n\nTenth Revolution Group are the go-to recruiter for Data & AI roles in the UK offering more opportunities across the country than any other recruitment agency. We're the proud sponsor and supporter of SQLBits, Power Platform World Tour, and the London Fabric User Group. We are the global leaders in Data & AI recruitment.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting, Science, and Information Technology",
        "industries": "IT Services and IT Consulting, Software Development, and IT System Data Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/ai-engineer-at-tenth-revolution-group-4208021547?position=34&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fIMziS01aGmvqYWIhPce3A%3D%3D"
    },
    {
        "title": "Corporate Credit Analyst",
        "company": "Roka Search",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/corporate-credit-analyst-at-roka-search-4210675690?position=35&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PGn3oOlMUcZb%2Fe4WCu0KaQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:47",
        "description": "𝗖𝗿𝗲𝗱𝗶𝘁 𝗥𝗶𝘀𝗸 𝗠𝗮𝗻𝗮𝗴𝗲𝗺𝗲𝗻𝘁\n\nLevel: AVP\nPrimary Coverage: Natural Resources - Oil, Gas, Commodity Traders\nJob Type: Permanent\nLocation: London, Hybrid Working\nRelevant Experience: Must have Investment Banking / Corporate Banking Experience\n\nWe are currently working with a leading global financial institution to recruit an Assistant Vice President (AVP) - Credit Risk Management for their Corporate Credit Risk Team in London. This is a second line of defence role, offering the opportunity to play a critical part in managing and mitigating credit risks across EMEA.\n\nOur client is looking for a proactive and analytical professional to provide oversight and detailed analysis of corporate credit transactions, ensuring robust risk management practices and supporting sustainable growth.\n\nKey Responsibilities\nCredit Analysis: Conduct structured reviews of Front Office credit applications, identifying and articulating risk issues and mitigations.\nRisk Appetite Communication: Clearly communicate the Credit Department’s risk perception and appetite for transactions, ensuring alignment with bank policies and procedures.\nFront Office Collaboration: Act as a trusted partner to Front Office deal teams, providing constructive challenge on risk issues while supporting timely client delivery.\nPortfolio Management: Ensure accurate obligor grading and forward-looking risk assessments within your assigned portfolio.\nEmerging Risk Monitoring: Proactively monitor and address emerging credit risks in collaboration with Front Office and other risk functions.\nSpecial Credits Oversight: Review Self-Assessment submissions and credit cost provisioning for Special Credits.\n\nYour Background\nQualifications: Degree-level education and/or relevant professional qualifications (e.g., ACA, ACCA, ACT, CFA).\nExperience: Some experience in a credit management role (1st or 2nd line), with strong corporate credit analysis skills.\nTechnical Knowledge: Familiarity with corporate loan products, trade finance products, and derivative products, including relevant documentation.\n\nSkills:\nExceptional written and verbal communication skills, with the ability to prepare clear and concise credit papers.\nStrong interpersonal skills, with a collaborative approach to teamwork.\nHigh level of IT literacy and proficiency in risk management tools.\n\n𝕎𝕙𝕪 𝕋𝕙𝕚𝕤 𝕆𝕡𝕡𝕠𝕣𝕥𝕦𝕟𝕚𝕥𝕪?\n\nHybrid Working: Enjoy the flexibility of hybrid working, balancing office collaboration with remote productivity.\nCareer Growth: Be part of a dynamic and supportive team, with opportunities for professional development and career progression.\nImpactful Work: Play a key role in shaping the bank’s credit risk strategy and ensuring sustainable growth.\nCompetitive Package: Benefit from a salary of up to £80,000, plus a comprehensive benefits package.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Research, and Finance",
        "industries": "Banking, Investment Banking, and Investment Management",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/corporate-credit-analyst-at-roka-search-4210675690?position=35&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PGn3oOlMUcZb%2Fe4WCu0KaQ%3D%3D"
    },
    {
        "title": "Forensic Accountant - Assistant Manager AND Manager",
        "company": "SJC Partners",
        "location": "Manchester Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/forensic-accountant-assistant-manager-and-manager-at-sjc-partners-4207336881?position=36&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=VL5S%2BK6qkiyvthX0kxu0gA%3D%3D",
        "scraped_at": "2025-04-15 21:42:48",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/forensic-accountant-assistant-manager-and-manager-at-sjc-partners-4207336881?position=36&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=VL5S%2BK6qkiyvthX0kxu0gA%3D%3D"
    },
    {
        "title": "Senior Business Analyst",
        "company": "Bruin",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-bruin-4207352081?position=37&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gOCrFudm1Rr6FVe0jlqlAw%3D%3D",
        "scraped_at": "2025-04-15 21:42:49",
        "description": "A boutique alternative investments firm based in London, require a Senior Business Analyst / Systems Analyst to join their investments project team on a permanent basis.\n\nThe business are private markets / assets focused and the project teams manages all of the change and transformation initiatives across their technology. They have a suite of alternative investment specific applications that this team support from an implementation and upgrade perspective.\n\nThe current major programmes are centered around data transformation, new systems roll outs and target operation model design/implementation.\n\nThe ideal candidate will have:\n\ngood experience across Private Markets / Assets, Private Credit, Private Debt or Private Equity change and transformation - ESSENTIAL\nexcellent business analysis skills and experience gained working on investment systems or projects.\ngood project management and relationship management skills.\ngood technical skills around SQL, ETL, business intelligence and data transformation.\nexperience upgrading or implementing new systems / applications",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Information Technology, and Project Management",
        "industries": "Investment Management and Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-bruin-4207352081?position=37&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gOCrFudm1Rr6FVe0jlqlAw%3D%3D"
    },
    {
        "title": "Transformation Consultant",
        "company": "Tarka Talent",
        "location": "England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/transformation-consultant-at-tarka-talent-4207611361?position=38&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=JuAamwYV92HbS7nhFszOVQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:50",
        "description": "Transformation Consultant\nManager, Senior Manager, Director\n£80,000 - 140,000\nHybrid, flexible working\n\nI am partnered with a high-growth SaaS organisation in the Energy sector who are heavily growing their transformation consulting team.\n\nThey are looking for experienced consultants from Manager to Director grade to join their team to run business transformation projects with their clients. They will work closely with the project and programme managers that complete the tech implementations of the SaaS platform within their clients' businesses, however they support the projects with regards to broader business change elements across the full project lifecycle.\n\nIf you are keen to make a move inhouse, this role provide more ownership as you will be more involved post-implementation. There is also no sales element, due to the presence of a separate internal sales team, so this is a delivery-focused role.\n\nRequirements:\nConsulting experience, ideally at the Big 4 or similar\nInterest to move out of consulting\nExperience leading transformation projects, ideally in the energy/utilities/resources/telco sector\nBonus:\nExperience with SaaS platforms or tech businesses\nExposure to tech implementation projects\nBegan in a respected graduate programme\n\nLogistics:\nAt least 3 days working from home a week\nA few days a month in Nottingham\nMay be some travel to clients\n\nBenefits include pay reviews annually linked to performance, discretionary bonus, private healthcare, and gym membership.\n\n------\n\nRegretfully, due to a high volume of applicants, we are only able to reply to those who are successful.\n\nEqual Opportunities:\n\nWe are committed to promoting equality of opportunity for all employees and job applicants. In line with the Equality Act 2010, we strive to create and maintain a working environment in which everyone is able to make the best use of their skills, free from discrimination or harassment, and in which all decisions are based on merit. No person is subjected to any less favourable treatment on any discriminatory grounds on the basis of age, disability, gender reassignment, marital or civil partner status, pregnancy and maternity, race, colour, nationality, ethnic or national origin, religion or belief, sex or sexual orientation.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting",
        "industries": "Business Consulting and Services, Utilities, and Services for Renewable Energy",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/transformation-consultant-at-tarka-talent-4207611361?position=38&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=JuAamwYV92HbS7nhFszOVQ%3D%3D"
    },
    {
        "title": "Senior Business Analyst",
        "company": "Perch Group",
        "location": "Blackpool, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-perch-group-4210902057?position=39&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=JEJwrqRjhxVfbieUNWH8lQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:51",
        "description": "Perch Group are searching for a Senior Business Analyst.\n\nAt Perch Group, our vision is clear: to lead the UK debt purchase and collection industry by harnessing cutting-edge technology to drive ethical, efficient, and data-driven debt resolution.\n\nOur annual mission is to empower hundreds of thousands of customers to positively engage with and resolve their outstanding debts. We do this through an empathetic and customer-centric approach that is at the heart of our success.\n\n💵 Salary £40,000 - £60,000 DOE + up to 20% of your annual salary, paid as a bonus.\n📍 This role can be based at our Blackpool, Skipton, or Manchester offices\n\n\nRole Overview\n\nAs a Senior Business Analyst at Perch Group, you will play a key role in driving strategic change across the organisation by supporting the Transformation Director in shaping the Business Analysis practice within the Change Management Framework. You will work across multiple strategic programmes and smaller projects, ensuring the effective identification, documentation, and delivery of business requirements that align with the company’s objectives.\n\nThe role is hybrid, with the opportunity to work from the Blackpool, Skipton, and Manchester offices. The successful candidate will have experience in financial services or a similar regulated environment and will be instrumental in improving the efficiency and effectiveness of project delivery through rigorous business analysis practices.\n\n\nKey Responsibilities\n\nBusiness Analysis Framework Development\n\nSupport the Transformation Director in developing and refining the Business Analysis practice within the Change Management Framework.\nSupport with wider CIO Leadership Team in defining the Business Analysis role within an Agile focussed delivery process.\nEstablish and document best practices, methodologies, and tools for business analysis to ensure consistency and effectiveness.\nDefine and maintain business analysis standards aligned with industry best practices and regulatory requirements.\n\nStrategic Programme & Project Delivery\n\nProvide business analysis across multiple strategic programmes and smaller projects, ensuring requirements are captured, documented, and communicated effectively.\nCollaborate with Business Owners, Project Managers, Scrum Masters, and technical teams to define project scope and objectives.\nConduct detailed process analysis, stakeholder workshops, and data analysis to identify business needs and opportunities.\nTranslate business requirements into clear, actionable deliverables for development teams and stakeholders.\n\nProcess Improvement & Methodology Adherence\nIdentify opportunities to improve the delivery of strategic programmes and projects through better analysis and adherence to recognised business analysis methodologies.\nEnsure effective governance, traceability, and validation of requirements throughout the project lifecycle.\nPromote the use of structured techniques such as BPMN, Lean, and Six Sigma where applicable to enhance business processes.\nBusiness Systems & Solution Design\nSupport the design and development of key business systems and solutions that align with Perch Group’s strategic goals.\nWork closely with stakeholders to assess system requirements and recommend optimised solutions.\nFacilitate workshops and stakeholder engagement sessions to gather insights and validate solution designs.\n\nCapability Development & Upskilling\nSupport the upskilling of the Perch Business Analysis capability by mentoring and coaching colleagues.\nAssist in developing training materials and frameworks to enhance the effectiveness of business analysis across the organisation.\nShare knowledge and insights on best practices, methodologies, and emerging trends in business analysis.\n\n\nRequired Skills and Experience\n\nBusiness Analysis Expertise\nProven experience as a Senior Business Analyst, preferably within financial services or a regulated industry.\nStrong understanding of business analysis methodologies, frameworks, and best practices.\nExperience with requirements gathering, process mapping, and solution design.\n\nStakeholder Management & Communication\nExcellent stakeholder engagement skills with the ability to influence and challenge effectively.\nStrong communication skills, with the ability to present complex information clearly to different audiences.\nExperience working with Business Owners, Transformation teams, and technical teams to align project goals.\n\nChange Management & Process Improvement\nExperience in supporting change initiatives and embedding business analysis within structured change frameworks.\nAbility to analyse existing business processes and recommend improvements.\nFamiliarity with Agile, Waterfall, and hybrid project methodologies.\n\nTechnical & Analytical Skills\nAbility to translate business requirements into functional specifications for technology teams.\nStrong data analysis and process mapping skills.\nExperience with business analysis tools such as JIRA, Confluence, Visio, or equivalent.\n\nQualifications\nBCS Diploma in Business Analysis or equivalent qualification.\nAgile certifications (e.g., Certified Agile Business Analyst, SAFe Agilist) are desirable.\nLean Six Sigma (Green Belt or higher) is advantageous.\n\n\nWhat's In It For You\n\n£40,000 - 60,000 DOE + up to 20% of your annual salary, paid as a bonus.\nHybrid working model with flexibility across our Blackpool, Skipton, and Manchester offices.\nA collaborative and dynamic work environment.\nThe opportunity to complete formal qualifications and learn on the job in a successful, growing organisation.\nAnd many more benefits to support your wellbeing and professional development.\n\n\nWe are an equal opportunities employer\n\nWe’re an equal opportunity employer. All applicants will be considered for employment without attention to age, ethnicity, religion, sex, sexual orientation, gender identity, family or parental status, national origin, or veteran, neurodiversity or disability status.\n\nAt Perch, our strength lies in our team, their enthusiasm, and their passion for the business. Whether you’re looking to gain foundational skills in financial services, have a knack for customer service, or seek to expand your horizons, we likely have the perfect opportunity for you.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-business-analyst-at-perch-group-4210902057?position=39&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=JEJwrqRjhxVfbieUNWH8lQ%3D%3D"
    },
    {
        "title": "Supply Chain Analyst",
        "company": "Alfa-Executive Solutions",
        "location": "Birmingham, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/supply-chain-analyst-at-alfa-executive-solutions-4210910984?position=40&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=DpeiaCc72kZTSJbielfvww%3D%3D",
        "scraped_at": "2025-04-15 21:42:53",
        "description": "Supply Chain Analyst\nLocation: West Midlands, UK\nSalary: Competitive, based on experience\nType: Full-time\n\nOur client is a leading distribution company with a Pan European presence.\nDue to the successful implementation of a bold growth strategy, this has now created an exciting opportunity for a Supply Chain Analyst in the West Midlands!\nThe Role:\nAs a Supply Chain Analyst, you will play a crucial role in analysing our end-to-end supply chain, identifying areas for improvement, and driving efficiency gains. You will be responsible for collecting, interpreting, and presenting data to support strategic decision-making and enhance our overall supply chain performance.\n\nKey Responsibilities:\nGather and analyse supply chain data (e.g., procurement, inventory, logistics) to identify trends, patterns, and potential issues.\nIdentify inefficiencies and bottlenecks within the supply chain and propose data-driven solutions for optimisation.\nEvaluate supplier performance and identify opportunities for cost reduction and improved service.\nCollaborate with internal teams (e.g., procurement, logistics, sales) to implement process improvements and achieve supply chain objectives.\nSupport the implementation of new supply chain systems and tools.\nContribute to projects aimed at enhancing supply chain resilience and mitigating risks.\n\nAbout You:\nProven experience (typically 1-3 years) in a supply chain analysis role or similar analytical position.\nStrong analytical and problem-solving skills with the ability to interpret complex data.\nExcellent proficiency in data manipulation and analysis tools, particularly Microsoft Excel (advanced level).\nExperience with ERP systems (e.g., SAP, Oracle) and data visualisation tools (e.g., Power BI, Tableau) is highly desirable.\nSolid understanding of supply chain principles and best practices.\nStrong communication and presentation skills with the ability to convey findings clearly and concisely to various stakeholders.\nAbility to work independently and as part of a team in a fast-paced environment.\nDetail-oriented with a commitment to accuracy.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Distribution, Supply Chain, and Analyst",
        "industries": "Transportation, Logistics, Supply Chain and Storage and Appliances, Electrical, and Electronics Manufacturing",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/supply-chain-analyst-at-alfa-executive-solutions-4210910984?position=40&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=DpeiaCc72kZTSJbielfvww%3D%3D"
    }
]