[
    {
        "title": "Data Analyst",
        "company": "Explore Group",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=1&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2F3naK8RtwyKGJtXA4YkCrA%3D%3D",
        "scraped_at": "2025-04-15 21:42:10",
        "description": "Data Analyst\n***MUST HAVE MARITIME EXPERIENCE***\n\nWe're looking for a skilled Data Analyst to turn complex data into clear insights that drive business performance. If you're passionate about data storytelling, automation, and impact, this is the role for you.\n\nResponsibilities:\nExtract, validate, and analyze large data sets for trends and insights\nBuild dashboards and reports (Power BI, Excel) to support decision-making\nCollaborate with stakeholders to define data requirements\nAudit data quality and ensure integrity across sources\nAutomate recurring reports and improve analytics workflows\n\nWhat we’re looking for:\n6+ years of experience in data analytics\nAdvanced Excel (VBA, Macros), Power BI, SQL, PowerPoint\nStrong statistical and analytical mindset\nBachelor’s/Master’s in Mathematics, Statistics, or related field\nBonus: Experience with automation tools and data audit processes",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Maritime Transportation",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analyst-at-explore-group-4207348212?position=1&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2F3naK8RtwyKGJtXA4YkCrA%3D%3D"
    },
    {
        "title": "Business Data Analyst",
        "company": "McGregor Boyall",
        "location": "Belfast, Northern Ireland, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-data-analyst-at-mcgregor-boyall-4208879156?position=2&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RspOHjJB1BBf0XDT7mayAg%3D%3D",
        "scraped_at": "2025-04-15 21:42:10",
        "description": "Business Data Analyst\nBelfast\n\nWe are currently seeking an experienced Business Analyst & Data Specialist to join a high-profile Front Office Risk & Control function within a globally recognised financial institution. This role offers the opportunity to contribute to the enhancement of booking controls across a full spectrum of traded products, ensuring the accuracy, integrity and risk alignment of front-office trade activity.\n\nKey Details\nStart Date: ASAP\nDuration: Until 31/12/2025\nLocation: Belfast\nPay Rate: Up to £600/day (Inside IR35)\n\nAbout the Team\nYou will be part of a dedicated in-business risk and control group responsible for the design, implementation, and monitoring of trade booking controls. The team operates across all global markets businesses and works closely with Sales & Trading, Technology, Operations, Compliance, and Audit.\n\nKey Responsibilities of a Business Data Analyst:\nAnalyse booking processes and trade data flows to assess control gaps and data suitability.\nDefine business requirements for reporting, metrics, and monitoring tools.\nCollaborate with trading desks, technology teams and operations to support the delivery of new controls.\nProvide quality assurance through testing and data-driven control assessments.\nProduce management information (MI) and reports that evidence control performance and effectiveness.\nSupport audit reviews, investigate control issues, and contribute to continuous control enhancements.\nMaintain and update procedural documentation relating to ongoing monitoring and reporting activities.\n\nEssential Skills & Experience for a Business Data Analyst\nProven experience within Markets, ICG, or relevant functions such as risk, operations, product control or middle office.\nStrong understanding of traded products and trade lifecycle control principles.\nDemonstrable experience defining business requirements and managing technology delivery.\nConfident stakeholder management, with excellent written and verbal communication skills.\nStrong analytical mindset and problem-solving skills with a control-focused approach.\nAdvanced Excel capabilities; experience working with databases and large datasets.\nExperience with data analysis tools such as Python, Tableau or Power BI is highly desirable.\n\nDesirable Skills\nExperience working in a Front Office or trade control setting.\nProduct knowledge across Markets asset classes including Fixed Income and Derivatives.\nExposure to Manager Control Assessments (MCA) or similar internal risk frameworks.\n\n\nMcGregor Boyall is an equal opportunity employer and do not discriminate on any grounds.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst",
        "industries": "Banking",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-data-analyst-at-mcgregor-boyall-4208879156?position=2&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=RspOHjJB1BBf0XDT7mayAg%3D%3D"
    },
    {
        "title": "Data Engineer - Equity Trading - Quant Hedge Fund - £250k",
        "company": "Paragon Alpha - Hedge Fund Talent Business",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-equity-trading-quant-hedge-fund-%C2%A3250k-at-paragon-alpha-hedge-fund-talent-business-4209603327?position=3&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=pwOhfKKNiBmVxDA2nNRqEw%3D%3D",
        "scraped_at": "2025-04-15 21:42:11",
        "description": "I'm collaborating with an equity trading team, embedded within one of the worlds largest systematic hedge funds. To aid there seamless data driven ecosystem, they're looking for a Data Engineer to aid several PM teams.\n\nThe firm have a huge data organization underpinning the trading lifecycle, and they place data analytics and data science teams embedded in the front office to enabled more data driven trades and investments.\n\nThe role entails bringing on targeted data sets, pipelining these; and helping to wrangle and analyze the data, ready to assist in signal generation.\n\nStack: Python, AWS, ETL, SQL\n\nThe client are looking to speak to varied Data Engineers from trading backgrounds, with someone technically astute with Python and SQL as well as multiple asset classes.\n\nIf you would like the chance to earn a market leading salary with the opportunity to work in a hybrid model in tandem; then please do apply.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst, Business Development, and Finance",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-equity-trading-quant-hedge-fund-%C2%A3250k-at-paragon-alpha-hedge-fund-talent-business-4209603327?position=3&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=pwOhfKKNiBmVxDA2nNRqEw%3D%3D"
    },
    {
        "title": "Senior Data Analyst",
        "company": "Muzz",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-analyst-at-muzz-4210907908?position=4&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=WP9mrf2fpoGMPxWucSQdSA%3D%3D",
        "scraped_at": "2025-04-15 21:42:11",
        "description": "Senior Data Analyst\nLondon, UK (Hybrid - 2 days)*\n£50,000 - £60,000 + equity\n\nWe’re looking for a smart and ambitious senior data analyst, with real entrepreneurial flair to join our team to understand our members and all the metrics that matter. Love numbers and love being commercial? This role presents a clear pathway to leadership within the team, offering career growth for a motivated and driven individual.\n\nMuzz is the world’s largest Muslim dating and marriage app. We’ve got over 15 million members and have helped more than 600,000 couples get married. We’re on our way to become the first $1 billion Muslim tech brand – but we need your help!\n\nDay to day\n\nYou’ll be joining an 8 strong team of data analysts, data engineers and data scientists whose goal is to grow the company and optimize our product as we expand into new markets around the world\nYou’ll be deeply understanding our user behaviour on the app with a view to generating actionable insights for our product\nYou’ll own reporting – build and maintain dashboards to assess KPIs whilst enabling stakeholders to self-serve their own data questions\nYou’ll provide analytical support across all areas of the product development lifecycle, from opportunity to product strategy, new feature analysis and experimentation\nYou’ll work closely with our product managers, mobile and backend engineers and UX in a cross-functional team\nYou’ll lead on the development of our data transformations and collaborate with data analysts on testing and monitoring our core datasets\n\nRequirements\n\nMinimum of 4 years of professional experience in a dedicated data analytics role, such as a Data Analyst, Business Intelligence Analyst, or similar\nCommercial Experience with a cloud data warehouse such as BigQuery/Redshift\nExcellent SQL knowledge, and proven experience in optimizing queries for performance, scalability, and ease of maintenance\nDesign and implement reusable data models to answer multiple business requirements\nExperience of mentoring junior data analysts or analytics engineers and evolving the environment for them to do their best work\nAbility to work flexibly, be organised and capable of prioritizing requests\nExcellent communication skills and presenting to non-technical audiences\n\nNice to have\nExperience with DBT\nExperience with ThoughtSpot/Looker",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Analyst and Information Technology",
        "industries": "Software Development",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-analyst-at-muzz-4210907908?position=4&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=WP9mrf2fpoGMPxWucSQdSA%3D%3D"
    },
    {
        "title": "Senior Data Insights Analyst at $100m Funded Social-Good Start-Up",
        "company": "Grey Matter Recruitment",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-insights-analyst-at-%24100m-funded-social-good-start-up-at-grey-matter-recruitment-4207349366?position=5&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=z6rHEzzCE3xnbZ5GvVM3DQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:12",
        "description": "This is your chance to perform the job you love and make a difference in society whilst doing it! Help this one-of-a-kind Social Good platform change the world by delivering crucial insights across the business.\n\nThe Company\n$130M funding from over 40 VC investors\nThe platform has raised hundreds of millions of dollars for charities worldwide\nOne of Fast Company's most innovative companies in the world\nHuman-centric company focused on making a real-world positive impact\nStock options, Medical Insurance etc\n\nThe Role\nIn a flat structure reporting to the Director of Analytics, you will own the analytics practice and work on cross-functional data insights\nHelp shape and define this practice and oversee the data insights piece through a period of global expansion\nCollect, analyse and present data from a variety of sources including Web, User Journey, Customer Insights etc\n\nDesired skills and experience\nExtensive BI or analytics and insights experience\nStrong communication and excellent data storytelling skills and experience\nWeb Analytics and GA / GA4 or similar tools experience\neCommerce industry experience",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology, Analyst, and Product Management",
        "industries": "Fundraising, Software Development, and Technology, Information and Media",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-insights-analyst-at-%24100m-funded-social-good-start-up-at-grey-matter-recruitment-4207349366?position=5&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=z6rHEzzCE3xnbZ5GvVM3DQ%3D%3D"
    },
    {
        "title": "Data & Analytics Consultant – Modelling / CRA Data",
        "company": "Ventula Consulting",
        "location": "Nottingham, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208404878?position=6&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ly82loe9aS2dW3sr6nYy8Q%3D%3D",
        "scraped_at": "2025-04-15 21:42:13",
        "description": "Data & Analytics Consultant – Modelling / CRA Data\n\nOne of world’s leading financial services companies (products used by 93% of Fortune 500) requires a Data & Analytics consultant. You will work closely with clients to proactively understand their challenges, propose and develop solutions and lead the execution of analytical and consultancy projects, including the design and development of complex modelling assignments utilising CRA data. You will have frequent engagements with external customers / stakeholders and will manage multiple analytics and consultancy projects.\n\nResponsibilities.\nProactive client engagement, developing partnerships with risk / analytics counterparts within clients; developing a deep knowledge of the relevant industries, clients’ business models, challenges and opportunities to address these.\nLead a small team of analysts, providing supervision and leadership\nWrite compelling proposals to win new analytics and consultancy opportunities\nResponsible for delivering analytics projects leveraging CRA data assets. This includes credit strategy and model developments to the required quality standards and timescales. This will cover all stages, including sample design, retrospective analysis, performance analysis, population split analysis and reject analysis.\nDevelop deep data knowledge in the structure, application and permissible use of data sources, across consumer, commercial and open banking lines of business\nApplication of statistical techniques (including Regression techniques, Machine Learning techniques, Decision Trees, CHAID Analysis & Cluster Analysis) to solve business problems.\nApplication of data mining tools and programming languages Python and SQL to prepare data, undertake analysis and develop solutions for internal and external clients.\nResponsible for presenting proposals, approaches and results to stakeholders, including complex statistical techniques to a range of technical / non technical audiences of all sizes through to C-Suite, to generate improved business decisions and profitability.\nUnderstanding of the regulatory landscape within which the assigned clients operate\nWork closely with internal Sales and Strategy Consulting teams to inform and shape broader opportunities and solutions\n\nWhat experience you need\nExperience in programming languages Python and SQL in a credit risk environment\nExperience in the use of credit bureau data\nAn innovative mindset, with experience identifying opportunities that deliver incremental business benefit through leveraging of data and analytics\nStrong technical expertise and experience of statistical techniques to solve business problems\nStrong communication and consulting skills, with the ability and confidence to present to business partners and clients\nYou possess excellent written and verbal communication skills with the ability to communicate with team members and clients at various levels, including business leaders.\nExperience in leading and management\nPrevious analytical consultancy in a big data environment\nDeep understanding of the industry / regulatory landscape\nExposure to machine learning techniques\nCloud experience using GCP or Amazon AWS\n\nThis position offers a basic salary between £70-80K with an excellent benefits package and bonus scheme. The role requires 3 das a week in the office.\n\nThis is a wonderful opportunity to work for one of the worlds leading financial data companies who are known around the world.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Analyst",
        "industries": "Information Services, Data Infrastructure and Analytics, and Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208404878?position=6&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Ly82loe9aS2dW3sr6nYy8Q%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Searchability NS&D",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-searchability-ns-d-4210605998?position=7&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=09sOuQaPjJqEy0J6jpA2Ew%3D%3D",
        "scraped_at": "2025-04-15 21:42:14",
        "description": "NEW CONTRACT OPPORTUNITY AVAILABLE WITHIN A LEADING NATIONAL SECURITY COMPANY FOR A DATA ENGINEER WITH DV CLEARANCE\n\n\nContract job opportunity for a Data Engineer\nNational Security client\nPalantir Foundry\nFlexible daily rate DOE\nCentral London based organisation in an easily accessible location\nTo apply please call 07704 152 640 / 0203 854 0120 or email dominic.barbet@searchability.com\n\nWHO WE ARE?\nWe are recruiting a contract Data Engineer to work with a leading national security client in central London. Due to the nature of the work, you must hold a DV or enhanced DV Clearance.\n\nWE NEED THE DATA ENGINEER TO HAVE….\nCurrent DV clearance MOD or Enhanced\nExperience with big data tools such as Hadoop, Cloudera or Elasticsearch\nExperience With Palantir Foundry\nExperience working in an Agile Scrum environment with tools such as Confluence / Jira\nExperience in design, development, test and integration of software\nWillingness to learn new technologies\n\n\nIT WOULD BE NICE FOR THE DATA ENGINEER TO HAVE….\nCloud based architectures\nMicroservice architecture or server-less architecture\nMessaging / routing technologies such as Apache Nifi / RabbitMQ\n\n\nTO BE CONSIDERED….\nPlease either apply by clicking online or emailing me directly to dominic.barbet@searchability.com For further information please call me on 0203 854 0120 or 07704 152 640. I can make myself available outside of normal working hours to suit from 7am until 10pm. If unavailable, please leave a message and either myself or one of my colleagues will respond. By applying for this role, you give express consent for us to process & submit (subject to required skills) your application to our client in conjunction with this vacancy only. Also feel free to connect with me on LinkedIn, just search Dominic Barbet. I look forward to hearing from you.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting",
        "industries": "IT Services and IT Consulting and Software Development",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-searchability-ns-d-4210605998?position=7&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=09sOuQaPjJqEy0J6jpA2Ew%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Immersum",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-immersum-4209834793?position=8&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=sXQqlz2K1fX1h2oevLDMjQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:15",
        "description": "Job Title: Lead Data Engineer (leading a team of 5).\nSalary: £130,000 – £150,000 + benefits\nLocation: West London - Hybrid (3 days p/w in-office)\nTech: AWS, Snowflake, Airflow, DBT, Python\n\nThe Company:\nImmersum have engaged with a leading PropTech company on a mission to revolutionise how the property sector understands people, places, and data. By combining cutting-edge data science with powerful location intelligence, they help major organisations make smarter, faster decisions. Backed by top-tier investors and growing fast, this is your chance to shape the future of PropTech from the inside.\n\nThe Role Requirements:\nYou’ll take ownership of the design and delivery of scalable, high-performing data pipelines that drive core product features and insights. Sitting at the heart of the engineering and data function, you’ll play a critical role in the company’s continued success. You will also lead a small team of 5 Data Engineers to up skill and lead by example.\n\nWhat you’ll be doing:\nLeading the build of reusable, production-grade data flows\nDesigning high-performance data processing and streaming systems\nDefining best practices in data modelling, integration, and storage\nEnsuring code quality, performance, and maintainability at scale\nCollaborating across product, data science, and engineering teams\nLeading a small team of 5 data engineers\n\nWhat you’ll bring:\nStrong leadership experience in data engineering\nDeep expertise with AWS, Snowflake, Airflow, and DBT\nA pragmatic, product-first approach to building data systems\nExcellent communication and stakeholder management skills\nSolid understanding of agile data development lifecycles\n\nWhy Join:\nBe a key player in a fast-growing, mission-led PropTech scale-up\nOwn greenfield projects and shape the data engineering roadmap\nExcellent opportunities for career growth\nBuild innovative products that are redefining an entire industry",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT System Custom Software Development, Data Infrastructure and Analytics, and IT System Data Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-immersum-4209834793?position=8&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=sXQqlz2K1fX1h2oevLDMjQ%3D%3D"
    },
    {
        "title": "Data Engineer",
        "company": "Tenth Revolution Group",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-engineer-at-tenth-revolution-group-4204808631?position=9&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=p900WKXhIIEIkqmPhWOLCg%3D%3D",
        "scraped_at": "2025-04-15 21:42:16",
        "description": "Data Engineer\nI am working with a data driven Microsoft partnered consultancy who are looking for a Databricks Data Engineer to join their growing team. You will have the opportunity to work with some of the latest Microsoft technologies with a focus on projects on Databricks implementations.\n\nYou will join a team at the centre of a number of data-driven projects where you will be responsible for the design, development and creation of data solutions. You will work on the full end-to-end product lifecycle from platform design to insights creation.\n\nAs part of this role, you will be responsible for some of the following areas\nDesign, develop and maintain data pipelines that are responsible for the ingestion and transformation of data between different sources\nCreate and develop data models\nDevelopment of cloud data platforms solutions\n\nTo be successful in the role you will have\nSolid experience designing and delivering data solutions focused on Databricks\nStrong ETL experience with tools such as ADF or SSIS\nExperience working with Azure technologies – Synapse, Fabric, Data Lake\nKnowledge of data architecture principles and data modelling\n\nIn this role you will be required to attend the office on an ad-hoc basis in London, with the remaining time spent working remotely. Some of the benefits included with the role are listed below\nStarting salary of up to £60,000\nPerformance related annual bonus\n25 days annual leave (plus bank holidays)\nEmployer pension contribution scheme\nPrivate health/medical care\nVarious retail discounts and more!\n\nThis is just a brief overview of the role. For the full information, simply apply to the role with your CV, and I will call you to discuss further. My client is looking to begin the interview process ASAP, so don’t miss out, APPLY now! To do so please email me at a.pinkerton@tenthrevolution.com or call me on 0191 3387487.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Staffing and Recruiting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-engineer-at-tenth-revolution-group-4204808631?position=9&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=p900WKXhIIEIkqmPhWOLCg%3D%3D"
    },
    {
        "title": "Commercial Finance Analyst",
        "company": "Freshminds",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=10&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Zb%2F2yELe4hZZnfsMKkgOFQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:18",
        "description": "Freshminds has partnered with a leading entertainment brand looking to hire an Investment and Property Business Partner to drive key strategic initiatives within its investment & property people and technology functions.\n\nWorking closely with senior management and reporting to the Director of Commercial Finance, you’ll provide data-driven insights to enhance decision-making, assess capital investments, and track the performance of new sites, technology, and workforce initiatives.\n\nWhat you’ll be doing:\nManaging investment cases for property, new sites, and technology.\nDeveloping reports and analysis to support investment and capital planning.\nIdentifying trends, risks, and opportunities using advanced analytics.\n\nRequirements:\nStrong data and analytical skills (SQL, Advanced Excel, Power BI with Python/Amazon RDS desirable).\nExperience in investment, property, or multi-site businesses.\nProven consulting skill-set.\nAbility to translate complex challenges into actionable insights.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting, Finance, and Strategy/Planning",
        "industries": "Entertainment Providers",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/commercial-finance-analyst-at-freshminds-4207336064?position=10&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=Zb%2F2yELe4hZZnfsMKkgOFQ%3D%3D"
    },
    {
        "title": "Principal Data Consultant",
        "company": "Fynity",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/principal-data-consultant-at-fynity-4194399546?position=11&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=rfgjG17t0EXjhaLpKDr3sw%3D%3D",
        "scraped_at": "2025-04-15 21:42:19",
        "description": "Principal Data Consultant\n\nPrincipal Data Consultant required by a dynamic and leading boutique data strategy consultancy.\n\nThis is a fantastic opportunity to work on interesting and complex data strategy and transformation projects. You will get to engage with a wide variety of clients from large enterprises and small start-ups to niche charities. taking ownership of projects across the full lifecycle\n\nThe Role\nIn this client-facing, Principal Data Consultant role, you will lead and drive high-impact strategic data initiatives for clients. You will work across and lead a variety of different client projects spanning data strategy formation, data maturity assessments, data literacy initiatives and data governance as well as more technical data/analytics projects.\n\nDay-to-day, you will be the client’s primary point of contact, lead workshops with senior stakeholders, define the scope of work and manage the project plan, mentoring and guiding more junior team members when required. You will also get the opportunity to use your hands-on data skills, whether that be in coding, assisting with data migrations or integration.\n\nThis is a varied and interesting role where which will tap into your broad and deep knowledge of data to help harness solutions and solve client problems. The need is very much for a do-er… not just a ‘thought leader’.\n\nWhat do you need?\nTo be considered, you will have a strong background in managing and delivering complex and/or strategic data projects or transformations across the full lifecycle.\n\nIdeally, you will have experience from within a client-facing consultancy environment where you can evidence success on a range of different strategy, advisory and solution delivery projects.\n\nYou will have experience in creating data strategy and will be highly familiar with data maturity assessments, data vision generation, use case & value mapping and data literacy.\n\nIn terms of technical skills, you will bring some experience in designing, building and configuring end-to-end analytics solutions, writing code (e.g. SQL, Python), data modelling, data migration and a knowledge of general IT architecture and systems integration. You should also bring good skills in documentation.\n\nFinally, you will bring a real passion for data and must have excellent communication and presentation skills up to CxO level, with the ability to build relationships to trusted advisor level. Commercial exposure to developing and delivering successful proposals, presentations or bids is also desirable, and you must be a self-starter who can lead and take ownership of projects and teams, guiding them to achieve goals and objectives.\n\nWhat is on offer?\nThis is a hybrid role that offers lots of flexibility to work remotely, but visits to the office in London (London Bridge) are required 1-2 times per week to collaborate with your colleagues. There may also be occasional visits to client sites as well as the group HQ in Surrey.\n\nOn offer is an excellent salary (depending on your level of experience), from £70,000 to £90,000 as well as an annual bonus of c£5k-£8k (paid quarterly), private medical, contributory matched pension (up to 5%), 25 days holiday and other benefits.\n\nIf you are a Senior Data Consultant ready to step up or a Principal Data Consultant looking for an exciting new challenge - APPLY NOW - interviewing immediately!",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Information Technology",
        "industries": "IT Services and IT Consulting and Business Consulting and Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/principal-data-consultant-at-fynity-4194399546?position=11&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=rfgjG17t0EXjhaLpKDr3sw%3D%3D"
    },
    {
        "title": "Data & Analytics Consultant – Modelling / CRA Data",
        "company": "Ventula Consulting",
        "location": "Leeds, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208407234?position=12&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=nQ4l5ZpM0%2FWrsD39kTzesA%3D%3D",
        "scraped_at": "2025-04-15 21:42:20",
        "description": "Data & Analytics Consultant – Modelling / CRA Data\n\nOne of world’s leading financial services companies (products used by 93% of Fortune 500) requires a Data & Analytics consultant. You will work closely with clients to proactively understand their challenges, propose and develop solutions and lead the execution of analytical and consultancy projects, including the design and development of complex modelling assignments utilising CRA data. You will have frequent engagements with external customers / stakeholders and will manage multiple analytics and consultancy projects.\n\nResponsibilities.\nProactive client engagement, developing partnerships with risk / analytics counterparts within clients; developing a deep knowledge of the relevant industries, clients’ business models, challenges and opportunities to address these.\nLead a small team of analysts, providing supervision and leadership\nWrite compelling proposals to win new analytics and consultancy opportunities\nResponsible for delivering analytics projects leveraging CRA data assets. This includes credit strategy and model developments to the required quality standards and timescales. This will cover all stages, including sample design, retrospective analysis, performance analysis, population split analysis and reject analysis.\nDevelop deep data knowledge in the structure, application and permissible use of data sources, across consumer, commercial and open banking lines of business\nApplication of statistical techniques (including Regression techniques, Machine Learning techniques, Decision Trees, CHAID Analysis & Cluster Analysis) to solve business problems.\nApplication of data mining tools and programming languages Python and SQL to prepare data, undertake analysis and develop solutions for internal and external clients.\nResponsible for presenting proposals, approaches and results to stakeholders, including complex statistical techniques to a range of technical / non technical audiences of all sizes through to C-Suite, to generate improved business decisions and profitability.\nUnderstanding of the regulatory landscape within which the assigned clients operate\nWork closely with internal Sales and Strategy Consulting teams to inform and shape broader opportunities and solutions\n\nWhat experience you need\nExperience in programming languages Python and SQL in a credit risk environment\nExperience in the use of credit bureau data\nAn innovative mindset, with experience identifying opportunities that deliver incremental business benefit through leveraging of data and analytics\nStrong technical expertise and experience of statistical techniques to solve business problems\nStrong communication and consulting skills, with the ability and confidence to present to business partners and clients\nYou possess excellent written and verbal communication skills with the ability to communicate with team members and clients at various levels, including business leaders.\nExperience in leading and management\nPrevious analytical consultancy in a big data environment\nDeep understanding of the industry / regulatory landscape\nExposure to machine learning techniques\nCloud experience using GCP or Amazon AWS\n\nThis position offers a basic salary between £70-80K with an excellent benefits package and bonus scheme. The role requires 3 das a week in the office.\n\nThis is a wonderful opportunity to work for one of the worlds leading financial data companies who are known around the world.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Consulting and Analyst",
        "industries": "Information Services, Data Infrastructure and Analytics, and Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-analytics-consultant-%E2%80%93-modelling-cra-data-at-ventula-consulting-4208407234?position=12&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=nQ4l5ZpM0%2FWrsD39kTzesA%3D%3D"
    },
    {
        "title": "Executive Assistant",
        "company": "Eden Recruitment Ltd",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=13&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=kq1vRleBcVwb3d0Dp7DFJA%3D%3D",
        "scraped_at": "2025-04-15 21:42:22",
        "description": "Executive Assistant - Global Financial Services\n\nJoin a globally respected financial services firm known not just for its high performance, but for its incredible culture and show-stopping offices. We’re on the lookout for a Executive Assistant to support a high-calibre team, including Senior Managing Directors and VPs—people at the top of their game.\n\nThis is more than just a traditional EA role. You’ll be a key player, helping to keep the gears moving smoothly in a fast-paced, high-stakes environment, where your expertise is respected and your contributions truly matter.\n\nWhat You’ll Be Doing:\nSeamlessly support a dynamic team of senior leaders.\nManage highly complex calendars and juggle competing priorities.\nOrganise detailed global travel itineraries with precision.\nAct as a trusted point of contact internally and externally.\nHelp nurture an inclusive, energising team culture.\n\nWhat We're Looking For:\nSolid experience as an Executive Assistant—financial services experience is highly desired.\nHigh level ability to manage schedules and travel across time zones.\nA curious, solution-focused mindset—you’re always one step ahead.\nNext-level organisation and multitasking skills.\nStrong emotional intelligence and top-tier communication skills.\n\nWhy You’ll Love It Here:\nA collaborative, respectful, and people-first culture—you’ll feel valued from day one.\nCareer growth and learning opportunities that will keep you challenged and inspired.\nHybrid flexibility (3 days in-office, 2 remote).\nA competitive salary + benefits package that recognises your worth.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Administrative",
        "industries": "Financial Services, Investment Banking, and Venture Capital and Private Equity Principals",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/executive-assistant-at-eden-recruitment-ltd-4210617004?position=13&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=kq1vRleBcVwb3d0Dp7DFJA%3D%3D"
    },
    {
        "title": "Business Analyst",
        "company": "Crimson",
        "location": "Birmingham, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-crimson-4207387341?position=14&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gA%2FIjNfHshfs9mouK8vEGA%3D%3D",
        "scraped_at": "2025-04-15 21:42:23",
        "description": "Business Analyst – Birmingham\n\nBirmingham – Hybrid 3 days\n\nSalary - £50,000 - £60,000 per annum\n\nOur client is seeking a highly skilled Business Analyst to join an existing BA team. In this role, you will act as a crucial link between business needs and technical solutions, ensuring seamless alignment across various sectors. Your efforts will focus on enhancing processes and delivering impactful results. The role will support a range of IT projects, encompassing both application and infrastructure-related initiatives.\n\n\nKey Skills and Responsibilities:\n\n- Proven track record working on business change and business projects as a Business Analyst\n- Conduct thorough and detailed analysis of current business processes, employing process mapping tools and methodologies to identify inefficiencies and optimisation opportunities.\n- Build and maintain strong, collaborative relationships across various business units, ensuring clear, consistent, and transparent communication. Engage with stakeholders at all levels to align business objectives and ensure their needs and expectations are met.\n- Lead and facilitate comprehensive workshops, in-depth interviews, and interactive focus groups to meticulously capture, document, and validate detailed business requirements.\n- Collaborate closely with technical teams, including software developers, system architects, and IT specialists, to translate complex business needs into actionable and practical technical solutions.\n- Identify and implement opportunities for process optimisation and continuous improvement using Agile methodology. Develop and track key performance indicators (KPIs) to measure the effectiveness of process improvements and deliver measurable business benefits.\n- Law or Finance background is advantageous\n\nInterested? Please submit your updated CV to Emma Siwicki at Crimson or immediate consideration.\nNot interested? Do you know someone who might be a perfect fit for this role? Refer a friend and earn £250 worth of vouchers!\n\nCrimson is acting as an employment agency regarding this vacancy",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-analyst-at-crimson-4207387341?position=14&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=gA%2FIjNfHshfs9mouK8vEGA%3D%3D"
    },
    {
        "title": "Data Acquisition Lead",
        "company": "Invecta",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/data-acquisition-lead-at-invecta-4209888661?position=15&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fU6QyKMlap1Mq3VtrfjALQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:24",
        "description": "We are working with a leading insurance organsiation who are looking for a Data Acquisition Lead to play a key role in supporting their data lake and lakehouse architecture strategy. You will work closely with data architects and data scientists to acquire and document production-ready data sources, utilising modern methods and tools in line with best practice.\n\nKey Responsibilities\nCollaborate with data engineers, architects, and scientists to source and integrate corporate data assets.\nSupport the development of scalable and efficient data pipelines (ETL/ELT), ensuring data is clean, transformed, and ready for analytics.\nDrive the acquisition and sharing of data for counter-fraud and strategic insight purposes.\nApply best-in-class data documentation and governance principles.\nWork within the framework of data protection and information governance, ensuring compliance with relevant legislation.\nBuild strong stakeholder relationships to secure strategic data assets.\n\nAbout You\nYou are someone who brings strong technical knowledge combined with stakeholder and project management skills. You understand the complexity of data across large, multi-functional organisations and know how to turn strategy into practical, operational outcomes.\n\nRequired Experience\nProven experience in acquiring, processing, and sharing data in large or complex organisations.\nStrong background in data engineering and ETL development.\nExperience working with diverse data sources and building production-ready pipelines.\nSolid understanding of data protection laws and governance frameworks.\nTrack record of influencing stakeholders and managing cross-functional relationships.\nExperience in delivering reports and dashboards for performance and analytical use.\nFamiliarity with data science and analytics concepts.\n\nKey Skills\nStrong analytical and numerical reasoning.\nDeep understanding of data structures and database management.\nConfident problem solver with innovative and strategic thinking abilities.\nExcellent communication, influencing, and negotiation skills.\nAbility to balance multiple priorities and deliver under pressure.\nSkilled in translating strategic objectives into actionable plans.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology, Analyst, and Accounting/Auditing",
        "industries": "Insurance, Financial Services, and Business Consulting and Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/data-acquisition-lead-at-invecta-4209888661?position=15&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=fU6QyKMlap1Mq3VtrfjALQ%3D%3D"
    },
    {
        "title": "Head of Data Management",
        "company": "Forsyth Barnes",
        "location": "West Midlands, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/head-of-data-management-at-forsyth-barnes-4210575031?position=16&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=tYW8pbN2Z4TS6fuLY7hhLA%3D%3D",
        "scraped_at": "2025-04-15 21:42:25",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/head-of-data-management-at-forsyth-barnes-4210575031?position=16&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=tYW8pbN2Z4TS6fuLY7hhLA%3D%3D"
    },
    {
        "title": "IT Business Analyst",
        "company": "Huntr Talent Group",
        "location": "Brierley Hill, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/it-business-analyst-at-huntr-talent-group-4210602428?position=17&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=YWr78mNJdUQ9pXXn4vCjvw%3D%3D",
        "scraped_at": "2025-04-15 21:42:27",
        "description": "Job Overview:\nOur client is looking for an IT Business Analyst to join their team. The role involves a focus on identifying opportunities for innovation, optimising processes, and ensuring the successful implementation of technology-driven solutions\n\nKey Responsibilities\nPartner with the IT Director to assess and enhance the firm’s legal services through technological advancements and process improvements.\nDevelop and present comprehensive project plans to the Strategy Board, outlining objectives, scope, timelines, and resource needs.\nConduct in-depth research and analysis to support project proposals and strategic recommendations.\nLead and oversee project initiatives, ensuring adherence to agreed-upon processes and timelines.\nTrack project progress and provide regular status updates to the IT Director.\nWork collaboratively with the Development, Infrastructure, and Operations teams to design, configure, and deploy necessary systems and tools.\nCoordinate with the training team to organize workshops and training sessions, ensuring a smooth transition to new technologies and processes.\nAssess the effectiveness of implemented projects, reporting on outcomes and applying lessons learned to future initiatives.\n\nPerson Specification\nProven experience as a Business Analyst within professional services.\nA successful track record in delivering internal consultancy projects.\nExperience collaborating with cross-functional teams and managing stakeholders.\nStrong analytical and problem-solving skills.\nExcellent communication and interpersonal abilities.\nStrong organizational skills, with the ability to manage multiple projects simultaneously.\nDemonstrated experience in business process optimization and technology implementation.\nA results-driven mindset with accountability for project outcomes.\n\nDetails\nFull time\nHybrid working (4 days onsite, 1 day offsite)\nPaying £60,000",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "IT Services and IT Consulting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/it-business-analyst-at-huntr-talent-group-4210602428?position=17&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=YWr78mNJdUQ9pXXn4vCjvw%3D%3D"
    },
    {
        "title": "Senior Data/Analytics Engineer",
        "company": "Wave Talent",
        "location": "United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-analytics-engineer-at-wave-talent-4190843332?position=18&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PtDcaedEt9usM0dr0OXqGg%3D%3D",
        "scraped_at": "2025-04-15 21:42:28",
        "description": "💻 Job Title: Senior Data/Analytics Engineer\n💰 Salary: up to £115k\n🌴 38 days of annual leave + bank holidays\n🔗 Industry: B2B2C platform\n📍 Location: could be mostly remote\nideally in close proximity to London or Edinburgh to visit the office on weekly basis, however, open to only monthly visits to either office\n\nWith 1.1 million members and over 300 corporate clients (including the likes of Amazon, Google and HSBC to name just a few), this rapidly growing data and technology platform is a UK leader in their field.\n\nAs the company's first dedicated Data hire, working directly under the CTO, you'll establish the foundation for their data infrastructure and analytics capabilities. This is a unique opportunity to build and shape the data landscape from the ground up, working closely with cross-functional teams to enable data-driven decision-making across the organisation.\n\nThis pivotal role sits somewhere between Data Engineering and Analytics Engineering and will involve:\nDesigning, developing, and maintaining scalable data models and pipelines to ensure clean, well-structured data for analytics and reporting\nImplementing and maintaining ELT/ETL processes using tools like DBT and Fivetran\nOwning and optimising data warehousing (Snowflake) and ensuring efficient data management\nCollaborating with software engineers, product managers and business stakeholders to understand data needs and deliver high-quality, accessible datasets\nEstablishing best practices for data governance, quality, documentation and version control\nIdentifying opportunities to improve data accessibility and driving automation in data workflows\n\n✅ Must have requirements:\nStrong proficiency in SQL and DBT\nAt least intermediate proficiency in Python and Git\nExperience designing, building and maintaining data pipelines\nFamiliarity with date warehousing architecture and implementation\nVisualisation experience, ideally with Tableau\n\n👍 Bonus points for:\nExperience with Fivetran and Snowflake\nFamiliarity with cloud infrastructure (ideally AWS)\nExperience with Terraform and Docker\n\n🛂 Please note: unfortunately, this role does not offer VISA sponsorship.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Information Technology",
        "industries": "Technology, Information and Media",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-analytics-engineer-at-wave-talent-4190843332?position=18&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=PtDcaedEt9usM0dr0OXqGg%3D%3D"
    },
    {
        "title": "Business Analyst",
        "company": "TXM Recruit",
        "location": "London Area, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/business-analyst-at-txm-recruit-4207394466?position=19&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=ta3JCE4vHhOtLZjq5LUKKg%3D%3D",
        "scraped_at": "2025-04-15 21:42:29",
        "description": "Job Title: Business Analyst – IT\nLocation: London (Hybrid)\nSalary: £65,000 + Bonus + Excellent Benefits\n\nAre you an experienced Business Analyst ready to make an impact on high-profile digital transformation initiatives? This is a unique opportunity to join a forward-thinking organisation undergoing a major IT transformation, with a multi-year roadmap to modernise its entire technology estate.\n\nThe Opportunity\nOur client is delivering a broad portfolio of change across every business function—spanning customer experience, commercial, operations, finance, and HR. With numerous new and ongoing projects, they are expanding their Business Analysis function and looking for skilled professionals to help drive innovation and business value.\nYou'll play a critical role in bridging the gap between business stakeholders and solution delivery teams, ensuring that requirements are accurately captured, well-understood, and successfully delivered.\n\nWhat You’ll Be Working On\nYou'll contribute to projects such as:\nRedeveloping customer-facing websites\nDriving efficiencies through robotic process automation and AI\nRolling out new IT service management capabilities\nSupporting large-scale enterprise integrations with 3rd-party suppliers\nEnhancing commercial and operational performance through modern tech solutions\n\nThis is part of a wider transformation to a digital-first, cloud-enabled operating model designed to accelerate time-to-value and embed innovation at the core of the business.\n\nAbout You\nYou’re a seasoned Business Analyst who thrives in complex, fast-paced environments. You bring a strategic mindset, strong attention to detail, and the ability to align diverse stakeholder groups around a shared vision. You’re also confident navigating both Agile and Waterfall methodologies, and adept at leading cross-functional workshops.\n\nKey Requirements\nProven experience as a Business Analyst within large-scale IT or digital transformation programmes\nTrack record of working on complex integration projects, especially involving 3rd-party suppliers\nStrong stakeholder management and facilitation skills, including experience working with senior business leaders\nExcellent verbal and written communication skills\nDeep experience in process engineering and requirement documentation\n\nWe’d love to hear from you even if you don’t meet every requirement!",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Research, Analyst, and Information Technology",
        "industries": "Staffing and Recruiting",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/business-analyst-at-txm-recruit-4207394466?position=19&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=ta3JCE4vHhOtLZjq5LUKKg%3D%3D"
    },
    {
        "title": "Senior Data Engineer",
        "company": "Perch Group",
        "location": "Blackpool, England, United Kingdom",
        "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-perch-group-4210909975?position=20&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2BZJlvpUpmprL027dAG5ZsQ%3D%3D",
        "scraped_at": "2025-04-15 21:42:30",
        "description": "📢Perch Group are searching for a Senior Data Engineer.\n\nAt Perch Group, our vision is clear: to lead the UK debt purchase and collection industry by harnessing cutting-edge technology to drive ethical, efficient, and data-driven debt resolution.\nOur annual mission is to empower hundreds of thousands of customers to positively engage with and resolve their outstanding debts. We do this through an empathetic and customer-centric approach that is at the heart of our success.\n\nTo support our ambitious growth agenda, Perch Group is expanding its development team and seeks a Senior Data Engineer. This permanent role will lead a team focused on delivering robust data solutions across our five businesses. You will leverage your deep expertise in traditional data engineering (database design, T-SQL) and Microsoft Azure's data services (Data Factory, Power BI, and pipelines) to address complex business challenges. We are looking for a candidate who can effectively translate business requirements into technical specifications and guide a team to successful implementation.\n\n💵£60,000-70,000 + up to 20% of your annual salary, paid as a bonus.\n📍This role is based at our Blackpool office. We offer hybrid working options.\n\nYou'll make a major contribution by demonstrating…\n\nAccountabilities\n\nTechnical Leadership & Mentorship\nProvide technical leadership and guidance to the data engineering team, fostering a culture of technical excellence and innovation.\nMentor junior engineers, sharing technical expertise and best practices to enhance their skills and knowledge.\n\nData Architecture & Design\nArchitect and implement robust designs, ensuring optimal performance, scalability, and security.\nTranslate high-level solution designs into detailed technical specifications, including data models, ETL processes, and database schemas.\nEstablish and enforce data modelling best practices, promoting data integrity and consistency across all platforms.\n\nETL Development & Optimization\nDevelop and optimize complex ETL pipelines for diverse data sources (on-premise and cloud-based), utilizing best practices for data extraction, transformation, and loading.\nImplement data quality checks and validation processes within ETL pipelines, ensuring data accuracy and reliability.\nOptimize ETL performance for speed and efficiency, addressing bottlenecks and improving data processing times.\n\nData Platform Management & Governance\nMaintain and enhance the company's data platforms, ensuring high availability, performance, and security.\nImplement data governance policies and procedures, ensuring compliance with data quality standards and regulatory requirements.\nDesign and implement data observability and data quality monitoring solutions, enabling proactive identification and resolution of data issues.\n\nMeasures\n\nETL Performance Metrics\nMeasured by ETL pipeline execution time, throughput, and resource utilization.\nPerformance of database query optimisation and data retrieval.\n\nData Quality & Accuracy\nMeasured by data accuracy rates, data validation pass rates, and the number of data quality incidents.\nAccuracy of business logic and ETL conversion.\n\nDelivery Efficiency & Timeliness\nMeasured by the speed and efficiency of data solution delivery, including adherence to project timelines and milestones.\nSpeed of delivery.\n\nCode Quality & Reusability\nMeasured by code review metrics, adherence to coding standards, and the level of code reusability.\n\nBehaviours\n\nTechnical Passion & Innovation\nDemonstrates a strong passion for data technologies and a commitment to staying up-to-date with the latest trends and best practices.\nProactively seeks out opportunities to improve data processes and leverage new technologies.\n\nProblem-Solving & Best Practices\nPossesses a strong problem-solving mindset, with the ability to identify and resolve complex technical challenges.\nAdheres to and promotes data engineering best practices, ensuring code quality, performance, and maintainability.\n\nContinuous Learning & Growth\nEmbraces a growth mindset, with a strong desire for continuous learning and professional development.\nActively seeks out opportunities to expand technical skills and knowledge.\n\nTechnical Communication & Collaboration\nCommunicates technical concepts clearly and effectively to both technical and non-technical audiences.\nCollaborates effectively with cross-functional teams, fostering a positive and productive work environment.\nConfident communicator, who can articulate problems and solutions just as clearly to the executive team as to engineering teams.\n\n\n\nYou should apply for this role if you have the following experience…\n\nEssential\n\nMinimum 5+ years of experience in designing and implementing data ETL processes and design.\nExpert-level proficiency in T-SQL, SSIS, and the Microsoft data stack (SQL Server, Azure SQL Database).\nProven experience in designing and implementing data models and database schemas for complex data environments.\nStrong understanding of data quality principles and best practices, with experience implementing data governance policies.\nDemonstrated ability to troubleshoot and resolve complex data-related issues.\nStrong analytical and problem-solving skills.\nStrong teamwork, interpersonal and collaboration skills with colleagues and clients.\n\nDesirable\n\nProficiency in Azure Active Directory for managing identities and service principals.\nExperience with Azure DevOps for CI/CD pipeline development and data operations (DataOps).\nExperience with Python or other relevant coding languages.\nExperience with Data Observability tools.\n\n\n⌛️The Application Timeline\n\nA first stage video call with the internal recruitment team (15 minutes)\nA second stage call with the hiring manager (15 minutes)\nA face to face or video call with the hiring manager (45 minutes - 60 minutes)\n\nTypically, the average successful applicant will be within this timeline for 2-3 weeks. Please note we will close this role once we have enough applications for the next stages therefore you should submit your application asap to avoid any disappointment.\n\nIf you do not receive a response after 3 weeks of applying, please assume you have been unsuccessful as we may experience a high volume of applications.\n\nIf you have any questions or suggestions of how we can assist you in your application due to disability or personal reasons, please email recruitment@perchgroup.co.uk.\n\nWhat’s In It For You\n\n💵 £60,000-70,000 + up to 20% of your annual salary, paid as a bonus.\n📍This role is based at our Blackpool office. We offer hybrid working options.\n⏰ 37.5 hours per week. We offer flexible working hours between our core hours of 8am- 6pm, Monday to Friday.\n🎓 The opportunity to complete formal qualifications and learn on the job in a successful, growing organisation.\n➕ And many more benefits to support your wellbeing and professional development.\n\nWe are an equal opportunities employer\n\nWe’re an equal opportunity employer. All applicants will be considered for employment without attention to age, ethnicity, religion, sex, sexual orientation, gender identity, family or parental status, national origin, or veteran, neurodiversity or disability status.\n\nAt Perch, our strength lies in our team, their enthusiasm, and their passion for the business. Whether you’re looking to gain foundational skills in financial services, have a knack for customer service, or seek to expand your horizons, we likely have the perfect opportunity for you.",
        "seniority_level": "Mid-Senior level",
        "employment_type": "Full-time",
        "job_function": "Business Development",
        "industries": "Financial Services",
        "company_logo": "",
        "apply_link": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-perch-group-4210909975?position=20&pageNum=0&refId=OZzOez9B8WROGoOVEAYK%2Bg%3D%3D&trackingId=%2BZJlvpUpmprL027dAG5ZsQ%3D%3D"
    }
]